pages/research/publications.org
# -*- org-attach-id-dir: "../../files/attachments"; -*-
#+title: Publications
#+CSL-STYLE: ../../files/complete-online.csl

* Publications

** Submitted and under review

#+begin: sd/bibliography :key category :value submitted
<<citeproc_bib_item_1>>Peter Mann and Simon Dobson.  /Alternative Expression of Message Passing on Networks/. Submitted to Physical Review E.

<<citeproc_bib_item_2>>Alison Johnston, Vincent Lostanien, Tiago Marques, Sophie Palmer, Bronte Stones, Simon Dobson, Steve Buckland, Holger Klinck, Olivier Metcalf, and Martin Cox.  /Distance Sampling with Acoustic Classification/. Submitted to Methods in Ecology and Evolution.
#+end:

** Books

#+begin: sd/bibliography :key category :value book
<<citeproc_bib_item_1>>Simon Dobson.  /[[https://simondobson.org/introduction-to-epidemics/][Epidemic Modelling – Some Notes, Maths, and Code]]/. Independent Publishing Network. ISBN 978-183853-565-0. 2020.
#+end:

