research/publications/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>Publications | Simon Dobson</title>
<link rel="icon" href="../../images/favicon.png" sizes="16x16">
<link rel="alternate" type="application/rss+xml" href="../../rss.xml">
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Droid+Sans+Mono|Libre+Baskerville|Montserrat|Playfair+Display|Tangerine">
<link rel="stylesheet" href="../../assets/css/libretto_styles.css">
<link rel="stylesheet" href="../../assets/css/baguetteBox.min.css">
<link rel="stylesheet" href="../../assets/css/code.css">
<link rel="stylesheet" href="../../assets/css/nikola_rst.css">
<link rel="stylesheet" href="../../assets/css/nikola_ipython.css">
<link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.0.13/css/all.css" integrity="sha384-DNOHZ68U8hZfKXOrtjWvjxusGo9WQnrNx2sqG0tfsghAvtVlRW3tvkXWZh58N9jp" crossorigin="anonymous">
</head>
<body>
    <!-- Navigation bar -->
    <header class="nav-bar"><div class="site-branding">
	    <h1 class="site-title">
		<a href="https://simondobson.org/" title="Simon Dobson" rel="home">Simon&nbsp;Dobson</a>
	    </h1>
	</div>
	<nav class="site-navigation" role="navigation"><div class="menu-toggle">
		<span class="mobile-site-title">Simon Dobson</span>
	    </div>
	    <ul class="menu">
<li><a href="../../index.html">Home</a></li>
		    <li><a href="../../personal/">About&nbsp;me</a></li>
		    <li><a href="../">Research</a></li>
		    <li><a href="../../development/projects/">Software</a></li>
		    <li><a href="../../writing/">Writing</a></li>
		    <li><a href="../../personal/contact/">Contact</a></li>
		<li>
<a href="../../rss.xml"><i class="fa fa-rss"></i></a>
	    </li>
</ul></nav></header><!-- Page Header --><div class="title-block post-format-icon-pin">
	<h1>Publications</h1>
    </div>

	<!-- Page Content -->
    <div class="site-content" role="main">
	<article class="format-standard libretto-long-form"><div class="entry-content">
		<div id="outline-container-org44db5a7" class="outline-2">
<h2 id="org44db5a7">Publications</h2>
<div class="outline-text-2" id="text-org44db5a7">
</div>
<div id="outline-container-org7e1ec9d" class="outline-3">
<h3 id="org7e1ec9d">Submitted and under&nbsp;review</h3>
<div class="outline-text-3" id="text-org7e1ec9d">
<p>
<a id="orgbc7dcb0"></a>Peter Mann and Simon Dobson.  <i>Alternative Expression of Message Passing on Networks</i>. Submitted to Physical Review&nbsp;E.
</p>

<p>
<a id="org8f264d0"></a>Alison Johnston, Vincent Lostanien, Tiago Marques, Sophie Palmer, Bronte Stones, Simon Dobson, Steve Buckland, Holger Klinck, Olivier Metcalf, and Martin Cox.  <i>Distance Sampling with Acoustic Classification</i>. Submitted to Methods in Ecology and&nbsp;Evolution.
</p>
</div>
</div>

<div id="outline-container-orgd8f097e" class="outline-3">
<h3 id="orgd8f097e">Books</h3>
<div class="outline-text-3" id="text-orgd8f097e">
<p>
<a id="org576f425"></a>Simon Dobson.  <i><a href="https://simondobson.org/introduction-to-epidemics/">Epidemic Modelling – Some Notes, Maths, and Code</a></i>. Independent Publishing Network. <span class="caps">ISBN</span> 978-183853-565-0.&nbsp;2020.
</p>
</div>
</div>
