research/publications/index.html

<div id="outline-container-orgfddc1a4" class="outline-3">
<h3 id="orgfddc1a4">Journal&nbsp;articles</h3>
<div class="outline-text-3" id="text-orgfddc1a4">
<p>
<a id="org70d7b11"></a>Tianyuan Zheng, John Mitchell, and Simon Dobson.  <i><a href="https://doi.org/https://doi.org/10.1021/acsomega.4c06163">Revisiting the Application of Machine Learning Approaches in Predicting Aqueous Solubility</a></i>. <span class="caps">ACS</span> Omega <b>9</b>.&nbsp;2024.
</p>

<p>
<a id="orgd181982"></a>Martin Schiemer, Lei Fang, Simon Dobson, and Juan Ye.  <i><a href="https://doi.org/10.1016/j.pmcj.2023.101817">Online Continual Learning for Human Activity Recognition</a></i>. Pervasive and Mobile Computing <b>93</b>.&nbsp;2023.
</p>

<p>
<a id="orgf9d7535"></a>Peter Mann and Simon Dobson.  <i><a href="https://doi.org/10.1103/PhysRevE.107.054303">Belief Propagation on Networks with Cliques and Chordless Cycles</a></i>. Physical Review E <b>107</b>.&nbsp;2023.
</p>

<p>
<a id="org973f4c6"></a>Simon Dobson.  <i><a href="https://doi.org/10.21105/joss.03764">epyc: Computational Experiment Management in Python</a></i>. Journal of Open-Source Software <b>7</b>.&nbsp;2022.
</p>

<p>
<a id="orgbd36191"></a>Peter Mann, V. Anne Smith, John Mitchell, and Simon Dobson.  <i><a href="https://doi.org/10.1103/PhysRevE.106.014304">N-Strain Epidemic Model Using Bond Percolation</a></i>. Physical Review E <b>106</b>.&nbsp;2022.
</p>

<p>
<a id="orgb3e5322"></a>Peter Mann, V. Anne Smith, John Mitchell, and Simon Dobson.  <i><a href="https://doi.org/10.1103/PhysRevE.105.044314">Degree Correlations in Graphs with Clique Clustering</a></i>. Physical Review E <b>105</b>.&nbsp;2022.
</p>

<p>
<a id="orgf7ad8c4"></a>Peter Mann, V. Anne Smith, John Mitchell, and Simon Dobson.  <i><a href="https://doi.org/10.1103/PhysRevE.104.024303">Symbiotic and Antagonistic Disease Dynamics on Clustered Networks Using Bond Percolation</a></i>. Physical Review E <b>104</b>.&nbsp;2021.
</p>

<p>
<a id="orgf11557e"></a>Peter Mann, V. Anne Smith, John Mitchell, and Simon Dobson.  <i><a href="https://doi.org/10.1103/PhysRevE.103.012313">Percolation in Random Graphs with Higher-Order Clustering</a></i>. Physical Review E <b>103</b>.&nbsp;2021.
</p>

<p>
<a id="orgc091444"></a>Peter Mann, V. Anne Smith, John Mitchell, Christopher Jefferson, and Simon Dobson.  <i><a href="https:/doi.org/10.1103/PhysRevE.104.024304">Exact Formula for Bond Percolation on Cliques</a></i>. Physical Review E <b>104</b>.&nbsp;2021.
</p>

<p>
<a id="orge952f92"></a>Andrea Rosales Sanabria, Franco Zambonelli, Simon Dobson, and Juan Ye.  <i><a href="https://doi.org/10.1016/j.pmcj.2021.101477">ContrasGAN: Unsupervised Domain Adaptation in Human Activity Recognition via Adversarial and Contrastive Learning</a></i>. Pervasive and Mobile Computing <b>78</b>.&nbsp;2021.
</p>

<p>
<a id="org54ed47f"></a>Peter Mann, V. Anne Smith, John Mitchell, and Simon Dobson.  <i><a href="https://doi.org/10.1103/PhysRevE.103.062308">Two-Pathogen Model with Competition on Clustered Networks</a></i>. Physical Review E <b>103</b>.&nbsp;2021.
</p>

<p>
<a id="orgb2a454f"></a>Peter Mann, V. Anne Smith, John Mitchell, and Simon Dobson.  <i><a href="https://doi.org/10.1103/PhysRevE.103.042307">Co-Operative Co-Infection Dynamics on Clustered Networks</a></i>. Physical Review E <b>103</b>.&nbsp;2021.
</p>

<p>
<a id="orgb2500fb"></a>Peter Mann, V. Anne Smith, John Mitchell, and Simon Dobson.  <i><a href="https://doi.org/10.1103/PhysRevE.103.012309">Random Graphs with Arbitrary Clustering and Their Applications</a></i>. Physical Review E <b>103</b>.&nbsp;2021.
</p>

<p>
<a id="orgd7ba032"></a>Juan Ye and Simon Dobson.  <i><a href="https://dx.doi.org//10.1145/3368272">Xlearn: Learning Activity Labels across Heterogeneous Datasets</a></i>. <span class="caps">IEEE</span> Transactions on Intelligent Systems and Technology <b>11</b>, pp.1–28.&nbsp;2020.
</p>

<p>
<a id="org3599350"></a>Michael Pitcher, Ruth Bowness, Simon Dobson, Raluca Eftimie, and Stephen Gillespie.  <i><a href="https://dx.doi.org//10.1101/2019.12.12.871269%20">Modelling the Effects of Environmental Heterogeneity within the Lung on the Tuberculosis Lifecycle</a></i>. Journal of Theoretical Biology <b>506</b>.&nbsp;2020.
</p>

<p>
<a id="org6c0036f"></a>Michael Pitcher, Simon Dobson, Tom Kelsey, Mark Chaplain, Derek Sloan, Stephen Gillespie, and Ruth Bowness.  <i><a href="https://doi.org/10.5588/ijtld.20.0107">How Mechanistic in Silico Modelling Can Improve Our Understanding of <span class="caps">TB</span> Disease and Treatment</a></i>. International Journal of Tuberculosis and Lung Disease <b>24</b>.&nbsp;2020.
</p>

<p>
<a id="orga910af0"></a>Antonio Bucchiarone, Mirko D’Angelo, Danilo Pianini, Giacomo Cabri, Marina De Sanctis, Mirko Viroli, Roberto Casadei, and Simon Dobson.  <i><a href="http://dx.doi.org/10.1109/MTS.2020.3012324">On the Social Implications of Collective Adaptive Systems</a></i>. <span class="caps">IEEE</span> Technology and Society Magazine <b>39</b>, pp.36–46.&nbsp;2020.
</p>

<p>
<a id="orgf764705"></a>Lei Fang, Juan Ye, and Simon Dobson.  <i><a href="https://dx.doi.org//10.1109/TKDE.2019.2905207">Discovery and Recognition of Emerging Human Activities Using a Hierarchical Mixture of Directional Statistical Models</a></i>. <span class="caps">IEEE</span> Transactions on Knowledge and Data Engineering <b>32</b>, pp.1304–1316.&nbsp;2020.
</p>

<p>
<a id="org7d05d12"></a>Andrea Rosales Sanabria, Thomas Kelsey, Simon Dobson, and Juan Ye.  <i><a href="https://dx.doi.org//10.3233/AIS-190541">Representation Learning for Minority and Subtle Activities in a Smart Home Environment</a></i>. Journal of Ambient Intelligence and Smart Environments <b>11</b>, pp.495–513.&nbsp;2019.
</p>

<p>
<a id="orgadfa105"></a>Juan Ye, Simon Dobson, and Franco Zambonelli.  <i><a href="https://dx.doi.org//10.1109/MPRV.2019.2913933">Lifelong Learning in Sensor-Based Human Activity Recognition</a></i>. <span class="caps">IEEE</span> Pervasive Computing <b>18</b>.&nbsp;2019.
</p>

<p>
<a id="orgf6ce4ed"></a>Simon Dobson, David Hutchison, Andreas Mauthe, Alberto Schaefer-Filho, Paul Smith, and James <span class="caps">PG</span> Sterbenz.  <i><a href="https://dx.doi.org//10.1109/JPROC.2019.2894512">Self-Organisation and Resilience for Networked Systems: Design Principles and Open Research Issues</a></i>. Proceedings of the <span class="caps">IEEE</span> <b>107</b>, pp.819–834.&nbsp;2019.
</p>

<p>
<a id="org2f6410a"></a>Michael Pitcher, Ruth Bowness, Simon Dobson, and Stephen Gillespie.  <i><a href="https://dx.doi.org//10.1007/s41109-018-0091-2">A Spatially Heterogeneous Network-Based Metapopulation Model Applied to the Simulation of a Pulmonary Tuberculosis Infection</a></i>. Applied Network Science <b>3</b>.&nbsp;2018.
</p>

<p>
<a id="org7bf0f37"></a>Simon Dobson, Matteo Golfarelli, Simone Graziani, and Stefano Rizzi.  <i><a href="https://dx.doi.org//10.1109/JSEN.2018.2861327">A Reference Architecture and Model for Sensor Data Warehousing</a></i>. <span class="caps">IEEE</span> Sensors Journal <b>18</b>.&nbsp;2018.
</p>

<p>
<a id="orgbcabb74"></a>Muffy Calder, Simon Dobson, Michael Fisher, and Julie McCann.  <i><a href="https://dx.doi.org//10.3390/computers7040062">Making Sense of the World: Framing Models for Trustworthy Sensor-Driven Systems</a></i>. Computers <b>7</b>. 2018. Special issue on the ’The Emergence of the internet of things: connecting anything,&nbsp;anywhere?’.
</p>

<p>
<a id="org4c12f99"></a>Simon Dobson, Mirko Viroli, José Luis Fernandez-Marquez, Franco Zambonelli, Graeme Stevenson, Giovanna di Marzo Serugendo, Sara Montagna, Danilo Pianini, Juan Ye, Gabriella Castelli, and Alberto Rosi.  <i><a href="https://dx.doi.org//10.1017/S0269888916000199">Spatial Awareness in Pervasive Ecosystems</a></i>. The Knowledge Engineering Review <b>31</b>, pp.343–366.&nbsp;2016.
</p>

<p>
<a id="org9ae08aa"></a>Juan Ye, Graeme Stevenson, and Simon Dobson.  <i><a href="https://dx.doi.org//10.1016/j.pmcj.2016.06.012">Detecting Abnormal Events on Binary Sensors in Smart Home Environments</a></i>. Pervasive and Mobile Computing <b>33</b>, pp.32–49.&nbsp;2016.
</p>

<p>
<a id="orge1d026a"></a>Juan Ye, Graeme Stevenson, and Simon Dobson.  <i><a href="https://dx.doi.org//10.1016/j.pmcj.2014.02.003"><span class="caps">KCAR</span>: A Knowledge-Driven Approach for Concurrent Activity Recognition</a></i>. Pervasive and Mobile Computing <b>19</b>, pp.47–70. May&nbsp;2015.
</p>

<p>
<a id="org6c2fd3b"></a>Chris Schneider, Adam Barker, and Simon Dobson.  <i><a href="https://dx.doi.org//10.4108/sas.1.1.e3">Evaluating Unsupervised Fault Detection in Self-Healing Systems Using Stochastic Primitives</a></i>. <span class="caps">EAI</span> Endorsed Transactions on Self-Adaptive Systems <b>15</b>.&nbsp;2015.
</p>

<p>
<a id="org21b6ed0"></a>Franco Zambonelli, Andrea Omicini, Bernhard Anzengruber, Gabriella Castelli, Francesco DeAngelis, Giovanna di Marzo Serugendo, Simon Dobson, José-Luis Fernandez Marquez, Alois Ferscha, Marco Mamei, Stefano Mariani, Ambra Molesini, Sara Montagna, Jussi Nieminen, Danilo Pianini, Alberto Rosi, Graeme Stevenson, Mirko Viroli, and Juan Ye.  <i><a href="https://dx.doi.org//10.1016/j.pmcj.2014.12.002">Developing Pervasive Multiagent Systems with Nature-Inspired Co-Ordination</a></i>. Pervasive and Mobile Computing <b>17</b>, pp.236–252.&nbsp;2015.
</p>

<p>
<a id="org9de92bf"></a>Juan Ye, Stamatia Dasiopoulou, Graeme Stevenson, Georgios Meditskos, Efstratios Kontopoulos, Ioannis Kompatsiaris, and Simon Dobson.  <i><a href="https://dx.doi.org//10.1016/j.pmcj.2014.12.009">Semantic Web Technologies in Pervasive Computing: A Survey and Research Roadmap</a></i>. Pervasive and Mobile Computing <b>23</b>, pp.1–25.&nbsp;2015.
</p>

<p>
<a id="orgbea6c58"></a>Emanuele Strano, Saray Shai, Simon Dobson, and Marc Barthélemy.  <i><a href="https://dx.doi.org//10.1098/rsif.2015.0651">Multiplex Networks in Metropolitan Areas: Generic Features and Local Effects</a></i>. Journal of the Royal Society Interface <b>12</b>.&nbsp;2015.
</p>

<p>
<a id="orgddba361"></a>Saray Shai, Dror Kenett, Yoed Kenett, Miriam Faust, Simon Dobson, and Shlomo Havlin.  <i><a href="https://dx.doi.org//10.1103/PhysRevE.92.062805">Critical Tipping Point Distinguishing Two Types of Transitions in Modular Network Structures</a></i>. Physical Review E <b>92</b>.&nbsp;2015.
</p>

<p>
<a id="org976b3a2"></a>Juan Ye, Graeme Stevenson, and Simon Dobson.  <i><a href="https://dx.doi.org///10.1145/2662870"><span class="caps">USMART</span>: An Unsupervised Semantic Mining Activity Recognition Technique</a></i>. <span class="caps">ACM</span> Transactions on Intelligent Interaction Systems <b>4</b>.&nbsp;2014.
</p>

<p>
<a id="orgf3f17f4"></a>Abu Raihan M. Kamal, Chris Bleakley, and Simon Dobson.  <i><a href="https://dx.doi.org//10.1145/2530526">Failure Detection in Wireless Sensor Networks: A Sequence Based Dynamic Approach</a></i>. <span class="caps">ACM</span> Transactions on Sensor Networks <b>10</b>.&nbsp;2014.
</p>

<p>
<a id="org147b661"></a>Chris Schneider, Adam Barker, and Simon Dobson.  <i><a href="https://dx.doi.org//10.1002/spe.2250">A Survey of Self-Healing Systems Frameworks</a></i>. <span class="caps">SOFTWARE</span>: Practice and Experience.&nbsp;2014.
</p>

<p>
<a id="orga616f2d"></a>Savas Konur, Michael Fisher, Simon Dobson, and Stephen Knox.  <i><a href="https://dx.doi.org//10.1007/s00165-013-0277-4">Formal Verification of a Pervasive Messaging System</a></i>. Formal Aspects of Computing <b>26</b>, pp.677–694.&nbsp;2014.
</p>

<p>
<a id="org33c84c8"></a><span class="caps">M.A.</span> Razzaque and Simon Dobson.  <i><a href="https://dx.doi.org//10.3390/s140202822">Energy Efficient Sensing in Wireless Sensor Networks Using Compressed Sensing</a></i>. Sensors <b>14</b>, pp.2822–2859.&nbsp;2014.
</p>

<p>
<a id="orge0edf7c"></a>Abu Raihan M. Kamal, Chris Bleakley, and Simon Dobson.  <i><a href="https://dx.doi.org//10.1145/2422966.2422976">Packet-Level Attestation (<span class="caps">PLA</span>): a Framework for in-Network Sensor-Data Reliability</a></i>. <span class="caps">ACM</span> Transactions on Sensor Networks <b>9</b>.&nbsp;2013.
</p>

<p>
<a id="orga74b6dc"></a>Saray Shai and Simon Dobson.  <i><a href="https://dx.doi.org//10.1103/PhysRevE.87.042812">Coupled Adaptive Complex Networks</a></i>. Physical Review E <b>87</b>.&nbsp;2013.
</p>

<p>
<a id="orga4b9ae6"></a><span class="caps">M.A.</span> Razzaque, Chris Bleakley, and Simon Dobson.  <i><a href="https://dx.doi.org//10.1145/2528948">Compression in Wireless Sensor Networks: A Survey and Comparative Evaluation</a></i>. <span class="caps">ACM</span> Transactions on Sensor Networks <b>10</b>.&nbsp;2013.
</p>

<p>
<a id="org016418d"></a><span class="caps">MA</span> Razzaque, Simon Dobson, and Kieran Delaney.  <i><a href="https://dx.doi.org//10.1504/IJCNDS.2013.057721">Augmented Materials: Spatially Embedded Sensor Networks</a></i>. International Journal of Networks and Distributed Systems <b>11</b>, pp.453–477.&nbsp;2013.
</p>

<p>
<a id="org5a4d19c"></a>Juan Ye, Simon Dobson, and Susan McKeever.  <i><a href="https://dx.doi.org//10.1016/j.pmcj.2011.01.004">Situation Identification Techniques in Pervasive Computing: A Review</a></i>. Pervasive and Mobile Computing <b>8</b>, pp.36–66.&nbsp;2012.
</p>

<p>
<a id="org297ceff"></a>Saray Shai and Simon Dobson.  <i><a href="https://dx.doi.org//10.1103/PhysRevE.86.066120">Effect of Resource Constraints on Intersimilar Coupled Networks</a></i>. Physical Review E <b>86</b>.&nbsp;2012.
</p>

<p>
<a id="orgad9471e"></a>Mohamed Saad, Chris Bleakley, Tarig Ballal, and Simon Dobson.  <i><a href="https://dx.doi.org//10.1109/TIM.2011.2181911">High-Accuracy Reference-Free Ultrasonic Location Estimation</a></i>. <span class="caps">IEEE</span> Transactions on Instrumentation and Measurement <b>61</b>, pp.1561–1570.&nbsp;2012.
</p>

<p>
<a id="org5af2d75"></a>Juan Ye, Graeme Stevenson, Simon Dobson, Michael O’Grady, and Gregory O’Hare.  <i><a href="https://dx.doi.org//10.1007/s12652-012-0148-5">Perceiving and Interpreting Smart Home Datasets with \(<span class="caps">PI</span>\)</a></i>. Journal of Ambient Intelligence and Humanized Computing <b>4</b>, pp.717–729.&nbsp;2012.
</p>

<p>
<a id="org4ba0136"></a>Klaas Thoelen, Danny Hughes, Nelson Matthys, Lei Fang, Simon Dobson, Yizhou Qiang, Wei Bai, Ka Lok Man, Sheng-Uei Guan, Davy Preuveneers, Sam Michiels, Christophe Huygens, and Wouter Joosen.  <i><a href="https://dx.doi.org//10.1007/s13174-012-0064-0">A Reconfigurable Component Model with Semantic Type System for Dynamic <span class="caps">WSN</span> Applications</a></i>. Journal of Internet Services and Applications <b>3</b>, pp.277–290.&nbsp;2012.
</p>

<p>
<a id="org1e3e14e"></a>Alan Dearle and Simon Dobson.  <i><a href="https://dx.doi.org//10.1007/s13174-011-0052-9">Mission-Oriented Middleware for Sensor-Driven Scientific Systems</a></i>. Journal of Internet Services and Applications <b>3</b>, pp.133–139.&nbsp;2012.
</p>

<p>
<a id="orgcbef5d2"></a>Emerson Loureiro, Paddy Nixon, and Simon Dobson.  <i><a href="https://dx.doi.org//10.1145/2168260.2168274">Decentralized and Optimal Control of Shared Resource Pools</a></i>. <span class="caps">ACM</span> Transactions on Autonomous and Adaptive Systems <b>7</b>.&nbsp;2012.
</p>

<p>
<a id="org8f305fd"></a>Mohamed Saad, Chris Bleakley, and Simon Dobson.  <i><a href="https://dx.doi.org//10.1109/TIM.2011.2128950">Robust High Accuracy Ultrasonic Range Measurement System</a></i>. <span class="caps">IEEE</span> Transactions on Instrumentation and Measurement <b>60</b>, pp.3334–3341.&nbsp;2011.
</p>

<p>
<a id="org4f62af4"></a>Juan Ye, Graeme Stevenson, and Simon Dobson.  <i><a href="https://dx.doi.org//10.1016/j.pmcj.2011.02.002">A Top-Level Ontology for Smart Environments</a></i>. Pervasive and Mobile Computing <b>7</b>, pp.359–378.&nbsp;2011.
</p>

<p>
<a id="org952d28c"></a>Franco Zambonelli, Gabrialla Castelli, Laura Ferrari, Marco Mamei, Alberto Rosi, Giovanna di Marzo Serugendo, Matteo Risoldi, Akla-Esso Tchao, Simon Dobson, Graeme Stevenson, Juan Ye, Elena Nardini, Andrea Omicini, Sara Montagna, Mirko Viroli, Alois Ferscha, Sascha Maschek, and Bernhard Wally.  <i><a href="https://dx.doi.org//10.1016/j.procs.2011.09.006">Self-Aware Pervasive Service Ecosystems</a></i>. Procedia Computer Science <b>7</b>, pp.197–199.&nbsp;2011.
</p>

<p>
<a id="orgbc05f39"></a>Juan Ye and Simon Dobson.  <i><a href="https://dx.doi.org//10.3233/AIS-2009-0082">Exploring Semantics in Activity Recognition Using Context Lattices</a></i>. Journal of Ambient Intelligence and Smart Environments <b>2</b>, pp.389–407.&nbsp;2010.
</p>

<p>
<a id="org12bf4d9"></a>Adrian K. Clear, Thomas Holland, Simon Dobson, Aaron Quigley, Ross Shannon, and Paddy Nixon.  <i><a href="https://dx.doi.org//10.1016/j.pmcj.2010.04.002">Situvis: A Sensor Data Analysis and Abstraction Tool for Pervasive Computing Systems</a></i>. Pervasive and Mobile Computing <b>6</b>, pp.575–589.&nbsp;2010.
</p>

<p>
<a id="org7e8db03"></a>Graeme Stevenson, Juan Ye, Simon Dobson, and Paddy Nixon.  <i><a href="https://dx.doi.org//10.1109/MPRV.2009.90"><span class="caps">LOC8</span>: A Location Model and Extensible Framework for Programming with Location</a></i>. <span class="caps">IEEE</span> Pervasive Computing <b>9</b>, pp.28–37.&nbsp;2010.
</p>

<p>
<a id="org3be1d2e"></a>Simon Dobson, Roy Sterritt, Paddy Nixon, and Mike Hinchey.  <i><a href="https://dx.doi.org///10.1109/MC.2010.14">Fulfilling the Vision of Autonomic Computing</a></i>. <span class="caps">IEEE</span> Computer <b>43</b>, pp.35–41.&nbsp;2010.
</p>

<p>
<a id="orged4a6ba"></a>Susan McKeever, Juan Ye, Lorcan Coyle, Chris Bleakley, and Simon Dobson.  <i><a href="https://dx.doi.org//10.3233/AIS-2010-0071">Activity Recognition Using Temporal Evidence Theory</a></i>. Journal of Ambient Intelligence and Smart Environments <b>2</b>, pp.253–269.&nbsp;2010.
</p>

<p>
<a id="orgb49e05e"></a>Michael Collins, Simon Dobson, and Paddy Nixon.  <i><a href="https://simondobson.org/softcopy/aslan-09.pdf">Securing Wireless Sensor Networks: Introducing <span class="caps">ASLAN</span> – a Secure, Lightweight Architecture for WSNs</a></i>. International Journal on Advances in Networks and Services <b>2</b>, pp.679–685. May&nbsp;2009.
</p>

<p>
<a id="orgcc9a837"></a>Michael Collins, Simon Dobson, and Paddy Nixon.  <i><a href="https://simondobson.org/softcopy/ijitst-08.pdf">A Lightweight Secure Architecture for Wireless Sensor Networks</a></i>. International Journal of Internet Technology and Secured Transactions <b>2</b>.&nbsp;2009.
</p>

<p>
<a id="org2c49a4b"></a>John Strassner, Sven van der Meer, Declan O’Sullivan, and Simon Dobson.  <i><a href="https://dx.doi.org//10.1007/s10922-009-9126-4">The Use of Context-Aware Policies and Ontologies to Facilitate Business-Aware Network Management</a></i>. Journal of Network and Systems Management <b>17</b>, pp.255–284.&nbsp;2009.
</p>

<p>
<a id="orgefa86ce"></a>Brendan Sheehan, Aaron Quigley, Benoit Gaudin, and Simon Dobson.  <i><a href="http://www.biomedcentral.com/1471-2105/9/468/abstract">A Relation Based Measure of Semantic Similarity for Gene Ontology Annotations</a></i>. <span class="caps">BMC</span> Bioinformatics Journal <b>9</b>.&nbsp;2008.
</p>

<p>
<a id="org0ddb1b3"></a>Stephen Knox, Adrian K. Clear, Ross Shannon, Lorcan Coyle, Simon Dobson, Aaron Quigley, and Paddy Nixon.  <i>Scatterbox: Mobile Message Management</i>. Revue d’Intelligence Artificielle <b>22</b>, pp.549–568.&nbsp;2008.
</p>

<p>
<a id="org330d566"></a>Juan Ye, Lorcan Coyle, Simon Dobson, and Paddy Nixon.  <i><a href="https://simondobson.org/softcopy/ria-08a.pdf">Representing and Manipulating Situation Hierarchies Using Situation Lattices</a></i>. Revue d’Intelligence Artificielle <b>22</b>, pp.647–667.&nbsp;2008.
</p>

<p>
<a id="org26ae63b"></a>Simon Dobson.  <i>An Adaptive Systems Perspective on Network Calculus, with Applications to Autonomic Control</i>. International Journal of Autonomous and Adaptive Communications Systems <b>1</b>, pp.332–341.&nbsp;2008.
</p>

<p>
<a id="orgca26273"></a>Juan Ye, Lorcan Coyle, Simon Dobson, and Paddy Nixon.  <i><a href="https://dx.doi.org//10.1017/S0269888907001208">Ontology-Based Models in Pervasive Computing Systems</a></i>. The Knowledge Engineering Review <b>22</b>, pp.315–347.&nbsp;2007.
</p>

<p>
<a id="org1fe19e5"></a>Simon Dobson, Lorcan Coyle, and Paddy Nixon.  <i><a href="https://simondobson.org/softcopy/tcaas-hybrid-06.pdf">Hybridising Events and Knowledge as a Basis for Building Autonomic Systems</a></i>. <span class="caps">IEEE</span> <span class="caps">TCAAS</span> Letters.&nbsp;2007.
</p>

<p>
<a id="org05c8ed2"></a><span class="caps">M.A.</span> Razzaque, Simon Dobson, and Paddy Nixon.  <i><a href="https://simondobson.org/softcopy/jnsm-crosslayer-07.pdf">Cross-Layer Architectures for Autonomic Communications</a></i>. Journal of Network and Systems Management <b>15</b>, pp.13–27.&nbsp;2007.
</p>

<p>
<a id="orgbe957bf"></a><span class="caps">M.A.</span> Razzaque, Simon Dobson, and Paddy Nixon.  <i><a href="https://simondobson.org/softcopy/tcaas-qoc-06.pdf">Classification and Modeling of the Quality of Contextual Information</a></i>. <span class="caps">IEEE</span> <span class="caps">TCAAS</span> Letters.&nbsp;2007.
</p>

<p>
<a id="org3f71093"></a>Lorcan Coyle, Steve Neely, Graeme Stevenson, Mark Sullivan, Simon Dobson, and Paddy Nixon.  <i><a href="https://simondobson.org/softcopy/smart-homes-ijarm-06.pdf">Sensor Fusion-Based Middleware for Smart Homes</a></i>. International Journal of Assistive Robotics and Mechatronics <b>8</b>, pp.53–60.&nbsp;2007.
</p>

<p>
<a id="org446f097"></a>Steve Neely, Simon Dobson, and Paddy Nixon.  <i><a href="https://simondobson.org/softcopy/aot-survey-06.pdf">Adaptive Middleware for Autonomic Systems</a></i>. Annals of Telecommunications <b>61</b>, pp.1099–1118.&nbsp;2006.
</p>

<p>
<a id="org2461cdd"></a>Simon Dobson, Spyros Denazis, Antonio Fernández, Dominique Gaïti, Erol Gelenbe, Fabio Massacci, Paddy Nixon, Fabrice Saffre, Nikita Schmidt, and Franco Zambonelli.  <i><a href="https://dx.doi.org//10.1145/1186778.1186782">A Survey of Autonomic Communications</a></i>. <span class="caps">ACM</span> Transactions on Autonomous and Adaptive Systems <b>1</b>, pp.223–259.&nbsp;2006.
</p>

<p>
<a id="org959c5e6"></a>Joëlle Coutaz, James Crowley, Simon Dobson, and David Garlan.  <i><a href="https://dx.doi.org//10.1145/1047671.1047703">Context Is Key</a></i>. Communications of the <span class="caps">ACM</span> <b>48</b>, pp.49–53.&nbsp;2005.
</p>

<p>
<a id="orgb2c8b34"></a>Don Goodeve, Simon Dobson, Jonathan Nash, John Davy, Peter Dew, Mourad Kara, and Chris Wadsworth.  <i><a href="https://simondobson.org/softcopy/JPDC-98.pdf">Towards a Model for Shared Data Abstraction with Performance</a></i>. Journal of Parallel and Distributed Computing <b>49</b>, pp.156–167.&nbsp;1998.
</p>

<p>
<a id="org70b23ee"></a>Simon Dobson and Victoria Burrill.  <i><a href="https://dx.doi.org//10.1016/0169-7552(95)00012-V">Lightweight Databases</a></i>. Computer Networks and <span class="caps">ISDN</span> Systems <b>27</b>, pp.1009–1015.&nbsp;1995.
</p>
</div>
</div>
