pages/research/publications.tex

\subsection{Journals}
\label{sec:org4e17577}

\label{org7450fad}Martin Schiemer, Lei Fang, Simon Dobson, and Juan Ye.  \emph{\href{https://doi.org/10.1016/j.pmcj.2023.101817}{Online Continual Learning for Human Activity Recognition}}. Pervasive and Mobile Computing \textbf{93}. 2023.

\label{orgae9f508}Peter Mann and Simon Dobson.  \emph{\href{https://doi.org/10.1103/PhysRevE.107.054303}{Belief Propagation on Networks with Cliques and Chordless Cycles}}. Physical Review E \textbf{107}. 2023.

\label{org24964b3}Simon Dobson.  \emph{\href{https://doi.org/10.21105/joss.03764}{epyc: Computational Experiment Management in Python}}. Journal of Open-Source Software \textbf{7}. 2022.

\label{org0cfde9d}Peter Mann, V. Anne Smith, John Mitchell, and Simon Dobson.  \emph{\href{https://doi.org/10.1103/PhysRevE.106.014304}{N-Strain Epidemic Model Using Bond Percolation}}. Physical Review E \textbf{106}. 2022.

\label{orgfad3d82}Peter Mann, V. Anne Smith, John Mitchell, and Simon Dobson.  \emph{\href{https://doi.org/10.1103/PhysRevE.105.044314}{Degree Correlations in Graphs with Clique Clustering}}. Physical Review E \textbf{105}. 2022.

\label{orge47ea72}Peter Mann, V. Anne Smith, John Mitchell, and Simon Dobson.  \emph{\href{https://doi.org/10.1103/PhysRevE.104.024303}{Symbiotic and Antagonistic Disease Dynamics on Clustered Networks Using Bond Percolation}}. Physical Review E \textbf{104}. 2021.

\label{orgd441ae0}Peter Mann, V. Anne Smith, John Mitchell, and Simon Dobson.  \emph{\href{https://doi.org/10.1103/PhysRevE.103.012313}{Percolation in Random Graphs with Higher-Order Clustering}}. Physical Review E \textbf{103}. 2021.

\label{org3e619b6}Peter Mann, V. Anne Smith, John Mitchell, Christopher Jefferson, and Simon Dobson.  \emph{\href{https:/doi.org/10.1103/PhysRevE.104.024304}{Exact Formula for Bond Percolation on Cliques}}. Physical Review E \textbf{104}. 2021.

\label{org1d29cea}Andrea Rosales Sanabria, Franco Zambonelli, Simon Dobson, and Juan Ye.  \emph{\href{https://doi.org/10.1016/j.pmcj.2021.101477}{ContrasGAN: Unsupervised Domain Adaptation in Human Activity Recognition via Adversarial and Contrastive Learning}}. Pervasive and Mobile Computing \textbf{78}. 2021.

\label{orgbd4e008}Peter Mann, V. Anne Smith, John Mitchell, and Simon Dobson.  \emph{\href{https://doi.org/10.1103/PhysRevE.103.062308}{Two-Pathogen Model with Competition on Clustered Networks}}. Physical Review E \textbf{103}. 2021.

\label{orgb9a4e28}Peter Mann, V. Anne Smith, John Mitchell, and Simon Dobson.  \emph{\href{https://doi.org/10.1103/PhysRevE.103.042307}{Co-Operative Co-Infection Dynamics on Clustered Networks}}. Physical Review E \textbf{103}. 2021.

\label{orgc4dee49}Peter Mann, V. Anne Smith, John Mitchell, and Simon Dobson.  \emph{\href{https://doi.org/10.1103/PhysRevE.103.012309}{Random Graphs with Arbitrary Clustering and Their Applications}}. Physical Review E \textbf{103}. 2021.

\label{orgdeff7bf}Juan Ye and Simon Dobson.  \emph{\href{https://dx.doi.org//10.1145/3368272}{Xlearn: Learning Activity Labels across Heterogeneous Datasets}}. IEEE Transactions on Intelligent Systems and Technology \textbf{11}, pp.1–28. 2020.

\label{org9be135d}Michael Pitcher, Ruth Bowness, Simon Dobson, Raluca Eftimie, and Stephen Gillespie.  \emph{\href{https://dx.doi.org//10.1101/2019.12.12.871269 }{Modelling the Effects of Environmental Heterogeneity within the Lung on the Tuberculosis Lifecycle}}. Journal of Theoretical Biology \textbf{506}. 2020.

\label{org93f7af5}Michael Pitcher, Simon Dobson, Tom Kelsey, Mark Chaplain, Derek Sloan, Stephen Gillespie, and Ruth Bowness.  \emph{\href{https://doi.org/10.5588/ijtld.20.0107}{How Mechanistic in Silico Modelling Can Improve Our Understanding of TB Disease and Treatment}}. International Journal of Tuberculosis and Lung Disease \textbf{24}. 2020.

\label{orgf020ba4}Antonio Bucchiarone, Mirko D’Angelo, Danilo Pianini, Giacomo Cabri, Marina De Sanctis, Mirko Viroli, Roberto Casadei, and Simon Dobson.  \emph{\href{http://dx.doi.org/10.1109/MTS.2020.3012324}{On the Social Implications of Collective Adaptive Systems}}. IEEE Technology and Society Magazine \textbf{39}, pp.36–46. 2020.

\label{org178419f}Lei Fang, Juan Ye, and Simon Dobson.  \emph{\href{https://dx.doi.org//10.1109/TKDE.2019.2905207}{Discovery and Recognition of Emerging Human Activities Using a Hierarchical Mixture of Directional Statistical Models}}. IEEE Transactions on Knowledge and Data Engineering \textbf{32}, pp.1304–1316. 2020.

\label{org131d2f5}Andrea Rosales Sanabria, Thomas Kelsey, Simon Dobson, and Juan Ye.  \emph{\href{https://dx.doi.org//10.3233/AIS-190541}{Representation Learning for Minority and Subtle Activities in a Smart Home Environment}}. Journal of Ambient Intelligence and Smart Environments \textbf{11}, pp.495–513. 2019.

\label{orgec5af8f}Juan Ye, Simon Dobson, and Franco Zambonelli.  \emph{\href{https://dx.doi.org//10.1109/MPRV.2019.2913933}{Lifelong Learning in Sensor-Based Human Activity Recognition}}. IEEE Pervasive Computing \textbf{18}. 2019.

\label{org0cd3999}Simon Dobson, David Hutchison, Andreas Mauthe, Alberto Schaefer-Filho, Paul Smith, and James PG Sterbenz.  \emph{\href{https://dx.doi.org//10.1109/JPROC.2019.2894512}{Self-Organisation and Resilience for Networked Systems: Design Principles and Open Research Issues}}. Proceedings of the IEEE \textbf{107}, pp.819–834. 2019.

\label{org70adcef}Michael Pitcher, Ruth Bowness, Simon Dobson, and Stephen Gillespie.  \emph{\href{https://dx.doi.org//10.1007/s41109-018-0091-2}{A Spatially Heterogeneous Network-Based Metapopulation Model Applied to the Simulation of a Pulmonary Tuberculosis Infection}}. Applied Network Science \textbf{3}. 2018.

\label{orgd641fc9}Simon Dobson, Matteo Golfarelli, Simone Graziani, and Stefano Rizzi.  \emph{\href{https://dx.doi.org//10.1109/JSEN.2018.2861327}{A Reference Architecture and Model for Sensor Data Warehousing}}. IEEE Sensors Journal \textbf{18}. 2018.

\label{orge929091}Muffy Calder, Simon Dobson, Michael Fisher, and Julie McCann.  \emph{\href{https://dx.doi.org//10.3390/computers7040062}{Making Sense of the World: Framing Models for Trustworthy Sensor-Driven Systems}}. Computers \textbf{7}. 2018. Special issue on the ’The Emergence of the internet of things: connecting anything, anywhere?’.

\label{org598f9a7}Simon Dobson, Mirko Viroli, José Luis Fernandez-Marquez, Franco Zambonelli, Graeme Stevenson, Giovanna di Marzo Serugendo, Sara Montagna, Danilo Pianini, Juan Ye, Gabriella Castelli, and Alberto Rosi.  \emph{\href{https://dx.doi.org//10.1017/S0269888916000199}{Spatial Awareness in Pervasive Ecosystems}}. The Knowledge Engineering Review \textbf{31}, pp.343–366. 2016.

\label{org8dfdb3e}Juan Ye, Graeme Stevenson, and Simon Dobson.  \emph{\href{https://dx.doi.org//10.1016/j.pmcj.2016.06.012}{Detecting Abnormal Events on Binary Sensors in Smart Home Environments}}. Pervasive and Mobile Computing \textbf{33}, pp.32–49. 2016.

\label{org3b47051}Juan Ye, Graeme Stevenson, and Simon Dobson.  \emph{\href{https://dx.doi.org//10.1016/j.pmcj.2014.02.003}{KCAR: A Knowledge-Driven Approach for Concurrent Activity Recognition}}. Pervasive and Mobile Computing \textbf{19}, pp.47–70. May 2015.

\label{org433a925}Chris Schneider, Adam Barker, and Simon Dobson.  \emph{\href{https://dx.doi.org//10.4108/sas.1.1.e3}{Evaluating Unsupervised Fault Detection in Self-Healing Systems Using Stochastic Primitives}}. EAI Endorsed Transactions on Self-Adaptive Systems \textbf{15}. 2015.

\label{orgf87caf0}Franco Zambonelli, Andrea Omicini, Bernhard Anzengruber, Gabriella Castelli, Francesco DeAngelis, Giovanna di Marzo Serugendo, Simon Dobson, José-Luis Fernandez Marquez, Alois Ferscha, Marco Mamei, Stefano Mariani, Ambra Molesini, Sara Montagna, Jussi Nieminen, Danilo Pianini, Alberto Rosi, Graeme Stevenson, Mirko Viroli, and Juan Ye.  \emph{\href{https://dx.doi.org//10.1016/j.pmcj.2014.12.002}{Developing Pervasive Multiagent Systems with Nature-Inspired Co-Ordination}}. Pervasive and Mobile Computing \textbf{17}, pp.236–252. 2015.

\label{org7ce2ae7}Juan Ye, Stamatia Dasiopoulou, Graeme Stevenson, Georgios Meditskos, Efstratios Kontopoulos, Ioannis Kompatsiaris, and Simon Dobson.  \emph{\href{https://dx.doi.org//10.1016/j.pmcj.2014.12.009}{Semantic Web Technologies in Pervasive Computing: A Survey and Research Roadmap}}. Pervasive and Mobile Computing \textbf{23}, pp.1–25. 2015.

\label{orgff11459}Emanuele Strano, Saray Shai, Simon Dobson, and Marc Barthélemy.  \emph{\href{https://dx.doi.org//10.1098/rsif.2015.0651}{Multiplex Networks in Metropolitan Areas: Generic Features and Local Effects}}. Journal of the Royal Society Interface \textbf{12}. 2015.

\label{org406103e}Saray Shai, Dror Kenett, Yoed Kenett, Miriam Faust, Simon Dobson, and Shlomo Havlin.  \emph{\href{https://dx.doi.org//10.1103/PhysRevE.92.062805}{Critical Tipping Point Distinguishing Two Types of Transitions in Modular Network Structures}}. Physical Review E \textbf{92}. 2015.

\label{org34a709d}Juan Ye, Graeme Stevenson, and Simon Dobson.  \emph{\href{https://dx.doi.org///10.1145/2662870}{USMART: An Unsupervised Semantic Mining Activity Recognition Technique}}. ACM Transactions on Intelligent Interaction Systems \textbf{4}. 2014.

\label{orga5c481a}Abu Raihan M. Kamal, Chris Bleakley, and Simon Dobson.  \emph{\href{https://dx.doi.org//10.1145/2530526}{Failure Detection in Wireless Sensor Networks: A Sequence Based Dynamic Approach}}. ACM Transactions on Sensor Networks \textbf{10}. 2014.

\label{org1966fb3}Chris Schneider, Adam Barker, and Simon Dobson.  \emph{\href{https://dx.doi.org//10.1002/spe.2250}{A Survey of Self-Healing Systems Frameworks}}. SOFTWARE: Practice and Experience. 2014.

\label{org5290957}Savas Konur, Michael Fisher, Simon Dobson, and Stephen Knox.  \emph{\href{https://dx.doi.org//10.1007/s00165-013-0277-4}{Formal Verification of a Pervasive Messaging System}}. Formal Aspects of Computing \textbf{26}, pp.677–694. 2014.

\label{org7e1948c}M.A. Razzaque and Simon Dobson.  \emph{\href{https://dx.doi.org//10.3390/s140202822}{Energy Efficient Sensing in Wireless Sensor Networks Using Compressed Sensing}}. Sensors \textbf{14}, pp.2822–2859. 2014.

\label{org1e2e6fe}Abu Raihan M. Kamal, Chris Bleakley, and Simon Dobson.  \emph{\href{https://dx.doi.org//10.1145/2422966.2422976}{Packet-Level Attestation (PLA): a Framework for in-Network Sensor-Data Reliability}}. ACM Transactions on Sensor Networks \textbf{9}. 2013.

\label{org5c8d841}Saray Shai and Simon Dobson.  \emph{\href{https://dx.doi.org//10.1103/PhysRevE.87.042812}{Coupled Adaptive Complex Networks}}. Physical Review E \textbf{87}. 2013.

\label{orge996c80}M.A. Razzaque, Chris Bleakley, and Simon Dobson.  \emph{\href{https://dx.doi.org//10.1145/2528948}{Compression in Wireless Sensor Networks: A Survey and Comparative Evaluation}}. ACM Transactions on Sensor Networks \textbf{10}. 2013.

\label{org9fa2f1e}MA Razzaque, Simon Dobson, and Kieran Delaney.  \emph{\href{https://dx.doi.org//10.1504/IJCNDS.2013.057721}{Augmented Materials: Spatially Embedded Sensor Networks}}. International Journal of Networks and Distributed Systems \textbf{11}, pp.453–477. 2013.

\label{org4cfeb31}Juan Ye, Simon Dobson, and Susan McKeever.  \emph{\href{https://dx.doi.org//10.1016/j.pmcj.2011.01.004}{Situation Identification Techniques in Pervasive Computing: A Review}}. Pervasive and Mobile Computing \textbf{8}, pp.36–66. 2012.

\label{org4b994d5}Saray Shai and Simon Dobson.  \emph{\href{https://dx.doi.org//10.1103/PhysRevE.86.066120}{Effect of Resource Constraints on Intersimilar Coupled Networks}}. Physical Review E \textbf{86}. 2012.

\label{orgee9d544}Mohamed Saad, Chris Bleakley, Tarig Ballal, and Simon Dobson.  \emph{\href{https://dx.doi.org//10.1109/TIM.2011.2181911}{High-Accuracy Reference-Free Ultrasonic Location Estimation}}. IEEE Transactions on Instrumentation and Measurement \textbf{61}, pp.1561–1570. 2012.

\label{org84769fa}Juan Ye, Graeme Stevenson, Simon Dobson, Michael O’Grady, and Gregory O’Hare.  \emph{\href{https://dx.doi.org//10.1007/s12652-012-0148-5}{Perceiving and Interpreting Smart Home Datasets with \(PI\)}}. Journal of Ambient Intelligence and Humanized Computing \textbf{4}, pp.717–729. 2012.

\label{org12b3707}Klaas Thoelen, Danny Hughes, Nelson Matthys, Lei Fang, Simon Dobson, Yizhou Qiang, Wei Bai, Ka Lok Man, Sheng-Uei Guan, Davy Preuveneers, Sam Michiels, Christophe Huygens, and Wouter Joosen.  \emph{\href{https://dx.doi.org//10.1007/s13174-012-0064-0}{A Reconfigurable Component Model with Semantic Type System for Dynamic WSN Applications}}. Journal of Internet Services and Applications \textbf{3}, pp.277–290. 2012.

\label{org0aef9bf}Alan Dearle and Simon Dobson.  \emph{\href{https://dx.doi.org//10.1007/s13174-011-0052-9}{Mission-Oriented Middleware for Sensor-Driven Scientific Systems}}. Journal of Internet Services and Applications \textbf{3}, pp.133–139. 2012.

\label{org2a74a88}Emerson Loureiro, Paddy Nixon, and Simon Dobson.  \emph{\href{https://dx.doi.org//10.1145/2168260.2168274}{Decentralized and Optimal Control of Shared Resource Pools}}. ACM Transactions on Autonomous and Adaptive Systems \textbf{7}. 2012.

\label{orgaf15579}Mohamed Saad, Chris Bleakley, and Simon Dobson.  \emph{\href{https://dx.doi.org//10.1109/TIM.2011.2128950}{Robust High Accuracy Ultrasonic Range Measurement System}}. IEEE Transactions on Instrumentation and Measurement \textbf{60}, pp.3334–3341. 2011.

\label{orgf6b99e2}Juan Ye, Graeme Stevenson, and Simon Dobson.  \emph{\href{https://dx.doi.org//10.1016/j.pmcj.2011.02.002}{A Top-Level Ontology for Smart Environments}}. Pervasive and Mobile Computing \textbf{7}, pp.359–378. 2011.

\label{org0f59336}Franco Zambonelli, Gabrialla Castelli, Laura Ferrari, Marco Mamei, Alberto Rosi, Giovanna di Marzo Serugendo, Matteo Risoldi, Akla-Esso Tchao, Simon Dobson, Graeme Stevenson, Juan Ye, Elena Nardini, Andrea Omicini, Sara Montagna, Mirko Viroli, Alois Ferscha, Sascha Maschek, and Bernhard Wally.  \emph{\href{https://dx.doi.org//10.1016/j.procs.2011.09.006}{Self-Aware Pervasive Service Ecosystems}}. Procedia Computer Science \textbf{7}, pp.197–199. 2011.

\label{org85190ad}Juan Ye and Simon Dobson.  \emph{\href{https://dx.doi.org//10.3233/AIS-2009-0082}{Exploring Semantics in Activity Recognition Using Context Lattices}}. Journal of Ambient Intelligence and Smart Environments \textbf{2}, pp.389–407. 2010.

\label{org80a6ba8}Adrian K. Clear, Thomas Holland, Simon Dobson, Aaron Quigley, Ross Shannon, and Paddy Nixon.  \emph{\href{https://dx.doi.org//10.1016/j.pmcj.2010.04.002}{Situvis: A Sensor Data Analysis and Abstraction Tool for Pervasive Computing Systems}}. Pervasive and Mobile Computing \textbf{6}, pp.575–589. 2010.

\label{orgdc6a119}Graeme Stevenson, Juan Ye, Simon Dobson, and Paddy Nixon.  \emph{\href{https://dx.doi.org//10.1109/MPRV.2009.90}{LOC8: A Location Model and Extensible Framework for Programming with Location}}. IEEE Pervasive Computing \textbf{9}, pp.28–37. 2010.

\label{org7847cad}Simon Dobson, Roy Sterritt, Paddy Nixon, and Mike Hinchey.  \emph{\href{https://dx.doi.org///10.1109/MC.2010.14}{Fulfilling the Vision of Autonomic Computing}}. IEEE Computer \textbf{43}, pp.35–41. 2010.

\label{orgff4d684}Susan McKeever, Juan Ye, Lorcan Coyle, Chris Bleakley, and Simon Dobson.  \emph{\href{https://dx.doi.org//10.3233/AIS-2010-0071}{Activity Recognition Using Temporal Evidence Theory}}. Journal of Ambient Intelligence and Smart Environments \textbf{2}, pp.253–269. 2010.

\label{orga964706}Michael Collins, Simon Dobson, and Paddy Nixon.  \emph{\href{https://simondobson.org/softcopy/aslan-09.pdf}{Securing Wireless Sensor Networks: Introducing ASLAN – a Secure, Lightweight Architecture for WSNs}}. International Journal on Advances in Networks and Services \textbf{2}, pp.679–685. May 2009.

\label{orgf84462e}Michael Collins, Simon Dobson, and Paddy Nixon.  \emph{\href{https://simondobson.org/softcopy/ijitst-08.pdf}{A Lightweight Secure Architecture for Wireless Sensor Networks}}. International Journal of Internet Technology and Secured Transactions \textbf{2}. 2009.

\label{org186a9c0}John Strassner, Sven van der Meer, Declan O’Sullivan, and Simon Dobson.  \emph{\href{https://dx.doi.org//10.1007/s10922-009-9126-4}{The Use of Context-Aware Policies and Ontologies to Facilitate Business-Aware Network Management}}. Journal of Network and Systems Management \textbf{17}, pp.255–284. 2009.

\label{org923630d}Brendan Sheehan, Aaron Quigley, Benoit Gaudin, and Simon Dobson.  \emph{\href{http://www.biomedcentral.com/1471-2105/9/468/abstract}{A Relation Based Measure of Semantic Similarity for Gene Ontology Annotations}}. BMC Bioinformatics Journal \textbf{9}. 2008.

\label{org4679703}Stephen Knox, Adrian K. Clear, Ross Shannon, Lorcan Coyle, Simon Dobson, Aaron Quigley, and Paddy Nixon.  \emph{Scatterbox: Mobile Message Management}. Revue d’Intelligence Artificielle \textbf{22}, pp.549–568. 2008.

\label{orgd87178f}Juan Ye, Lorcan Coyle, Simon Dobson, and Paddy Nixon.  \emph{\href{https://simondobson.org/softcopy/ria-08a.pdf}{Representing and Manipulating Situation Hierarchies Using Situation Lattices}}. Revue d’Intelligence Artificielle \textbf{22}, pp.647–667. 2008.

\label{org9b3ab23}Simon Dobson.  \emph{An Adaptive Systems Perspective on Network Calculus, with Applications to Autonomic Control}. International Journal of Autonomous and Adaptive Communications Systems \textbf{1}, pp.332–341. 2008.

\label{org4844822}Juan Ye, Lorcan Coyle, Simon Dobson, and Paddy Nixon.  \emph{\href{https://dx.doi.org//10.1017/S0269888907001208}{Ontology-Based Models in Pervasive Computing Systems}}. The Knowledge Engineering Review \textbf{22}, pp.315–347. 2007.

\label{org28a4a69}Simon Dobson, Lorcan Coyle, and Paddy Nixon.  \emph{\href{https://simondobson.org/softcopy/tcaas-hybrid-06.pdf}{Hybridising Events and Knowledge as a Basis for Building Autonomic Systems}}. IEEE TCAAS Letters. 2007.

\label{orga3f692a}M.A. Razzaque, Simon Dobson, and Paddy Nixon.  \emph{\href{https://simondobson.org/softcopy/jnsm-crosslayer-07.pdf}{Cross-Layer Architectures for Autonomic Communications}}. Journal of Network and Systems Management \textbf{15}, pp.13–27. 2007.

\label{org6d2703f}M.A. Razzaque, Simon Dobson, and Paddy Nixon.  \emph{\href{https://simondobson.org/softcopy/tcaas-qoc-06.pdf}{Classification and Modeling of the Quality of Contextual Information}}. IEEE TCAAS Letters. 2007.

\label{orgb45c880}Lorcan Coyle, Steve Neely, Graeme Stevenson, Mark Sullivan, Simon Dobson, and Paddy Nixon.  \emph{\href{https://simondobson.org/softcopy/smart-homes-ijarm-06.pdf}{Sensor Fusion-Based Middleware for Smart Homes}}. International Journal of Assistive Robotics and Mechatronics \textbf{8}, pp.53–60. 2007.

\label{org6f9364f}Steve Neely, Simon Dobson, and Paddy Nixon.  \emph{\href{https://simondobson.org/softcopy/aot-survey-06.pdf}{Adaptive Middleware for Autonomic Systems}}. Annals of Telecommunications \textbf{61}, pp.1099–1118. 2006.

\label{org7eb2e85}Simon Dobson, Spyros Denazis, Antonio Fernández, Dominique Gaïti, Erol Gelenbe, Fabio Massacci, Paddy Nixon, Fabrice Saffre, Nikita Schmidt, and Franco Zambonelli.  \emph{\href{https://dx.doi.org//10.1145/1186778.1186782}{A Survey of Autonomic Communications}}. ACM Transactions on Autonomous and Adaptive Systems \textbf{1}, pp.223–259. 2006.

\label{org7c72633}Joëlle Coutaz, James Crowley, Simon Dobson, and David Garlan.  \emph{\href{https://dx.doi.org//10.1145/1047671.1047703}{Context Is Key}}. Communications of the ACM \textbf{48}, pp.49–53. 2005.

\label{org9eb0e09}Don Goodeve, Simon Dobson, Jonathan Nash, John Davy, Peter Dew, Mourad Kara, and Chris Wadsworth.  \emph{\href{https://simondobson.org/softcopy/JPDC-98.pdf}{Towards a Model for Shared Data Abstraction with Performance}}. Journal of Parallel and Distributed Computing \textbf{49}, pp.156–167. 1998.

\label{orgcc26f9e}Simon Dobson and Victoria Burrill.  \emph{\href{https://dx.doi.org//10.1016/0169-7552(95)00012-V}{Lightweight Databases}}. Computer Networks and ISDN Systems \textbf{27}, pp.1009–1015. 1995.
