pages/research/publications.org
** Major conferences

#+begin: sd/bibliography :key category :value "major conference"
<<citeproc_bib_item_1>>Lei Fang, Juan Ye, and Simon Dobson.  /[[https://doi.org/10.1109/SASO.2019.00014][Distributed Self-Monitoring Sensor Networks via Markov Switching Dynamic Linear Models]]/. In /Proceedings of the Thirteenth IEEE International Conference on Self-Adaptive and Self-Organizing Systems (SASO’19)/. Umeå, SE. 2019. Winner of runner-up best paper award.

<<citeproc_bib_item_2>>Lei Fang, Juan Ye, and Simon Dobson.  /[[https://doi.org/10.1109/DSAA.2019.00030][Sensor-Based Human Activity Mining Using Dirichlet Process Mixtures of Directional Statistical Models]]/. In /Proceedings of the 6th IEEE International Conference on Data Science and Advanced Analytics (DSAA’19)/. Washington, DC. 2019.

<<citeproc_bib_item_3>>Danilo Pianini, Simon Dobson, and Mirki Viroli.  /[[https://dx.doi.org//10.1109/SASO.2017.10][Self-Stabilising Target Counting in Wireless Sensor Networks Using Euler Integration]]/. In /Proceedings of the Eleventh IEEE International Conference on Self-Adaptive and Self-Organizing Systems (SASO’17)/, pp.11–20. Tucson, AZ. 2017.

<<citeproc_bib_item_4>>Juan Ye, Lei Fang, and Simon Dobson.  /[[https://dx.doi.org//10.1145/2968219.2968288][Discovery and Recognition of Unknown Activities]]/. In /Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing (Ubicomp’16): Adjunct/, pp.783–792. Heidelberg, de. 2016.

<<citeproc_bib_item_5>>Lei Fang and Simon Dobson.  /[[https://dx.doi.org//10.1109/SASO.2015.14][Towards Data-Centric Control of Sensor Networks through Bayesian Dynamic Linear Modelling]]/. In /Proceedings of the Ninth IEEE International Conference on Self-Adaptive and Self-Organizing Systems (SASO’15)/. Boston, MA. 2015.

<<citeproc_bib_item_6>>Juan Ye, Graeme Stevenson, and Simon Dobson.  /[[https://simondobson.org/softcopy/binarysensorfaults-15.pdf][Fault Detection for Binary Sensors in Smart Home Environments]]/. In /Proceedings of the IEEE International Conference on Pervasive Computing and Communications (Percom 2015)/. St Louis, MO. 2015.

<<citeproc_bib_item_7>>Lei Fang and Simon Dobson.  /[[https://dx.doi.org//10.1109/ICCAC.2014.9][Data Collection with in-Network Fault Detection Based on Spatial Correlation]]/. In /Proceedings of the International Conference on Cloud and Autonomic Computing (CAC 2014)/. London, UK. 2014.

<<citeproc_bib_item_8>>José Luis Fernandez-Marquez, Giovanna di Marzo Serugendo, Graeme Stevenson, Juan Ye, Simon Dobson, and Franco Zambonelli.  /[[https://simondobson.org/softcopy/SAC-PSC2014.pdf][Self-Management of Self-Organising Mobile Computing Applications: A Separation of Concerns Approach]]/. In /Proceedings of the 29th ACM Symposium on Applied Computing/. Gyeongju, KR. 2014.

<<citeproc_bib_item_9>>Chris Schneider, Adam Barker, and Simon Dobson.  /[[https://simondobson.org/softcopy/faults-ease-14.pdf][Autonomous Fault Detection in Self-Healing Systems Using Restricted Boltzmann Machines]]/. In /Proceedings of the 11th IEEE International Conference and Workshops on Engineering of Autonomic and Autonomous Systems (EASe 2014)/. Laurel, MD. 2014.

<<citeproc_bib_item_10>>Lei Fang and Simon Dobson.  /[[https://simondobson.org/softcopy/iwsos-faults-energy.pdf][Unifying Sensor Fault Detection with Energy Conservation]]/. In /Proceedings of the 7th International Workshop on Self-Organising Systems (IWSOS’13)/. Palma de Mallorca, ES. May 2013.

<<citeproc_bib_item_11>>Graeme Stevenson, Juan Ye, Simon Dobson, Danilo Pianini, Sara Montagna, and Mirko Viroli.  /[[https://simondobson.org/softcopy/sac-2013.pdf][Combining Self-Organisation, Context-Awareness and Semantic Reasoning: The Case of Resource Discovery in Opportunistic Networks]]/. In /Proceedings of the 28th ACM Symposium on Applied Computing/. Coimbra, PT. 2013.

<<citeproc_bib_item_12>>Lei Fang, Simon Dobson, and Danny Hughes.  /[[https://simondobson.org/softcopy/pewasun13.pdf][An Error-Free Data Collection Method Exploiting Hierarchical Physical Models of Wireless Sensor Networks]]/. In /Proceedings of the Tenth ACM International Symposium on Performance Evaluation of Wireless Ad Hoc, Sensor, and Ubiquitous Networks/. ACM Press. Barcelona, ES. 2013.

<<citeproc_bib_item_13>>Abu Raihan M. Kamal, Chris Bleakley, and Simon Dobson.  /[[https://dx.doi.org//10.1145/2387027.2387043][Congestion Mitigation Using in-Network Sensor Data Summarization]]/. In /Proceedings of the Ninth ACM International Symposium on Performance Evaluation of Wireless Ad Hoc, Sensor, and Ubiquitous Networks/, pp.93–100. Paphos, CY. 2012.

<<citeproc_bib_item_14>>Emil Vassev, Mike Hinchey, Dharini Balasubramaniam, and Simon Dobson.  /[[https://simondobson.org/softcopy/assl-sew11.pdf][An ASSL Approach to Handling Uncertainty in Self-Adaptive Systems]]/. In /Proceedings of the 34th IEEE Software Engineering Workshop/. IEEE Press. Limerick, IE. 2011.

<<citeproc_bib_item_15>>Emerson Loureiro, Paddy Nixon, and Simon Dobson.  /[[https://simondobson.org/softcopy/pdp-10.pdf][Adaptive Management of Shared Resource Pools with Decentralized Optimization and Epidemics]]/. In /Proceedings of the 18th Euromicro Conference on Parallel, Distributed and Network-Based Processing/, pp.51–58. Marco Danelutto, Julien Borgeois, and Tom Gross, editors. IEEE Computer Society Press. Pisa, IT. 2010.

<<citeproc_bib_item_16>>Adrian K. Clear, Ross Shannon, Thomas Holland, Aaron Quigley, Simon Dobson, and Paddy Nixon.  /[[https://simondobson.org/softcopy/situvis-pervasive-09.pdf][Situvis: A Visual Tool for Modeling a User’s Behaviour Patterns in a Pervasive Environment]]/. In /Proceedings of the 7th International Conference on Pervasive Computing/. Nara, JP. May 2009.

<<citeproc_bib_item_17>>Juan Ye, Lorcan Coyle, Simon Dobson, and Paddy Nixon.  /[[https://simondobson.org/softcopy/percom2009.pdf][Using Situation Lattices in Sensor Analysis]]/. In /Proceedings of the 7th IEEE International Conference on Pervasive Computing and Communications (Percom 2009)/, pp.1–11. Galveston, TX. 2009.

<<citeproc_bib_item_18>>Susan McKeever, Juan Ye, Lorcan Coyle, and Simon Dobson.  /[[https://simondobson.org/softcopy/ds-situation-inference-eurossc-09.pdf][Using Dempster-Shafer Theory of Evidence for Situation Inference]]/. In /Proceedings of the 4th European Conference on Smart Sensing and Context (EuroSSC)/. Volume 5741 of LNCS. Springer-Verlag. Guildford, UK. 2009.

<<citeproc_bib_item_19>>Hui Zhang, Paddy Nixon, and Simon Dobson.  /[[https://simondobson.org/softcopy/wimob-09.pdf][Partial Coverage in Homological Sensor Networks]]/. In /Proceedings of the 5th IEEE International Conference on Wireless and Mobile Computing, Networking and Communications (WiMOB 2009)/, pp.42–47. IEEE Press. Marrakech, MA. 2009.

<<citeproc_bib_item_20>>Emerson Loureiro, Paddy Nixon, and Simon Dobson.  /[[https://simondobson.org/softcopy/incos-09.pdf][Decentralized Utility Maximization for Adaptive Management of Shared Resource Pools]]/. In /Proceedings of the International Conference on Intelligent Networking and Collaborative Systems (INCoS’09)/. IEEE Computer Society. Barcelona, ES. 2009.

<<citeproc_bib_item_21>>Davide Cellai, Graham Williamson, Simon Dobson, and Paddy Nixon.  /[[https://simondobson.org/softcopy/iwsos-09.pdf][Self-Management of Routing on Human Proximity Networks]]/. In /Self-Organising Systems/, pp.1–12. Thrasyvoulos Spyropoulos and Karin Anna Hummel, editors. Volume 5918 of LNCS. Springer-Verlag. Zurich, CH. 2009.

<<citeproc_bib_item_22>>Juan Ye and Simon Dobson.  /[[https://simondobson.org/softcopy/SMC2009.pdf][Human-Behaviour Study with Situation Lattices]]/. In /Proceedings of the IEEE International Conference on Systems, Man and Cybernetics/. San Antonio, TX. 2009.

<<citeproc_bib_item_23>>Simon Dobson, Lorcan Coyle, G.M.P. O’Hare, and Mike Hinchey.  /[[https://simondobson.org/softcopy/well-founded-control.pdf][From Physical Models to Well-Founded Control]]/. In /Proceedings of the 6th IEEE International Conference and Workshops on Engineering of Autonomic and Autonomous Systems/. IEEE Press. San Francisco, ca. 2009.

<<citeproc_bib_item_24>>Susan McKeever, Juan Ye, Lorcan Coyle, and Simon Dobson.  /A Context Quality Model to Support Transparent Reasoning with Uncertain Context/. In /Quality of Context/. K. Rothermal, D. Fritsch, W. Blochinger, and F. Dürr, editors. Volume 5786 of LNCS. Springer Verlag. Stuttgart, de. 2009.

<<citeproc_bib_item_25>>Juan Ye, Susan McKeever, Lorcan Coyle, Steve Neely, and Simon Dobson.  /[[https://simondobson.org/softcopy/icps-08.pdf][Resolving Uncertainty in Context Integration and Abstraction]]/. In /Proceedings of the 5th International Conference on Pervasive Services/, pp.131–140. Domenico Cotroneo and Julie McCann, editors. ACM Press. Sorrento, IT. 2008.

<<citeproc_bib_item_26>>Emerson Loureiro, Paddy Nixon, and Simon Dobson.  /[[https://simondobson.org/softcopy/iwsos-08.pdf][A Fine-Grained Model for Adaptive on-Demand Provisioning of CPU Shares in Data Centres]]/. In /Self-Organizing Systems/, pp.97–108. Karin Anna Hummel and James Sterbenz, editors. Volume 5343 of LNCS. Springer Verlag. Vienna, at. 2008.

<<citeproc_bib_item_27>>Hui Zhang, Paddy Nixon, and Simon Dobson.  /[[https://simondobson.org/softcopy/iccs-08.pdf][Multi-Criteria Adaptation Mechanisms in Homological Sensor Networks]]/. In /Proceedings of the 11th IEEE International Conference on Communciations Systems/. IEEE Press. Guangzhou, CN. 2008.

<<citeproc_bib_item_28>>M.A. Razzaque, Simon Dobson, and Paddy Nixon.  /[[https://simondobson.org/softcopy/clsr-08.pdf][Cross-Layer Self Routing: A Self-Managed Routing Approach for MANETs]]/. In /Proceedings of the 4th IEEE International Conference on Wireless and Mobile Computing, Networking and Communications/. IEEE Press. Avignon, FR. 2008.

<<citeproc_bib_item_29>>Kieran Delaney, Simon Dobson, and John Barton.  /Collaborative Smart Objects and Augmented Materials/. In /Proceedings of the Sensors and Systems Symposium at the NSTI Nanotechnology Conference (Nanotech 2007)/. Santa Clara, ca. May 2007.

<<citeproc_bib_item_30>>Simon Dobson and Paddy Nixon.  /[[https://simondobson.org/softcopy/sesami-07.pdf][Whole-System Programming of Adaptive Ambient Intelligence]]/. In /Proceedings of HCI International 2007/, pp.73–81. Volume 4555 of LNCS. Springer-Verlag. Beijing, CN. 2007.

<<citeproc_bib_item_31>>Adrian K. Clear, Simon Dobson, and Paddy Nixon.  /[[https://simondobson.org/softcopy/smc-07.pdf][An Approach to Dealing with Uncertainty in Context-Aware Pervasive Systems]]/. In /Proceedings of the UK/IE IEEE SMC Cybernetic Systems Conference 2007/. IEEE Press. Dublin, IE. 2007.

<<citeproc_bib_item_32>>Juan Ye, Lorcan Coyle, Simon Dobson, and Paddy Nixon.  /[[https://simondobson.org/softcopy/loca-07.pdf][A Unified Semantics Space Model]]/. In /Location- and Context-Awareness/, pp.103–120. Volume 4718 of LNCS. 2007.

<<citeproc_bib_item_33>>Simon Dobson.  /[[https://simondobson.org/softcopy/composition-tfaas-06.pdf][Achieving an Acceptable Design Model for Autonomic Systems]]/. In /Proceedings of the 4th IEEE International Workshop on Engineering Autonomic and Autonomous Systems/, pp.196–202. IEEE Press. Tucson, AZ. 2007. Reprinted in AS Letters, October/November 2006.

<<citeproc_bib_item_34>>Simon Dobson, Eoin Bailey, Stephen Knox, Ross Shannon, and Aaron Quigley.  /[[https://simondobson.org/softcopy/iceccs2007.pdf][A First Approach to the Closed-Form Specification and Analysis of an Autonomic Control System]]/. In /Proceedings of the 12th IEEE International Conference on Engineering Complex Computer Systems/. Auckland, NZ. 2007.

<<citeproc_bib_item_35>>Graeme Stevenson, Paddy Nixon, and Simon Dobson.  /[[https://simondobson.org/softcopy/WAC-05.pdf][Towards a Reliable Wide-Area Infrastructure for Context-Based Self-Management of Communications]]/. In /Autonomic Communication: 2nd International IFIP Workshop on Autonomic Communication/, pp.115–128. Ioannis Stavrakakis and Mikhail Smirnov, editors. Volume 3854 of LNCS. Springer-Verlag. 2006.

<<citeproc_bib_item_36>>Eleanor O’Neill, David Lewis, Kris McGlinn, and Simon Dobson.  /[[https://simondobson.org/softcopy/dsvis-06.pdf][Rapid User-Centred Evaluation for Context-Aware Systems]]/. In /Interactive Systems: Design, Specification, and Verification/. Gavin Doherty and Ann Blandford, editors. Volume 4323 of LNCS. Springer-Verlag. Dublin, IE. 2006.

<<citeproc_bib_item_37>>M.A. Razzaque, Simon Dobson, and Paddy Nixon.  /[[https://simondobson.org/softcopy/WAC-06.pdf][A Cross-Layer Architecture for Autonomic Communications]]/. In /Autonomic Networking/, pp.25–35. Dominique Gaïti, Guy Pujolle, Ehab Al-Shaer, Ken Calvert, Simon Dobson, Guy Leduc, and Olli Martikainen, editors. Volume 4195 of LNCS. Springer-Verlag. Paris, FR. 2006.

<<citeproc_bib_item_38>>M.A. Razzaque, Paddy Nixon, and Simon Dobson.  /[[https://simondobson.org/softcopy/dictadcom-06.pdf][Demonstrating the Feasibility of an Autonomic Communications-Targeted Cross-Layer Architecture]]/. In /Proceedings of the 14th International Conference on Advanced Computing and Communications/. Mangalore, in. 2006.

<<citeproc_bib_item_39>>Lorcan Coyle, Steve Neely, Gaëtan Rey, Graeme Stevenson, Mark Sullivan, Simon Dobson, and Paddy Nixon.  /[[https://simondobson.org/softcopy/ICOST-06.pdf][Sensor Fusion-Based Middleware for Assisted Living]]/. In /Smart Homes and beyond/, pp.281–288. Chris Nugent and Juan Carlos Augusto, editors. IOS Press. Belfast, UK. 2006.

<<citeproc_bib_item_40>>Simon Dobson.  /Leveraging the Subtleties of Location/. In /sOc-EUSAI’05: Proceedings of the 2005 Joint Conference on Smart Objects and Ambient Intelligence/, pp.175–179. Gérard Bailly, James Crowley, and Gilles Privat, editors. ACM Press. Grenoble, FR. 2005.

<<citeproc_bib_item_41>>Simon Dobson, Kieran Delaney, Kafil Mahmood Razeeb, and Sergey Tsvetkov.  /[[https://simondobson.org/softcopy/MATA-Augmented-05.pdf][A Co-Designed Hardware/Software Architecture for Augmented Materials]]/. In /Proceedings of the 2nd International Workshop on Mobility Aware Technologies and Applications/. Thomas Magedanz, Ahmed Karmouch, Samuel Pierre, and Iakovos Venieris, editors. Volume 3744 of LNCS. Montréal, ca. 2005.

<<citeproc_bib_item_42>>Seán Baker and Simon Dobson.  /[[https://simondobson.org/softcopy/soa-doa-05.pdf][Comparing Service-Oriented and Distributed Object Architectures]]/. In /Proceedings of the International Symposium on Distributed Objects and Applications/, pp.631–645. Robert Meersman and Zahir Tari, editors. Volume 3760 of LNCS. Springer Verlag. 2005.

<<citeproc_bib_item_43>>Simon Dobson.  /[[https://simondobson.org/softcopy/WAC-04a.pdf][Putting Meaning into the Network: Some Semantic Issues for the Design of Autonomic Communications Systems]]/. In /Proceedings of the 1st IFIP Workshop on Autonomic Communications/, pp.207–216. Mikhail Smirnov, editor. Volume 3457 of LNCS. Springer Verlag. Berlin, de. 2005.

<<citeproc_bib_item_44>>Andy Nisbet and Simon Dobson.  /[[https://simondobson.org/softcopy/WAC-04b.pdf][A Systems Architecture for Sensor Networks Based on Hardware/Software Co-Design]]/. In /Proceedings of the 1st IFIP Workshop on Autonomic Communications/. Mikhail Smirnov, editor. Volume 3457 of LNCS. Springer Verlag. Berlin, de. 2005.

<<citeproc_bib_item_45>>Simon Dobson and Paddy Nixon.  /[[https://simondobson.org/softcopy/EHCI-04.pdf][More Principled Design of Pervasive Computing Systems]]/. In /Human Computer Interaction and Interactive Systems/. Rémi Bastide and Jörg Roth, editors. Volume 3425 of LNCS. Springer Verlag. 2004.

<<citeproc_bib_item_46>>Simon Dobson.  /[[https://simondobson.org/softcopy/ISICT-2003.pdf][Applications Considered Harmful for Ambient Systems]]/. In /Proceedings of the ACM International Symposium on Information and Communications Technologies/, pp.171–176. ACM Press. Dublin, IE. 2003.

<<citeproc_bib_item_47>>Tim Walsh, Paddy Nixon, and Simon Dobson.  /As Strong as Possible Agent Mobility/. In /Infrastructure for Agents, Multi-Agent Systems, and Scalable Multi-Agent Systems/, pp.174–176. T. Wagner and O.F. Rana, editors. Volume 1887 of Lecture Notes in Artificial Intelligence. 2001.

<<citeproc_bib_item_48>>Paddy Nixon, Vinny Wade, Sotirios Terzis, Marcus O’Connell, and Simon Dobson.  /[[https://simondobson.org/softcopy/TCD-CS-2000-08.pdf][The Virtues Architecture: A Software Infrastructure for Business-to-Business E-Commerce]]/. In /Proceedings of the 2nd International Conference on Enterprise Information Systems/. Stafford, UK. 2000.

<<citeproc_bib_item_49>>Simon Dobson and Brian Matthews.  /[[https://simondobson.org/softcopy/ions-ecoop-2000.ps][Ionic Types]]/. In /ECOOP 2000 – Object-Oriented Programming/, pp.296–312. Elisa Bertoni, editor. Volume 1850 of LNCS. Springer-Verlag. 2000.

<<citeproc_bib_item_50>>Sotirios Terzis, Paddy Nixon, Vinny Wade, Simon Dobson, and John Fuller.  /[[https://simondobson.org/softcopy/TCD-CS-1999-22.pdf][The Future of Enterprise Groupware Applications]]/. In /Proceedings of the 1st International Conference on Enterprise Information Systems/, pp.525–532. Joaquim Filipe and José Cordeiro, editors. Setubal, PT. 1999. Winner of best student paper award.

<<citeproc_bib_item_51>>Simon Dobson, Paddy Nixon, Vincent Wade, Sotirios Terzis, and John Fuller.  /[[https://simondobson.org/softcopy/vanilla-gcse-1999.ps][Vanilla: An Open Language Framework]]/. In /Generative and Component-Based Software Engineering/. Krzysztof Czarnecki and Ulrich Eisenecker, editors. Volume 1799 of LNCS. Springer-Verlag. 1999.

<<citeproc_bib_item_52>>Simon Dobson and Don Goodeve.  /[[https://simondobson.org/softcopy/irregular-97.pdf][Programming with Shared Data Abstractions]]/. In /Solving Irregularly Structured Problems in Parallel/, pp.93–102. Gianfranco Billardi, Afonso Ferreira, Reinhold Lüling, and José Rolim, editors. Volume 1253 of LNCS. Springer Verlag. 1997.

<<citeproc_bib_item_53>>Simon Dobson and Chris Wadsworth.  /[[https://simondobson.org/softcopy/pdse-96.pdf][Towards a Theory of Shared Data in Distributed Systems]]/. In /Software Engineering for Parallel and Distributed Systems/, pp.170–182. Innes Jelly, Ian Gorton, and Peter Croll, editors. Chapman and Hall. 1996.
#+end:

