research/publications/index.html

<div id="outline-container-org9b7e014" class="outline-3">
<h3 id="org9b7e014">Major&nbsp;conferences</h3>
<div class="outline-text-3" id="text-org9b7e014">
<p>
<a id="orgc72b01c"></a>Lei Fang, Juan Ye, and Simon Dobson.  <i><a href="https://doi.org/10.1109/SASO.2019.00014">Distributed Self-Monitoring Sensor Networks via Markov Switching Dynamic Linear Models</a></i>. In <i>Proceedings of the Thirteenth <span class="caps">IEEE</span> International Conference on Self-Adaptive and Self-Organizing Systems (<span class="caps">SASO</span>’19)</i>. Umeå, <span class="caps">SE</span>. 2019. Winner of runner-up best paper&nbsp;award.
</p>

<p>
<a id="org72df6e2"></a>Lei Fang, Juan Ye, and Simon Dobson.  <i><a href="https://doi.org/10.1109/DSAA.2019.00030">Sensor-Based Human Activity Mining Using Dirichlet Process Mixtures of Directional Statistical Models</a></i>. In <i>Proceedings of the 6th <span class="caps">IEEE</span> International Conference on Data Science and Advanced Analytics (<span class="caps">DSAA</span>’19)</i>. Washington, <span class="caps">DC</span>.&nbsp;2019.
</p>

<p>
<a id="org6ae7c09"></a>Danilo Pianini, Simon Dobson, and Mirki Viroli.  <i><a href="https://dx.doi.org//10.1109/SASO.2017.10">Self-Stabilising Target Counting in Wireless Sensor Networks Using Euler Integration</a></i>. In <i>Proceedings of the Eleventh <span class="caps">IEEE</span> International Conference on Self-Adaptive and Self-Organizing Systems (<span class="caps">SASO</span>’17)</i>, pp.11–20. Tucson, <span class="caps">AZ</span>.&nbsp;2017.
</p>

<p>
<a id="org65b5064"></a>Juan Ye, Lei Fang, and Simon Dobson.  <i><a href="https://dx.doi.org//10.1145/2968219.2968288">Discovery and Recognition of Unknown Activities</a></i>. In <i>Proceedings of the 2016 <span class="caps">ACM</span> International Joint Conference on Pervasive and Ubiquitous Computing (Ubicomp’16): Adjunct</i>, pp.783–792. Heidelberg, de.&nbsp;2016.
</p>

<p>
<a id="org3e95843"></a>Lei Fang and Simon Dobson.  <i><a href="https://dx.doi.org//10.1109/SASO.2015.14">Towards Data-Centric Control of Sensor Networks through Bayesian Dynamic Linear Modelling</a></i>. In <i>Proceedings of the Ninth <span class="caps">IEEE</span> International Conference on Self-Adaptive and Self-Organizing Systems (<span class="caps">SASO</span>’15)</i>. Boston, <span class="caps">MA</span>.&nbsp;2015.
</p>

<p>
<a id="org67ca7b1"></a>Juan Ye, Graeme Stevenson, and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/binarysensorfaults-15.pdf">Fault Detection for Binary Sensors in Smart Home Environments</a></i>. In <i>Proceedings of the <span class="caps">IEEE</span> International Conference on Pervasive Computing and Communications (Percom 2015)</i>. St Louis, <span class="caps">MO</span>.&nbsp;2015.
</p>

<p>
<a id="orgaacbf59"></a>Lei Fang and Simon Dobson.  <i><a href="https://dx.doi.org//10.1109/ICCAC.2014.9">Data Collection with in-Network Fault Detection Based on Spatial Correlation</a></i>. In <i>Proceedings of the International Conference on Cloud and Autonomic Computing (<span class="caps">CAC</span> 2014)</i>. London, <span class="caps">UK</span>.&nbsp;2014.
</p>

<p>
<a id="orgc74d414"></a>José Luis Fernandez-Marquez, Giovanna di Marzo Serugendo, Graeme Stevenson, Juan Ye, Simon Dobson, and Franco Zambonelli.  <i><a href="https://simondobson.org/softcopy/SAC-PSC2014.pdf">Self-Management of Self-Organising Mobile Computing Applications: A Separation of Concerns Approach</a></i>. In <i>Proceedings of the 29th <span class="caps">ACM</span> Symposium on Applied Computing</i>. Gyeongju, <span class="caps">KR</span>.&nbsp;2014.
</p>

<p>
<a id="orgbb395c9"></a>Chris Schneider, Adam Barker, and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/faults-ease-14.pdf">Autonomous Fault Detection in Self-Healing Systems Using Restricted Boltzmann Machines</a></i>. In <i>Proceedings of the 11th <span class="caps">IEEE</span> International Conference and Workshops on Engineering of Autonomic and Autonomous Systems (EASe 2014)</i>. Laurel, <span class="caps">MD</span>.&nbsp;2014.
</p>

<p>
<a id="org5a084b6"></a>Lei Fang and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/iwsos-faults-energy.pdf">Unifying Sensor Fault Detection with Energy Conservation</a></i>. In <i>Proceedings of the 7th International Workshop on Self-Organising Systems (<span class="caps">IWSOS</span>’13)</i>. Palma de Mallorca, <span class="caps">ES</span>. May&nbsp;2013.
</p>

<p>
<a id="org17ec014"></a>Graeme Stevenson, Juan Ye, Simon Dobson, Danilo Pianini, Sara Montagna, and Mirko Viroli.  <i><a href="https://simondobson.org/softcopy/sac-2013.pdf">Combining Self-Organisation, Context-Awareness and Semantic Reasoning: The Case of Resource Discovery in Opportunistic Networks</a></i>. In <i>Proceedings of the 28th <span class="caps">ACM</span> Symposium on Applied Computing</i>. Coimbra, <span class="caps">PT</span>.&nbsp;2013.
</p>

<p>
<a id="org2f7ce43"></a>Lei Fang, Simon Dobson, and Danny Hughes.  <i><a href="https://simondobson.org/softcopy/pewasun13.pdf">An Error-Free Data Collection Method Exploiting Hierarchical Physical Models of Wireless Sensor Networks</a></i>. In <i>Proceedings of the Tenth <span class="caps">ACM</span> International Symposium on Performance Evaluation of Wireless Ad Hoc, Sensor, and Ubiquitous Networks</i>. <span class="caps">ACM</span> Press. Barcelona, <span class="caps">ES</span>.&nbsp;2013.
</p>

<p>
<a id="org88f014e"></a>Abu Raihan M. Kamal, Chris Bleakley, and Simon Dobson.  <i><a href="https://dx.doi.org//10.1145/2387027.2387043">Congestion Mitigation Using in-Network Sensor Data Summarization</a></i>. In <i>Proceedings of the Ninth <span class="caps">ACM</span> International Symposium on Performance Evaluation of Wireless Ad Hoc, Sensor, and Ubiquitous Networks</i>, pp.93–100. Paphos, <span class="caps">CY</span>.&nbsp;2012.
</p>

<p>
<a id="orga00ea59"></a>Emil Vassev, Mike Hinchey, Dharini Balasubramaniam, and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/assl-sew11.pdf">An <span class="caps">ASSL</span> Approach to Handling Uncertainty in Self-Adaptive Systems</a></i>. In <i>Proceedings of the 34th <span class="caps">IEEE</span> Software Engineering Workshop</i>. <span class="caps">IEEE</span> Press. Limerick, <span class="caps">IE</span>.&nbsp;2011.
</p>

<p>
<a id="org81fd01e"></a>Emerson Loureiro, Paddy Nixon, and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/pdp-10.pdf">Adaptive Management of Shared Resource Pools with Decentralized Optimization and Epidemics</a></i>. In <i>Proceedings of the 18th Euromicro Conference on Parallel, Distributed and Network-Based Processing</i>, pp.51–58. Marco Danelutto, Julien Borgeois, and Tom Gross, editors. <span class="caps">IEEE</span> Computer Society Press. Pisa, <span class="caps">IT</span>.&nbsp;2010.
</p>

<p>
<a id="org9df523a"></a>Adrian K. Clear, Ross Shannon, Thomas Holland, Aaron Quigley, Simon Dobson, and Paddy Nixon.  <i><a href="https://simondobson.org/softcopy/situvis-pervasive-09.pdf">Situvis: A Visual Tool for Modeling a User’s Behaviour Patterns in a Pervasive Environment</a></i>. In <i>Proceedings of the 7th International Conference on Pervasive Computing</i>. Nara, <span class="caps">JP</span>. May&nbsp;2009.
</p>

<p>
<a id="org6b7b5ea"></a>Juan Ye, Lorcan Coyle, Simon Dobson, and Paddy Nixon.  <i><a href="https://simondobson.org/softcopy/percom2009.pdf">Using Situation Lattices in Sensor Analysis</a></i>. In <i>Proceedings of the 7th <span class="caps">IEEE</span> International Conference on Pervasive Computing and Communications (Percom 2009)</i>, pp.1–11. Galveston, <span class="caps">TX</span>.&nbsp;2009.
</p>

<p>
<a id="org0384183"></a>Susan McKeever, Juan Ye, Lorcan Coyle, and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/ds-situation-inference-eurossc-09.pdf">Using Dempster-Shafer Theory of Evidence for Situation Inference</a></i>. In <i>Proceedings of the 4th European Conference on Smart Sensing and Context (EuroSSC)</i>. Volume 5741 of <span class="caps">LNCS</span>. Springer-Verlag. Guildford, <span class="caps">UK</span>.&nbsp;2009.
</p>

<p>
<a id="orgebf2175"></a>Hui Zhang, Paddy Nixon, and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/wimob-09.pdf">Partial Coverage in Homological Sensor Networks</a></i>. In <i>Proceedings of the 5th <span class="caps">IEEE</span> International Conference on Wireless and Mobile Computing, Networking and Communications (WiMOB 2009)</i>, pp.42–47. <span class="caps">IEEE</span> Press. Marrakech, <span class="caps">MA</span>.&nbsp;2009.
</p>

<p>
<a id="orgf41aec0"></a>Emerson Loureiro, Paddy Nixon, and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/incos-09.pdf">Decentralized Utility Maximization for Adaptive Management of Shared Resource Pools</a></i>. In <i>Proceedings of the International Conference on Intelligent Networking and Collaborative Systems (INCoS’09)</i>. <span class="caps">IEEE</span> Computer Society. Barcelona, <span class="caps">ES</span>.&nbsp;2009.
</p>

<p>
<a id="org80dc319"></a>Davide Cellai, Graham Williamson, Simon Dobson, and Paddy Nixon.  <i><a href="https://simondobson.org/softcopy/iwsos-09.pdf">Self-Management of Routing on Human Proximity Networks</a></i>. In <i>Self-Organising Systems</i>, pp.1–12. Thrasyvoulos Spyropoulos and Karin Anna Hummel, editors. Volume 5918 of <span class="caps">LNCS</span>. Springer-Verlag. Zurich, <span class="caps">CH</span>.&nbsp;2009.
</p>

<p>
<a id="org86f2bb5"></a>Juan Ye and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/SMC2009.pdf">Human-Behaviour Study with Situation Lattices</a></i>. In <i>Proceedings of the <span class="caps">IEEE</span> International Conference on Systems, Man and Cybernetics</i>. San Antonio, <span class="caps">TX</span>.&nbsp;2009.
</p>

<p>
<a id="orged26c93"></a>Simon Dobson, Lorcan Coyle, <span class="caps">G.M.P.</span> O’Hare, and Mike Hinchey.  <i><a href="https://simondobson.org/softcopy/well-founded-control.pdf">From Physical Models to Well-Founded Control</a></i>. In <i>Proceedings of the 6th <span class="caps">IEEE</span> International Conference and Workshops on Engineering of Autonomic and Autonomous Systems</i>. <span class="caps">IEEE</span> Press. San Francisco, ca.&nbsp;2009.
</p>

<p>
<a id="orgb8e91b2"></a>Susan McKeever, Juan Ye, Lorcan Coyle, and Simon Dobson.  <i>A Context Quality Model to Support Transparent Reasoning with Uncertain Context</i>. In <i>Quality of Context</i>. K. Rothermal, D. Fritsch, W. Blochinger, and F. Dürr, editors. Volume 5786 of <span class="caps">LNCS</span>. Springer Verlag. Stuttgart, de.&nbsp;2009.
</p>

<p>
<a id="org5a9ce2e"></a>Juan Ye, Susan McKeever, Lorcan Coyle, Steve Neely, and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/icps-08.pdf">Resolving Uncertainty in Context Integration and Abstraction</a></i>. In <i>Proceedings of the 5th International Conference on Pervasive Services</i>, pp.131–140. Domenico Cotroneo and Julie McCann, editors. <span class="caps">ACM</span> Press. Sorrento, <span class="caps">IT</span>.&nbsp;2008.
</p>

<p>
<a id="org8648b97"></a>Emerson Loureiro, Paddy Nixon, and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/iwsos-08.pdf">A Fine-Grained Model for Adaptive on-Demand Provisioning of <span class="caps">CPU</span> Shares in Data Centres</a></i>. In <i>Self-Organizing Systems</i>, pp.97–108. Karin Anna Hummel and James Sterbenz, editors. Volume 5343 of <span class="caps">LNCS</span>. Springer Verlag. Vienna, at.&nbsp;2008.
</p>

<p>
<a id="org39984a2"></a>Hui Zhang, Paddy Nixon, and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/iccs-08.pdf">Multi-Criteria Adaptation Mechanisms in Homological Sensor Networks</a></i>. In <i>Proceedings of the 11th <span class="caps">IEEE</span> International Conference on Communciations Systems</i>. <span class="caps">IEEE</span> Press. Guangzhou, <span class="caps">CN</span>.&nbsp;2008.
</p>

<p>
<a id="orgfed9d61"></a><span class="caps">M.A.</span> Razzaque, Simon Dobson, and Paddy Nixon.  <i><a href="https://simondobson.org/softcopy/clsr-08.pdf">Cross-Layer Self Routing: A Self-Managed Routing Approach for MANETs</a></i>. In <i>Proceedings of the 4th <span class="caps">IEEE</span> International Conference on Wireless and Mobile Computing, Networking and Communications</i>. <span class="caps">IEEE</span> Press. Avignon, <span class="caps">FR</span>.&nbsp;2008.
</p>

<p>
<a id="org4279d61"></a>Kieran Delaney, Simon Dobson, and John Barton.  <i>Collaborative Smart Objects and Augmented Materials</i>. In <i>Proceedings of the Sensors and Systems Symposium at the <span class="caps">NSTI</span> Nanotechnology Conference (Nanotech 2007)</i>. Santa Clara, ca. May&nbsp;2007.
</p>

<p>
<a id="org3b7fcab"></a>Simon Dobson and Paddy Nixon.  <i><a href="https://simondobson.org/softcopy/sesami-07.pdf">Whole-System Programming of Adaptive Ambient Intelligence</a></i>. In <i>Proceedings of <span class="caps">HCI</span> International 2007</i>, pp.73–81. Volume 4555 of <span class="caps">LNCS</span>. Springer-Verlag. Beijing, <span class="caps">CN</span>.&nbsp;2007.
</p>

<p>
<a id="orgbee135b"></a>Adrian K. Clear, Simon Dobson, and Paddy Nixon.  <i><a href="https://simondobson.org/softcopy/smc-07.pdf">An Approach to Dealing with Uncertainty in Context-Aware Pervasive Systems</a></i>. In <i>Proceedings of the <span class="caps">UK</span>/<span class="caps">IE</span> <span class="caps">IEEE</span> <span class="caps">SMC</span> Cybernetic Systems Conference 2007</i>. <span class="caps">IEEE</span> Press. Dublin, <span class="caps">IE</span>.&nbsp;2007.
</p>

<p>
<a id="org085ad53"></a>Juan Ye, Lorcan Coyle, Simon Dobson, and Paddy Nixon.  <i><a href="https://simondobson.org/softcopy/loca-07.pdf">A Unified Semantics Space Model</a></i>. In <i>Location- and Context-Awareness</i>, pp.103–120. Volume 4718 of <span class="caps">LNCS</span>.&nbsp;2007.
</p>

<p>
<a id="org7d4b5e4"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/composition-tfaas-06.pdf">Achieving an Acceptable Design Model for Autonomic Systems</a></i>. In <i>Proceedings of the 4th <span class="caps">IEEE</span> International Workshop on Engineering Autonomic and Autonomous Systems</i>, pp.196–202. <span class="caps">IEEE</span> Press. Tucson, <span class="caps">AZ</span>. 2007. Reprinted in <span class="caps">AS</span> Letters, October/November&nbsp;2006.
</p>

<p>
<a id="orgfb3ce26"></a>Simon Dobson, Eoin Bailey, Stephen Knox, Ross Shannon, and Aaron Quigley.  <i><a href="https://simondobson.org/softcopy/iceccs2007.pdf">A First Approach to the Closed-Form Specification and Analysis of an Autonomic Control System</a></i>. In <i>Proceedings of the 12th <span class="caps">IEEE</span> International Conference on Engineering Complex Computer Systems</i>. Auckland, <span class="caps">NZ</span>.&nbsp;2007.
</p>

<p>
<a id="orge42ca33"></a>Graeme Stevenson, Paddy Nixon, and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/WAC-05.pdf">Towards a Reliable Wide-Area Infrastructure for Context-Based Self-Management of Communications</a></i>. In <i>Autonomic Communication: 2nd International <span class="caps">IFIP</span> Workshop on Autonomic Communication</i>, pp.115–128. Ioannis Stavrakakis and Mikhail Smirnov, editors. Volume 3854 of <span class="caps">LNCS</span>. Springer-Verlag.&nbsp;2006.
</p>

<p>
<a id="org9136941"></a>Eleanor O’Neill, David Lewis, Kris McGlinn, and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/dsvis-06.pdf">Rapid User-Centred Evaluation for Context-Aware Systems</a></i>. In <i>Interactive Systems: Design, Specification, and Verification</i>. Gavin Doherty and Ann Blandford, editors. Volume 4323 of <span class="caps">LNCS</span>. Springer-Verlag. Dublin, <span class="caps">IE</span>.&nbsp;2006.
</p>

<p>
<a id="org5d8e679"></a><span class="caps">M.A.</span> Razzaque, Simon Dobson, and Paddy Nixon.  <i><a href="https://simondobson.org/softcopy/WAC-06.pdf">A Cross-Layer Architecture for Autonomic Communications</a></i>. In <i>Autonomic Networking</i>, pp.25–35. Dominique Gaïti, Guy Pujolle, Ehab Al-Shaer, Ken Calvert, Simon Dobson, Guy Leduc, and Olli Martikainen, editors. Volume 4195 of <span class="caps">LNCS</span>. Springer-Verlag. Paris, <span class="caps">FR</span>.&nbsp;2006.
</p>

<p>
<a id="org97b6b59"></a><span class="caps">M.A.</span> Razzaque, Paddy Nixon, and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/dictadcom-06.pdf">Demonstrating the Feasibility of an Autonomic Communications-Targeted Cross-Layer Architecture</a></i>. In <i>Proceedings of the 14th International Conference on Advanced Computing and Communications</i>. Mangalore, in.&nbsp;2006.
</p>

<p>
<a id="org6bce891"></a>Lorcan Coyle, Steve Neely, Gaëtan Rey, Graeme Stevenson, Mark Sullivan, Simon Dobson, and Paddy Nixon.  <i><a href="https://simondobson.org/softcopy/ICOST-06.pdf">Sensor Fusion-Based Middleware for Assisted Living</a></i>. In <i>Smart Homes and beyond</i>, pp.281–288. Chris Nugent and Juan Carlos Augusto, editors. <span class="caps">IOS</span> Press. Belfast, <span class="caps">UK</span>.&nbsp;2006.
</p>

<p>
<a id="org00120f0"></a>Simon Dobson.  <i>Leveraging the Subtleties of Location</i>. In <i>sOc-<span class="caps">EUSAI</span>’05: Proceedings of the 2005 Joint Conference on Smart Objects and Ambient Intelligence</i>, pp.175–179. Gérard Bailly, James Crowley, and Gilles Privat, editors. <span class="caps">ACM</span> Press. Grenoble, <span class="caps">FR</span>.&nbsp;2005.
</p>

<p>
<a id="org06a076b"></a>Simon Dobson, Kieran Delaney, Kafil Mahmood Razeeb, and Sergey Tsvetkov.  <i><a href="https://simondobson.org/softcopy/MATA-Augmented-05.pdf">A Co-Designed Hardware/Software Architecture for Augmented Materials</a></i>. In <i>Proceedings of the 2nd International Workshop on Mobility Aware Technologies and Applications</i>. Thomas Magedanz, Ahmed Karmouch, Samuel Pierre, and Iakovos Venieris, editors. Volume 3744 of <span class="caps">LNCS</span>. Montréal, ca.&nbsp;2005.
</p>

<p>
<a id="orgaeb2560"></a>Seán Baker and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/soa-doa-05.pdf">Comparing Service-Oriented and Distributed Object Architectures</a></i>. In <i>Proceedings of the International Symposium on Distributed Objects and Applications</i>, pp.631–645. Robert Meersman and Zahir Tari, editors. Volume 3760 of <span class="caps">LNCS</span>. Springer Verlag.&nbsp;2005.
</p>

<p>
<a id="org7ef354a"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/WAC-04a.pdf">Putting Meaning into the Network: Some Semantic Issues for the Design of Autonomic Communications Systems</a></i>. In <i>Proceedings of the 1st <span class="caps">IFIP</span> Workshop on Autonomic Communications</i>, pp.207–216. Mikhail Smirnov, editor. Volume 3457 of <span class="caps">LNCS</span>. Springer Verlag. Berlin, de.&nbsp;2005.
</p>

<p>
<a id="org42002d4"></a>Andy Nisbet and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/WAC-04b.pdf">A Systems Architecture for Sensor Networks Based on Hardware/Software Co-Design</a></i>. In <i>Proceedings of the 1st <span class="caps">IFIP</span> Workshop on Autonomic Communications</i>. Mikhail Smirnov, editor. Volume 3457 of <span class="caps">LNCS</span>. Springer Verlag. Berlin, de.&nbsp;2005.
</p>

<p>
<a id="org927544a"></a>Simon Dobson and Paddy Nixon.  <i><a href="https://simondobson.org/softcopy/EHCI-04.pdf">More Principled Design of Pervasive Computing Systems</a></i>. In <i>Human Computer Interaction and Interactive Systems</i>. Rémi Bastide and Jörg Roth, editors. Volume 3425 of <span class="caps">LNCS</span>. Springer Verlag.&nbsp;2004.
</p>

<p>
<a id="org1bfca87"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/ISICT-2003.pdf">Applications Considered Harmful for Ambient Systems</a></i>. In <i>Proceedings of the <span class="caps">ACM</span> International Symposium on Information and Communications Technologies</i>, pp.171–176. <span class="caps">ACM</span> Press. Dublin, <span class="caps">IE</span>.&nbsp;2003.
</p>

<p>
<a id="orga9a084c"></a>Tim Walsh, Paddy Nixon, and Simon Dobson.  <i>As Strong as Possible Agent Mobility</i>. In <i>Infrastructure for Agents, Multi-Agent Systems, and Scalable Multi-Agent Systems</i>, pp.174–176. T. Wagner and <span class="caps">O.F.</span> Rana, editors. Volume 1887 of Lecture Notes in Artificial Intelligence.&nbsp;2001.
</p>

<p>
<a id="orgf98ab19"></a>Paddy Nixon, Vinny Wade, Sotirios Terzis, Marcus O’Connell, and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/TCD-CS-2000-08.pdf">The Virtues Architecture: A Software Infrastructure for Business-to-Business E-Commerce</a></i>. In <i>Proceedings of the 2nd International Conference on Enterprise Information Systems</i>. Stafford, <span class="caps">UK</span>.&nbsp;2000.
</p>

<p>
<a id="org1fbf3a5"></a>Simon Dobson and Brian Matthews.  <i><a href="https://simondobson.org/softcopy/ions-ecoop-2000.ps">Ionic Types</a></i>. In <i><span class="caps">ECOOP</span> 2000 – Object-Oriented Programming</i>, pp.296–312. Elisa Bertoni, editor. Volume 1850 of <span class="caps">LNCS</span>. Springer-Verlag.&nbsp;2000.
</p>

<p>
<a id="org44c4317"></a>Sotirios Terzis, Paddy Nixon, Vinny Wade, Simon Dobson, and John Fuller.  <i><a href="https://simondobson.org/softcopy/TCD-CS-1999-22.pdf">The Future of Enterprise Groupware Applications</a></i>. In <i>Proceedings of the 1st International Conference on Enterprise Information Systems</i>, pp.525–532. Joaquim Filipe and José Cordeiro, editors. Setubal, <span class="caps">PT</span>. 1999. Winner of best student paper&nbsp;award.
</p>

<p>
<a id="orgf1eb33b"></a>Simon Dobson, Paddy Nixon, Vincent Wade, Sotirios Terzis, and John Fuller.  <i><a href="https://simondobson.org/softcopy/vanilla-gcse-1999.ps">Vanilla: An Open Language Framework</a></i>. In <i>Generative and Component-Based Software Engineering</i>. Krzysztof Czarnecki and Ulrich Eisenecker, editors. Volume 1799 of <span class="caps">LNCS</span>. Springer-Verlag.&nbsp;1999.
</p>

<p>
<a id="org466002b"></a>Simon Dobson and Don Goodeve.  <i><a href="https://simondobson.org/softcopy/irregular-97.pdf">Programming with Shared Data Abstractions</a></i>. In <i>Solving Irregularly Structured Problems in Parallel</i>, pp.93–102. Gianfranco Billardi, Afonso Ferreira, Reinhold Lüling, and José Rolim, editors. Volume 1253 of <span class="caps">LNCS</span>. Springer Verlag.&nbsp;1997.
</p>

<p>
<a id="orgf809405"></a>Simon Dobson and Chris Wadsworth.  <i><a href="https://simondobson.org/softcopy/pdse-96.pdf">Towards a Theory of Shared Data in Distributed Systems</a></i>. In <i>Software Engineering for Parallel and Distributed Systems</i>, pp.170–182. Innes Jelly, Ian Gorton, and Peter Croll, editors. Chapman and Hall.&nbsp;1996.
</p>
</div>
</div>
