pages/research/publications.tex

\subsection{Major conferences}
\label{sec:org358b2d5}

\label{orgd37e71b}Lei Fang, Juan Ye, and Simon Dobson.  \emph{\href{https://doi.org/10.1109/SASO.2019.00014}{Distributed Self-Monitoring Sensor Networks via Markov Switching Dynamic Linear Models}}. In \emph{Proceedings of the Thirteenth IEEE International Conference on Self-Adaptive and Self-Organizing Systems (SASO’19)}. Umeå, SE. 2019. Winner of runner-up best paper award.

\label{org9b60051}Lei Fang, Juan Ye, and Simon Dobson.  \emph{\href{https://doi.org/10.1109/DSAA.2019.00030}{Sensor-Based Human Activity Mining Using Dirichlet Process Mixtures of Directional Statistical Models}}. In \emph{Proceedings of the 6th IEEE International Conference on Data Science and Advanced Analytics (DSAA’19)}. Washington, DC. 2019.

\label{orgb49eaa5}Danilo Pianini, Simon Dobson, and Mirki Viroli.  \emph{\href{https://dx.doi.org//10.1109/SASO.2017.10}{Self-Stabilising Target Counting in Wireless Sensor Networks Using Euler Integration}}. In \emph{Proceedings of the Eleventh IEEE International Conference on Self-Adaptive and Self-Organizing Systems (SASO’17)}, pp.11–20. Tucson, AZ. 2017.

\label{org4e8b270}Juan Ye, Lei Fang, and Simon Dobson.  \emph{\href{https://dx.doi.org//10.1145/2968219.2968288}{Discovery and Recognition of Unknown Activities}}. In \emph{Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing (Ubicomp’16): Adjunct}, pp.783–792. Heidelberg, de. 2016.

\label{org551ef42}Lei Fang and Simon Dobson.  \emph{\href{https://dx.doi.org//10.1109/SASO.2015.14}{Towards Data-Centric Control of Sensor Networks through Bayesian Dynamic Linear Modelling}}. In \emph{Proceedings of the Ninth IEEE International Conference on Self-Adaptive and Self-Organizing Systems (SASO’15)}. Boston, MA. 2015.

\label{orge140cf4}Juan Ye, Graeme Stevenson, and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/binarysensorfaults-15.pdf}{Fault Detection for Binary Sensors in Smart Home Environments}}. In \emph{Proceedings of the IEEE International Conference on Pervasive Computing and Communications (Percom 2015)}. St Louis, MO. 2015.

\label{org9b98f1d}Lei Fang and Simon Dobson.  \emph{\href{https://dx.doi.org//10.1109/ICCAC.2014.9}{Data Collection with in-Network Fault Detection Based on Spatial Correlation}}. In \emph{Proceedings of the International Conference on Cloud and Autonomic Computing (CAC 2014)}. London, UK. 2014.

\label{orgebb594b}José Luis Fernandez-Marquez, Giovanna di Marzo Serugendo, Graeme Stevenson, Juan Ye, Simon Dobson, and Franco Zambonelli.  \emph{\href{https://simondobson.org/softcopy/SAC-PSC2014.pdf}{Self-Management of Self-Organising Mobile Computing Applications: A Separation of Concerns Approach}}. In \emph{Proceedings of the 29th ACM Symposium on Applied Computing}. Gyeongju, KR. 2014.

\label{orgae91fff}Chris Schneider, Adam Barker, and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/faults-ease-14.pdf}{Autonomous Fault Detection in Self-Healing Systems Using Restricted Boltzmann Machines}}. In \emph{Proceedings of the 11th IEEE International Conference and Workshops on Engineering of Autonomic and Autonomous Systems (EASe 2014)}. Laurel, MD. 2014.

\label{orgd55d2a2}Lei Fang and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/iwsos-faults-energy.pdf}{Unifying Sensor Fault Detection with Energy Conservation}}. In \emph{Proceedings of the 7th International Workshop on Self-Organising Systems (IWSOS’13)}. Palma de Mallorca, ES. May 2013.

\label{org499c957}Graeme Stevenson, Juan Ye, Simon Dobson, Danilo Pianini, Sara Montagna, and Mirko Viroli.  \emph{\href{https://simondobson.org/softcopy/sac-2013.pdf}{Combining Self-Organisation, Context-Awareness and Semantic Reasoning: The Case of Resource Discovery in Opportunistic Networks}}. In \emph{Proceedings of the 28th ACM Symposium on Applied Computing}. Coimbra, PT. 2013.

\label{orgd87e642}Lei Fang, Simon Dobson, and Danny Hughes.  \emph{\href{https://simondobson.org/softcopy/pewasun13.pdf}{An Error-Free Data Collection Method Exploiting Hierarchical Physical Models of Wireless Sensor Networks}}. In \emph{Proceedings of the Tenth ACM International Symposium on Performance Evaluation of Wireless Ad Hoc, Sensor, and Ubiquitous Networks}. ACM Press. Barcelona, ES. 2013.

\label{org2baa176}Abu Raihan M. Kamal, Chris Bleakley, and Simon Dobson.  \emph{\href{https://dx.doi.org//10.1145/2387027.2387043}{Congestion Mitigation Using in-Network Sensor Data Summarization}}. In \emph{Proceedings of the Ninth ACM International Symposium on Performance Evaluation of Wireless Ad Hoc, Sensor, and Ubiquitous Networks}, pp.93–100. Paphos, CY. 2012.

\label{org18edc28}Emil Vassev, Mike Hinchey, Dharini Balasubramaniam, and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/assl-sew11.pdf}{An ASSL Approach to Handling Uncertainty in Self-Adaptive Systems}}. In \emph{Proceedings of the 34th IEEE Software Engineering Workshop}. IEEE Press. Limerick, IE. 2011.

\label{org2791c2f}Emerson Loureiro, Paddy Nixon, and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/pdp-10.pdf}{Adaptive Management of Shared Resource Pools with Decentralized Optimization and Epidemics}}. In \emph{Proceedings of the 18th Euromicro Conference on Parallel, Distributed and Network-Based Processing}, pp.51–58. Marco Danelutto, Julien Borgeois, and Tom Gross, editors. IEEE Computer Society Press. Pisa, IT. 2010.

\label{org9d58e67}Adrian K. Clear, Ross Shannon, Thomas Holland, Aaron Quigley, Simon Dobson, and Paddy Nixon.  \emph{\href{https://simondobson.org/softcopy/situvis-pervasive-09.pdf}{Situvis: A Visual Tool for Modeling a User’s Behaviour Patterns in a Pervasive Environment}}. In \emph{Proceedings of the 7th International Conference on Pervasive Computing}. Nara, JP. May 2009.

\label{org1df4290}Juan Ye, Lorcan Coyle, Simon Dobson, and Paddy Nixon.  \emph{\href{https://simondobson.org/softcopy/percom2009.pdf}{Using Situation Lattices in Sensor Analysis}}. In \emph{Proceedings of the 7th IEEE International Conference on Pervasive Computing and Communications (Percom 2009)}, pp.1–11. Galveston, TX. 2009.

\label{orgc71eb53}Susan McKeever, Juan Ye, Lorcan Coyle, and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/ds-situation-inference-eurossc-09.pdf}{Using Dempster-Shafer Theory of Evidence for Situation Inference}}. In \emph{Proceedings of the 4th European Conference on Smart Sensing and Context (EuroSSC)}. Volume 5741 of LNCS. Springer-Verlag. Guildford, UK. 2009.

\label{orgedb8b03}Hui Zhang, Paddy Nixon, and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/wimob-09.pdf}{Partial Coverage in Homological Sensor Networks}}. In \emph{Proceedings of the 5th IEEE International Conference on Wireless and Mobile Computing, Networking and Communications (WiMOB 2009)}, pp.42–47. IEEE Press. Marrakech, MA. 2009.

\label{org477b933}Emerson Loureiro, Paddy Nixon, and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/incos-09.pdf}{Decentralized Utility Maximization for Adaptive Management of Shared Resource Pools}}. In \emph{Proceedings of the International Conference on Intelligent Networking and Collaborative Systems (INCoS’09)}. IEEE Computer Society. Barcelona, ES. 2009.

\label{orge640491}Davide Cellai, Graham Williamson, Simon Dobson, and Paddy Nixon.  \emph{\href{https://simondobson.org/softcopy/iwsos-09.pdf}{Self-Management of Routing on Human Proximity Networks}}. In \emph{Self-Organising Systems}, pp.1–12. Thrasyvoulos Spyropoulos and Karin Anna Hummel, editors. Volume 5918 of LNCS. Springer-Verlag. Zurich, CH. 2009.

\label{org743f469}Juan Ye and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/SMC2009.pdf}{Human-Behaviour Study with Situation Lattices}}. In \emph{Proceedings of the IEEE International Conference on Systems, Man and Cybernetics}. San Antonio, TX. 2009.

\label{orgfdfa92c}Simon Dobson, Lorcan Coyle, G.M.P. O’Hare, and Mike Hinchey.  \emph{\href{https://simondobson.org/softcopy/well-founded-control.pdf}{From Physical Models to Well-Founded Control}}. In \emph{Proceedings of the 6th IEEE International Conference and Workshops on Engineering of Autonomic and Autonomous Systems}. IEEE Press. San Francisco, ca. 2009.

\label{org1c9aa94}Susan McKeever, Juan Ye, Lorcan Coyle, and Simon Dobson.  \emph{A Context Quality Model to Support Transparent Reasoning with Uncertain Context}. In \emph{Quality of Context}. K. Rothermal, D. Fritsch, W. Blochinger, and F. Dürr, editors. Volume 5786 of LNCS. Springer Verlag. Stuttgart, de. 2009.

\label{org6532e18}Juan Ye, Susan McKeever, Lorcan Coyle, Steve Neely, and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/icps-08.pdf}{Resolving Uncertainty in Context Integration and Abstraction}}. In \emph{Proceedings of the 5th International Conference on Pervasive Services}, pp.131–140. Domenico Cotroneo and Julie McCann, editors. ACM Press. Sorrento, IT. 2008.

\label{org83c9b5b}Emerson Loureiro, Paddy Nixon, and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/iwsos-08.pdf}{A Fine-Grained Model for Adaptive on-Demand Provisioning of CPU Shares in Data Centres}}. In \emph{Self-Organizing Systems}, pp.97–108. Karin Anna Hummel and James Sterbenz, editors. Volume 5343 of LNCS. Springer Verlag. Vienna, at. 2008.

\label{org8b52a53}Hui Zhang, Paddy Nixon, and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/iccs-08.pdf}{Multi-Criteria Adaptation Mechanisms in Homological Sensor Networks}}. In \emph{Proceedings of the 11th IEEE International Conference on Communciations Systems}. IEEE Press. Guangzhou, CN. 2008.

\label{orge6172ac}M.A. Razzaque, Simon Dobson, and Paddy Nixon.  \emph{\href{https://simondobson.org/softcopy/clsr-08.pdf}{Cross-Layer Self Routing: A Self-Managed Routing Approach for MANETs}}. In \emph{Proceedings of the 4th IEEE International Conference on Wireless and Mobile Computing, Networking and Communications}. IEEE Press. Avignon, FR. 2008.

\label{orgdb8407e}Kieran Delaney, Simon Dobson, and John Barton.  \emph{Collaborative Smart Objects and Augmented Materials}. In \emph{Proceedings of the Sensors and Systems Symposium at the NSTI Nanotechnology Conference (Nanotech 2007)}. Santa Clara, ca. May 2007.

\label{org1a80660}Simon Dobson and Paddy Nixon.  \emph{\href{https://simondobson.org/softcopy/sesami-07.pdf}{Whole-System Programming of Adaptive Ambient Intelligence}}. In \emph{Proceedings of HCI International 2007}, pp.73–81. Volume 4555 of LNCS. Springer-Verlag. Beijing, CN. 2007.

\label{org96d457b}Adrian K. Clear, Simon Dobson, and Paddy Nixon.  \emph{\href{https://simondobson.org/softcopy/smc-07.pdf}{An Approach to Dealing with Uncertainty in Context-Aware Pervasive Systems}}. In \emph{Proceedings of the UK/IE IEEE SMC Cybernetic Systems Conference 2007}. IEEE Press. Dublin, IE. 2007.

\label{org4119f3d}Juan Ye, Lorcan Coyle, Simon Dobson, and Paddy Nixon.  \emph{\href{https://simondobson.org/softcopy/loca-07.pdf}{A Unified Semantics Space Model}}. In \emph{Location- and Context-Awareness}, pp.103–120. Volume 4718 of LNCS. 2007.

\label{orgba11bbe}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/composition-tfaas-06.pdf}{Achieving an Acceptable Design Model for Autonomic Systems}}. In \emph{Proceedings of the 4th IEEE International Workshop on Engineering Autonomic and Autonomous Systems}, pp.196–202. IEEE Press. Tucson, AZ. 2007. Reprinted in AS Letters, October/November 2006.

\label{orge98aaff}Simon Dobson, Eoin Bailey, Stephen Knox, Ross Shannon, and Aaron Quigley.  \emph{\href{https://simondobson.org/softcopy/iceccs2007.pdf}{A First Approach to the Closed-Form Specification and Analysis of an Autonomic Control System}}. In \emph{Proceedings of the 12th IEEE International Conference on Engineering Complex Computer Systems}. Auckland, NZ. 2007.

\label{org168b705}Graeme Stevenson, Paddy Nixon, and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/WAC-05.pdf}{Towards a Reliable Wide-Area Infrastructure for Context-Based Self-Management of Communications}}. In \emph{Autonomic Communication: 2nd International IFIP Workshop on Autonomic Communication}, pp.115–128. Ioannis Stavrakakis and Mikhail Smirnov, editors. Volume 3854 of LNCS. Springer-Verlag. 2006.

\label{orgb5d4cd0}Eleanor O’Neill, David Lewis, Kris McGlinn, and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/dsvis-06.pdf}{Rapid User-Centred Evaluation for Context-Aware Systems}}. In \emph{Interactive Systems: Design, Specification, and Verification}. Gavin Doherty and Ann Blandford, editors. Volume 4323 of LNCS. Springer-Verlag. Dublin, IE. 2006.

\label{orgfc6c01d}M.A. Razzaque, Simon Dobson, and Paddy Nixon.  \emph{\href{https://simondobson.org/softcopy/WAC-06.pdf}{A Cross-Layer Architecture for Autonomic Communications}}. In \emph{Autonomic Networking}, pp.25–35. Dominique Gaïti, Guy Pujolle, Ehab Al-Shaer, Ken Calvert, Simon Dobson, Guy Leduc, and Olli Martikainen, editors. Volume 4195 of LNCS. Springer-Verlag. Paris, FR. 2006.

\label{orgf5ae30b}M.A. Razzaque, Paddy Nixon, and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/dictadcom-06.pdf}{Demonstrating the Feasibility of an Autonomic Communications-Targeted Cross-Layer Architecture}}. In \emph{Proceedings of the 14th International Conference on Advanced Computing and Communications}. Mangalore, in. 2006.

\label{orgb608b36}Lorcan Coyle, Steve Neely, Gaëtan Rey, Graeme Stevenson, Mark Sullivan, Simon Dobson, and Paddy Nixon.  \emph{\href{https://simondobson.org/softcopy/ICOST-06.pdf}{Sensor Fusion-Based Middleware for Assisted Living}}. In \emph{Smart Homes and beyond}, pp.281–288. Chris Nugent and Juan Carlos Augusto, editors. IOS Press. Belfast, UK. 2006.

\label{org09586e1}Simon Dobson.  \emph{Leveraging the Subtleties of Location}. In \emph{sOc-EUSAI’05: Proceedings of the 2005 Joint Conference on Smart Objects and Ambient Intelligence}, pp.175–179. Gérard Bailly, James Crowley, and Gilles Privat, editors. ACM Press. Grenoble, FR. 2005.

\label{org91e4792}Simon Dobson, Kieran Delaney, Kafil Mahmood Razeeb, and Sergey Tsvetkov.  \emph{\href{https://simondobson.org/softcopy/MATA-Augmented-05.pdf}{A Co-Designed Hardware/Software Architecture for Augmented Materials}}. In \emph{Proceedings of the 2nd International Workshop on Mobility Aware Technologies and Applications}. Thomas Magedanz, Ahmed Karmouch, Samuel Pierre, and Iakovos Venieris, editors. Volume 3744 of LNCS. Montréal, ca. 2005.

\label{orgdaf1e4e}Seán Baker and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/soa-doa-05.pdf}{Comparing Service-Oriented and Distributed Object Architectures}}. In \emph{Proceedings of the International Symposium on Distributed Objects and Applications}, pp.631–645. Robert Meersman and Zahir Tari, editors. Volume 3760 of LNCS. Springer Verlag. 2005.

\label{org7629611}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/WAC-04a.pdf}{Putting Meaning into the Network: Some Semantic Issues for the Design of Autonomic Communications Systems}}. In \emph{Proceedings of the 1st IFIP Workshop on Autonomic Communications}, pp.207–216. Mikhail Smirnov, editor. Volume 3457 of LNCS. Springer Verlag. Berlin, de. 2005.

\label{org7cead0e}Andy Nisbet and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/WAC-04b.pdf}{A Systems Architecture for Sensor Networks Based on Hardware/Software Co-Design}}. In \emph{Proceedings of the 1st IFIP Workshop on Autonomic Communications}. Mikhail Smirnov, editor. Volume 3457 of LNCS. Springer Verlag. Berlin, de. 2005.

\label{orgdaa793d}Simon Dobson and Paddy Nixon.  \emph{\href{https://simondobson.org/softcopy/EHCI-04.pdf}{More Principled Design of Pervasive Computing Systems}}. In \emph{Human Computer Interaction and Interactive Systems}. Rémi Bastide and Jörg Roth, editors. Volume 3425 of LNCS. Springer Verlag. 2004.

\label{org94a3eb1}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/ISICT-2003.pdf}{Applications Considered Harmful for Ambient Systems}}. In \emph{Proceedings of the ACM International Symposium on Information and Communications Technologies}, pp.171–176. ACM Press. Dublin, IE. 2003.

\label{org2406eec}Tim Walsh, Paddy Nixon, and Simon Dobson.  \emph{As Strong as Possible Agent Mobility}. In \emph{Infrastructure for Agents, Multi-Agent Systems, and Scalable Multi-Agent Systems}, pp.174–176. T. Wagner and O.F. Rana, editors. Volume 1887 of Lecture Notes in Artificial Intelligence. 2001.

\label{org44fb459}Paddy Nixon, Vinny Wade, Sotirios Terzis, Marcus O’Connell, and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/TCD-CS-2000-08.pdf}{The Virtues Architecture: A Software Infrastructure for Business-to-Business E-Commerce}}. In \emph{Proceedings of the 2nd International Conference on Enterprise Information Systems}. Stafford, UK. 2000.

\label{orgd184169}Simon Dobson and Brian Matthews.  \emph{\href{https://simondobson.org/softcopy/ions-ecoop-2000.ps}{Ionic Types}}. In \emph{ECOOP 2000 – Object-Oriented Programming}, pp.296–312. Elisa Bertoni, editor. Volume 1850 of LNCS. Springer-Verlag. 2000.

\label{org6f45b8b}Sotirios Terzis, Paddy Nixon, Vinny Wade, Simon Dobson, and John Fuller.  \emph{\href{https://simondobson.org/softcopy/TCD-CS-1999-22.pdf}{The Future of Enterprise Groupware Applications}}. In \emph{Proceedings of the 1st International Conference on Enterprise Information Systems}, pp.525–532. Joaquim Filipe and José Cordeiro, editors. Setubal, PT. 1999. Winner of best student paper award.

\label{org3a959ac}Simon Dobson, Paddy Nixon, Vincent Wade, Sotirios Terzis, and John Fuller.  \emph{\href{https://simondobson.org/softcopy/vanilla-gcse-1999.ps}{Vanilla: An Open Language Framework}}. In \emph{Generative and Component-Based Software Engineering}. Krzysztof Czarnecki and Ulrich Eisenecker, editors. Volume 1799 of LNCS. Springer-Verlag. 1999.

\label{org1852b20}Simon Dobson and Don Goodeve.  \emph{\href{https://simondobson.org/softcopy/irregular-97.pdf}{Programming with Shared Data Abstractions}}. In \emph{Solving Irregularly Structured Problems in Parallel}, pp.93–102. Gianfranco Billardi, Afonso Ferreira, Reinhold Lüling, and José Rolim, editors. Volume 1253 of LNCS. Springer Verlag. 1997.

\label{org688ca41}Simon Dobson and Chris Wadsworth.  \emph{\href{https://simondobson.org/softcopy/pdse-96.pdf}{Towards a Theory of Shared Data in Distributed Systems}}. In \emph{Software Engineering for Parallel and Distributed Systems}, pp.170–182. Innes Jelly, Ian Gorton, and Peter Croll, editors. Chapman and Hall. 1996.
