research/publications/index.html

<div id="outline-container-org558defa" class="outline-3">
<h3 id="org558defa">Minor conferences and&nbsp;workshops</h3>
<div class="outline-text-3" id="text-org558defa">
<p>
<a id="org83d432a"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/why-care-about-sheaves.pdf">Why You Should Care About Sheaves</a></i>. In <i>8th <span class="caps">UK</span> Systems Research Challenges Workshop</i>. Co Durham, <span class="caps">UK</span>.&nbsp;2024.
</p>

<p>
<a id="orgc520103"></a>Simon Dobson and Peter Mann.  <i><a href="https://simondobson.org/softcopy/uksystems-23.pdf">Moving a Scientific Computing System to the Cloud</a></i>. In <i>7th <span class="caps">UK</span> System Research Challenges Workshop</i>. Co Durham, <span class="caps">UK</span>.&nbsp;2023.
</p>

<p>
<a id="org7b12d9a"></a>Peter Mann, V. Anne Smith, John Mitchell, and Simon Dobson.  <i>A Population Model of Interacting <span class="caps">SARS</span>-CoV-2 Variants</i>. In <i>Proceedings of the <span class="caps">BIFI</span> International Conference on the Science of Covid-19: From Molecular Drug Design to Data-Driven Epidemiological Models</i>. Zaragoza, <span class="caps">ES</span>.&nbsp;2022.
</p>

<p>
<a id="orgfcac65e"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/stochastic-testing-21.pdf">Unit (and Other) Testing of Stochastic Code</a></i>. In <i>6th <span class="caps">UK</span> Systems Research Challenges Workshop</i>. Co Durham, <span class="caps">UK</span>.&nbsp;2021.
</p>

<p>
<a id="org289c33d"></a>Lei Fang, Xiaoli Liu, Xiang Su, Juan Ye, Simon Dobson, Pan Hui, and Sasu Tarkoma.  <i><a href="https://doi.org/10.1007/978-3-030-70569-5_8">Bayesian Inference Federated Learning for Heart Rate Prediction</a></i>. In <i>Mobihealth 2020: Wireless Mobile Communications and Healthcare</i>, pp.116–130. Volume 362 of Lecture Notes of the Institute for Computer Sciences, Social Informatics and Telecommunications Engineering. Springer.&nbsp;2021.
</p>

<p>
<a id="orgb9cc523"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/s4-uk-systems-19.pdf">Towards a Science of Sensor Systems Software</a></i>. In <i>5th <span class="caps">UK</span> Systems Research Challenges Workshop</i>. Co Durham, <span class="caps">UK</span>.&nbsp;2019.
</p>

<p>
<a id="orgc97634a"></a>Lennert Voogt, Lisa Dow, and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/open-badges-best-practice-16.pdf">Open Badges: A Best-Practice Framework</a></i>. In <i>Proceedings of the <span class="caps">SAI</span> Computing Conference</i>. London, <span class="caps">UK</span>.&nbsp;2016.
</p>

<p>
<a id="orgee9ab45"></a>Simon Dobson, Saray Shai, Emanuele Strano, and Marc Barthélemy.  <i><a href="https://simondobson.org/softcopy/urban-networks-sicsa.pdf">Multiplex Cities: Interacting Transport Networks in Metropolitan Areas</a></i>. 2015. Presented at the <span class="caps">SICSA</span> Workshop on Modelling and Optimisation of Real-World&nbsp;Transportation.
</p>

<p>
<a id="orgb56fcce"></a>Juan Ye, Graeme Stevenson, and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/comorea-15.pdf">Using Temporal Correlation and Time Series to Detect Missing Activity-Driven Sensor Events</a></i>. In <i>Proceedings of the 11th Workshop on Context and Activity Modelling and Recognition (CoMoRea’15)</i>. St Louis, <span class="caps">MO</span>.&nbsp;2015.
</p>

<p>
<a id="orga0567ac"></a>Chris Schneider, Adam Barker, and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/adapt14.pdf">Autonomous Fault Detection in Self-Healing Systems: Comparing Hidden Markov Models and Artificial Neural Networks</a></i>. In <i>Proceedings of the 4th International Workshop on Adaptive Self-Tuning Computing Systems (<span class="caps">ADAPT</span>-2014)</i>. Vienna, at.&nbsp;2014.
</p>

<p>
<a id="org094b384"></a>Graeme Stevenson, Gabriella Castelli, Juan Ye, Alberto Rossi, Simon Dobson, and Franco Zambonelli.  <i><a href="https://simondobson.org/softcopy/sensemine13.pdf">A Bio-Chemically Inspired Approach to Awareness in Pervasive Systems</a></i>. In <i>Proceedings of First International Workshop on Sensing and Big Data Mining (SenseMine 2013)</i>. Rome, <span class="caps">IT</span>.&nbsp;2013.
</p>

<p>
<a id="org9bd3cef"></a>Simon Dobson, Alan Dearle, and Barry Porter.  <i><a href="https://simondobson.org/softcopy/places-2013-final.pdf">Minimising Virtual Machine Support for Concurrency</a></i>. In <i>Proceedings of 5th <span class="caps">ETAPS</span> Workshop on Programming Language Approaches to Concurrency and Communication-cEntric Software (<span class="caps">PLACES</span>’13)</i>. Rome, <span class="caps">IT</span>.&nbsp;2013.
</p>

<p>
<a id="org7884b8a"></a>Graeme Stevenson, Jose Luis Fernandez-Marquez, Sara Montagna, Alberto Rosi, Giovanna di Marzo Serugendo Juan Ye, Mirko Viroli, Simon Dobson, and Akla-Esso Tchao.  <i><a href="https://simondobson.org/softcopy/asensis-12-urban.pdf">Towards Situated Awareness in Urban Networks: A Bio-Inspired Approach</a></i>. In <i>Proceedings of the First International Workshop on Adaptive Service Ecosystems: Nature and Socially Inspired Solutions (<span class="caps">ASENSIS</span>’12)</i>, pp.53–58. Lyons, <span class="caps">FR</span>.&nbsp;2012.
</p>

<p>
<a id="org3676622"></a>Graeme Stevenson, Mirko Viroli, Juan Ye, Sara Montagna, and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/asensis-12-discovery.pdf">Self-Organising Semantic Resource Discovery for Pervasive Systems</a></i>. In <i>Proceedings of the First International Workshop on Adaptive Service Ecosystems: Nature and Socially Inspired Solutions (<span class="caps">ASENSIS</span>’12)</i>, pp.47–52. Lyons, <span class="caps">FR</span>.&nbsp;2012.
</p>

<p>
<a id="org8affd20"></a>Barry Porter, Alan Dearle, and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/midsens12.pdf">From Missions to Systems: Generating Transparently-Distributable Programs for Sensor-Oriented Systems</a></i>. In <i>Proceedings of the Seventh International Workshop on Middleware Tools, Services and Run-Time Support for Sensor Networks (MidSens’12)</i>, pp.1–6. Montreal ca.&nbsp;2012.
</p>

<p>
<a id="org207e902"></a>Jose Luis Fernandez-Marquez, Graeme Stevenson, Akla-Esso Tchao, Juan Ye, Giovanna di Marzo Serugendo, and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/asensis-12-gradients.pdf">Analysis of New Gradient Based Aggregation Algorithms for Data-Propagation in Distributed Networks</a></i>. In <i>Proceedings of the First International Workshop on Adaptive Service Ecosystems: Nature and Socially Inspired Solutions (<span class="caps">ASENSIS</span>’12)</i>. Lyons, <span class="caps">FR</span>.&nbsp;2012.
</p>

<p>
<a id="org79a06fa"></a>Juan Ye, Graeme Stevenson, Simon Dobson, Michael O’Grady, and Gregory O’Hare.  <i><a href="https://simondobson.org/softcopy/pi-11.pdf">\(<span class="caps">PI</span>\): Perceiver and Interpreter of Smart Home Datasets</a></i>. In <i>Proceedings of the 5th International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth 2011)</i>, pp.131–138. Dublin, <span class="caps">IE</span>. May 2011. Nominated for best paper&nbsp;award.
</p>

<p>
<a id="org81f225f"></a>Alberto Rosi, Simon Dobson, Marco Mamei, Graeme Stevenson, Juan Ye, and Franco Zambonelli.  <i><a href="https://simondobson.org/softcopy/social-sensing-11.pdf">Social Sensors and Pervasive Services: Approaches and Perspectives</a></i>. In <i>Proceedings of the Second <span class="caps">IEEE</span> Workshop on Pervasive Collaboration and Social Networking (PerCol 2011)</i>, pp.252–530. <span class="caps">IEEE</span> Press. Seattle, <span class="caps">WA</span>.&nbsp;2011.
</p>

<p>
<a id="org1c2c467"></a>Graeme Stevenson and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/sapphire-odise11.pdf">Sapphire: Generating Java Runtime Artefacts from <span class="caps">OWL</span> Ontologies</a></i>. In <i>Proceedings of the 3rd International Workshop on Ontology-Driven Information Systems Engineering (<span class="caps">ODISE</span> 2011)</i>, pp.425–236. London, <span class="caps">UK</span>.&nbsp;2011.
</p>

<p>
<a id="orge17dd7c"></a>Graeme Stevenson, Juan Ye, and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/temporal-features-pmmps10.pdf">On the Impact of the Temporal Features of Sensed Data on the Development of Pervasive Systems</a></i>. In <i>Proceedings of the International Workshop on Programming Methods for Mobile and Pervasive Systems at <span class="caps">PERVASIVE</span> 2010</i>. Helsinki, <span class="caps">FI</span>. May&nbsp;2010.
</p>

<p>
<a id="org8bdd889"></a>Juan Ye, Lorcan Coyle, Susan McKeever, and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/diffuse-boundaries-2010.pdf">Dealing with Activities with Diffuse Boundaries</a></i>. In <i>Proceedings of the Workshop on How to Do Good Activity Recognition Research: Experimental Methodologies, Evaluation Metrics and Reproducility Issues at <span class="caps">PERVASIVE</span> 2010</i>. Helsinki, <span class="caps">FI</span>. May&nbsp;2010.
</p>

<p>
<a id="orgb95ba5a"></a>Stephen Knox, Lorcan Coyle, and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/2010flairs.pdf">Using Ontologies in Case-Based Activity Recognition</a></i>. In <i>Proceedings of the 23rd International Conference of the Florida Artificial Intelligence Research Society (<span class="caps">FLAIRS</span>-23)</i>. Daytona Beach, <span class="caps">FL</span>. May&nbsp;2010.
</p>

<p>
<a id="org89599a2"></a>Michael O’Grady, Juan Ye, <span class="caps">G.M.P.</span> O’Hare, Simon Dobson, Richard Tynan, and Connor Muldoon.  <i><a href="https://simondobson.org/softcopy/implicit-interaction-10.pdf">A Middleware for Implicit Interaction</a></i>. In <i>Proceedings of the International Workshop on Instinctive Computing</i>. Volume 5897 of Lecture Notes in Artificial Intelligence. Springer Verlag. Pittsburgh, <span class="caps">PA</span>.&nbsp;2010.
</p>

<p>
<a id="orga49b6cf"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/euro-nf-09.pdf">Integrating Sensor Networks into the Future Internet (Extended Abstract)</a></i>. In <i>Proceedings of the 2nd Euro-<span class="caps">NF</span> Workshop on Future Internet Architectures</i>. Santander, <span class="caps">ES</span>.&nbsp;2009.
</p>

<p>
<a id="org9d53efd"></a>Juan Ye, Adrian K. Clear, Lorcan Coyle, and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/aics2009.pdf">On Using Temporal Semantics to Create More Accurate Human-Activity Classifiers</a></i>. In <i>Artificial Intelligence and Cognitive Science</i>. Lorcan Coyle and Jill Freyne, editors. Volume 6206 of <span class="caps">LNCS</span>. Springer-Verlag.&nbsp;2009.
</p>

<p>
<a id="org7bb87b3"></a>Josu Martinez and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/fresh-icsoft09.pdf">Functionality Recomposition for Self-Healing</a></i>. In <i>Proceedings of the 4th International Conference on Software and Data Technologies</i>. Sofia, <span class="caps">BG</span>.&nbsp;2009.
</p>

<p>
<a id="orga0a2b85"></a><span class="caps">M.A.</span> Razzaque and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/adhoc-09.pdf">Enhancement of Self-Organisation in Wireless Networking through a Cross-Layer Approach</a></i>. In <i>Proceedings of the 1st International Conference on Ad Hoc Networks</i>. Niagara Falls, ca.&nbsp;2009.
</p>

<p>
<a id="org0761b8f"></a>Matthew Stabeler, Davide Cellai, Paddy Nixon, and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/edtn-09.pdf">Delay Tolerant Networks and Spatially Detailed Human Mobility</a></i>. In <i>Proceedings of the Workshop on the Emergence of Delay- and Disruption-Tolerant Networks</i>. St Petersburg, <span class="caps">RU</span>.&nbsp;2009.
</p>

<p>
<a id="orgb26aaba"></a>Lorcan Coyle, Juan Ye, Susan McKeever, Stephen Knox, Matthew Stabeler, Simon Dobson, and Paddy Nixon.  <i><a href="https://simondobson.org/softcopy/2008datasets-08.pdf">Gathering Datasets for Activity Identification</a></i>. In <i>Proceedings of the Workshop on Developing Shared Home Behaviour Datasets to Advance <span class="caps">HCI</span> and Ubiquitous Computing Research at <span class="caps">CHI</span> 2009</i>. Boston, <span class="caps">MA</span>.&nbsp;2009.
</p>

<p>
<a id="org5ba2796"></a>Graham Williamson, Davide Cellai, Simon Dobson, and Paddy Nixon.  <i><a href="https://simondobson.org/softcopy/uksim-09.pdf">Modelling Periodic Data Dissemination in Wireless Sensor Networks</a></i>. In <i>Proceedings of the 3rd UKSim European Symposium on Computer Modelling and Simulation</i>. <span class="caps">IEEE</span> Press.&nbsp;2009.
</p>

<p>
<a id="orgf5eafde"></a>Matthew Stabeler, Graeme Stevenson, Simon Dobson, and Paddy Nixon.  <i>Basadaeir: Harvesting User Profiles to Bootstrap Pervasive Applications</i>. In <i>Late-Breaking Results: Adjunct Proceedings of the 7th International Conference on Pervasive Computing (<span class="caps">PERVASIVE</span> 2009)</i>.&nbsp;2009.
</p>

<p>
<a id="orge1bed52"></a>Eleanor O’Neill, Kris McGlinn, Eoin Bailey, Simon Dobson, and Kevin McCarthy.  <i><a href="https://simondobson.org/softcopy/iwcams-09.pdf">Application Development Using Modelling and Dynamical Systems Analysis</a></i>. In <i>Proceedings of the 1st International Workshop on Context-Aware Middleware and Services</i>, pp.18–23. Dublin, <span class="caps">IE</span>.&nbsp;2009.
</p>

<p>
<a id="org5d64e96"></a>Graeme Stevenson, Stephen Knox, Simon Dobson, and Paddy Nixon.  <i><a href="https://simondobson.org/softcopy/ontonym-ciao2009.pdf"><span class="caps">ONTONYM</span>: A Collection of Upper Ontologies for Pervasive Application Development</a></i>. In <i>Proceedings of the Workshop on Context, Information and Ontologies Ontology (<span class="caps">CIAO</span>’09)</i>. Heraklion, <span class="caps">GR</span>.&nbsp;2009.
</p>

<p>
<a id="org7dbb3b2"></a>Susan McKeever, Juan Ye, Lorcan Coyle, and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/multilayered-uncertainty-08.pdf">A Multilayered Uncertainty Approach for Context-Aware Systems</a></i>. In <i>Late-Breaking Results: Adjunct Proceedings of the 6th International Conference on Pervasive Computing (<span class="caps">PERVASIVE</span> 2008)</i>, pp.1–4. Sidney, <span class="caps">AU</span>.&nbsp;2008.
</p>

<p>
<a id="org8aee3ad"></a>Michael Collins, Paddy Nixon, and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/msecurity-ubicom08.pdf">A Secure Lightweight Architecture for Wireless Sensor Networks</a></i>. In <i>Proceedings of the Second International Conference on Mobile Ubiquitous Computing, Systems, Services and Technologies (<span class="caps">UBICOMM</span>’08)</i>. Valencia, <span class="caps">ES</span>. 2008. Winner of Joint Best Paper&nbsp;Award.
</p>

<p>
<a id="orgbc39e06"></a>Olga Murdoch, Lorcan Coyle, and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/Murdoch2008Ontology.pdf">Ontology-Based Query Recommendation as a Support to Image Retrieval</a></i>. In <i>Proceedings of the 19th Irish Conference in Artificial Intelligence and Cognitive Science</i>. Cork, <span class="caps">IE</span>.&nbsp;2008.
</p>

<p>
<a id="org0130c6b"></a>Simon Dobson and Paddy Nixon.  <i><a href="https://simondobson.org/softcopy/hotac-08.pdf">Stable Autonomic Adaptation: A Grand Challenge</a></i>. In <i>Proceedings of the Third <span class="caps">IEEE</span> Workshop on Hot Topics for Autonomic Computing (HotAC’08)</i>. Chicago <span class="caps">IL</span>.&nbsp;2008.
</p>

<p>
<a id="orgd483f6d"></a>Adrian K. Clear, Ross Shannon, Thomas Holland, Simon Dobson, Aaron Quigley, and Paddy Nixon.  <i><a href="https://simondobson.org/softcopy/situvis.pdf">Situvis: Visualising Multivariate Context Information to Evaluate Situation Specifications</a></i>. In <i>Proceedings of the 2nd International Workshop on Ubiquitous Systems Evaluation (<span class="caps">USE</span> 2008)</i>. Seoul, <span class="caps">KR</span>.&nbsp;2008.
</p>

<p>
<a id="orgd553b1b"></a>Simon Dobson.  <i>From Adaptive Systems to Adaptive Spaces</i>. In <i>Resilient and Survivable Networks, Infrastructure and Services</i>. Schloß Dagstuhl.&nbsp;2008.
</p>

<p>
<a id="org4ef83e1"></a>Michael Collins, Simon Dobson, and Paddy Nixon.  <i>Identifying and Isolating Aberrant Nodes in Wireless Sensor Networks</i>. In <i>Proceedings of the 3rd International Conference for Internet Technologies and Secured Transactions</i>. Dublin, <span class="caps">IE</span>. 2008. Winner of best paper&nbsp;award.
</p>

<p>
<a id="orgbdbc433"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/semantics-wg-ease-08.pdf">Facilitating a Well-Founded Approach to Autonomic Systems</a></i>. In <i>Proceedings of the 5th <span class="caps">IEEE</span> Workshop on the Engineering of Autonomic and Autonomous Systems (EASe 2008)</i>. <span class="caps">IEEE</span> Press. Belfast, <span class="caps">UK</span>.&nbsp;2008.
</p>

<p>
<a id="org615f548"></a>Steve Neely, Graham Williamson, Hui Zhang, Graeme Stevenson, and Simon Dobson.  <i>Location Detection with Smart Zigbee Sensors</i>. 2007. 2nd Workshop on Wireless Sensor Networks Research in Ireland (WiSEN&nbsp;2007).
</p>

<p>
<a id="org3cab237"></a>Stephen Knox, Adrian K. Clear, Ross Shannon, Lorcan Coyle, Simon Dobson, Aaron Quigley, and Paddy Nixon.  <i><a href="https://simondobson.org/softcopy/mrc-scatterbox-07.pdf">Towards Scatterbox: A Context-Aware Message Forwarding Platform</a></i>. In <i>Proceedings of the Fourth International Workshop Modeling and Reasoning in Context (<span class="caps">MRC</span> 2007)</i>. Copenhagen, <span class="caps">DK</span>.&nbsp;2007.
</p>

<p>
<a id="org23fccb0"></a>Juan Ye, Lorcan Coyle, Simon Dobson, and Paddy Nixon.  <i><a href="https://simondobson.org/softcopy/mrc-lattices-07.pdf">Using Situation Lattices to Model and Reason About Context</a></i>. In <i>Proceedings of the Fourth International Workshop Modeling and Reasoning in Context (<span class="caps">MRC</span> 2007)</i>. Copenhagen, <span class="caps">DK</span>.&nbsp;2007.
</p>

<p>
<a id="org87ba81f"></a>Lorcan Coyle, Juan Ye, Emerson Loureiro, Stephen Knox, Simon Dobson, and Paddy Nixon.  <i><a href="https://simondobson.org/softcopy/use07.pdf">A Proposed Approach to Evaluate the Accuracy of Tag-Based Location Systems</a></i>. In <i>Proceedings of the First Workshop on Ubiquitous Systems Evaluation at Ubicomp’07</i>.&nbsp;2007.
</p>

<p>
<a id="orgd0d69af"></a><span class="caps">M.A.</span> Razzaque, Simon Dobson, and Paddy Nixon.  <i><a href="https://simondobson.org/softcopy/wiman-07.pdf">Context Awareness through Cross-Layer Network Architecture</a></i>. In <i>Proceedings of the First International Workshop on Wireless Mesh and Ad Hoc Networks</i>. Honolulu, <span class="caps">HI</span>.&nbsp;2007.
</p>

<p>
<a id="orgb4dce6e"></a>Simon Dobson, Paddy Nixon, Lorcan Coyle, Steve Neely, Graeme Stevenson, and Graham Williamson.  <i><a href="https://simondobson.org/softcopy/ccnc-07.pdf">Construct: An Open Source Pervasive Systems Platform</a></i>. In <i>Proceedings of the 4th <span class="caps">IEEE</span> Consumer Communciations and Networking Conference</i>, pp.1203–1204. <span class="caps">IEEE</span> Press. Las Vegas, <span class="caps">NV</span>.&nbsp;2007.
</p>

<p>
<a id="org960541d"></a>Michael Collins, Simon Dobson, and Paddy Nixon.  <i><a href="https://simondobson.org/softcopy/ptiiai-06.pdf">Security Issues with Pervasive Computing Frameworks</a></i>. In <i>Pervasive 2006 Workshop Proceedings</i>, pp.679–685. Thomas Strang, Vinny Cahill, and Aaron Quigley, editors. Springer Verlag. Dublin, <span class="caps">IE</span>. 2006. Workshop on Privacy, Trust and Identity Issues for Ambient&nbsp;Intelligence.
</p>

<p>
<a id="org9437601"></a>Adrian K. Clear, Stephen Knox, Juan Ye, Lorcan Coyle, Simon Dobson, and Paddy Nixon.  <i><a href="https://simondobson.org/softcopy/co-2006.pdf">Integrating Multiple Contexts and Ontologies in a Pervasive Computing Framework</a></i>. In <i>Contexts and Ontologies: Theory, Practice and Applications</i>. Riva Del Garda, <span class="caps">IT</span>.&nbsp;2006.
</p>

<p>
<a id="org29075f7"></a>Simon Dobson and Juan Ye.  <i><a href="https://simondobson.org/softcopy/tppc-06.pdf">Using Fibrations for Situation Identification</a></i>. In <i>Pervasive 2006 Workshop Proceedings</i>, pp.645–651. Thomas Strang, Vinny Cahill, and Aaron Quigley, editors. Springer Verlag. Dublin, <span class="caps">IE</span>. 2006. Workshop on Combining Theory and&nbsp;System-Building.
</p>

<p>
<a id="orgc0c9c56"></a>Graham Williamson, Graeme Stevenson, Steve Neely, Simon Dobson, and Paddy Nixon.  <i><a href="https://simondobson.org/softcopy/eurossc-evaluation-06.pdf">An Evaluation Framework for Disseminating Context Information with Gossiping</a></i>. In <i>Proceedings of the 1st European Conference on Smart Sensing and Context</i>. Volume 4272 of <span class="caps">LNCS</span>.&nbsp;2006.
</p>

<p>
<a id="org09e3770"></a>Syarulnaziah Anawar, Lorcan Coyle, Simon Dobson, and Paddy Nixon.  <i><a href="https://simondobson.org/softcopy/eurossc-delivery-06.pdf">Context Delivery in Ad Hoc Networks Using Enhanced Gossiping Algorithms</a></i>. In <i>Proceedings of the 1st European Conference on Smart Sensing and Context</i>. Volume 4272 of <span class="caps">LNCS</span>.&nbsp;2006.
</p>

<p>
<a id="orgde2f6f1"></a>Lorcan Coyle, Evelyn Baife, Graeme Stevenson, Steve Neely, Simon Dobson, Paddy Nixon, and Barry Smyth.  <i><a href="https://simondobson.org/softcopy/eccbr-06.pdf">Supplementing Case-Based Recommenders with Context Data</a></i>. In <i>Proceedings of the 1st International Workshop on Case-Based Reasoning and Context-Awareness at <span class="caps">ECCBR</span>’06</i>. Ölüdeniz, <span class="caps">TK</span>.&nbsp;2006.
</p>

<p>
<a id="orgc935522"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/ijcai-aiac-05b.pdf">Hybridising Events and Knowledge in an Infrastructure for Context-Adaptive Systems</a></i>. In <i>Proceedings of the <span class="caps">IJCAI</span> 2005 Workshop on <span class="caps">AI</span> and Autonomic Communications</i>. Roy Sterrit, Simon Dobson, and Mikhail Smirnov, editors.&nbsp;2005.
</p>

<p>
<a id="org027ff65"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/de-bruijn-iafl-05.pdf">The de Bruijn Principle and the Compositional Design of Programming Languages</a></i>. In <i>Proceedings of the 17th International Workshop on Implementation and Application of Functional Languages</i>.&nbsp;2005.
</p>

<p>
<a id="orga4bcbba"></a>Graeme Stevenson, Lorcan Coyle, Steve Neely, Simon Dobson, and Paddy Nixon.  <i>Construct – a Decentralised Context Infrastructure for Computing Environments</i>. 2005. <span class="caps">IT</span>&amp;T Annual&nbsp;Conference.
</p>

<p>
<a id="org5bfd59c"></a><span class="caps">M.A.</span> Razzaque, Simon Dobson, and Paddy Nixon.  <i><a href="https://simondobson.org/softcopy/ijcai-aiac-05a.pdf">Categorisation and Modelling of Quality in Context Information</a></i>. In <i>Proceedings of the <span class="caps">IJCAI</span> 2005 Workshop on <span class="caps">AI</span> and Autonomic Communications</i>. Roy Sterrit, Simon Dobson, and Mikhail Smirnov, editors.&nbsp;2005.
</p>

<p>
<a id="orgbb03919"></a>Kieran Delaney, Simon Dobson, Kafil Mahmood Razeeb, and John Barton.  <i>Creating the Disappearing Computer – Using Augmented Materials to Build Collaborative Augmented Artefacts</i>. 2005. <span class="caps">IT</span>&amp;T Annual&nbsp;Conference.
</p>

<p>
<a id="orge8ed990"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/ERLS-04.pdf">Creating Programming Languages for (and from) the Internet</a></i>. In <i>Workshop on Evolution and Reuse of Language Specifications for Domain-Specific Languages at <span class="caps">ECOOP</span>’04</i>. Oslo, <span class="caps">NO</span>.&nbsp;2004.
</p>

<p>
<a id="org46e98f3"></a>Paddy Nixon, Simon Dobson, Sotirios Terzis, and Feng Wang.  <i><a href="https://simondobson.org/softcopy/IWNA-2003.pdf">Architectural Implications for Context-Adaptive Smart Spaces</a></i>. In <i>Proceedings of the International Workshop on Networked Applicances</i>, pp.156–161. <span class="caps">IEEE</span> Press.&nbsp;2003.
</p>

<p>
<a id="org24987bf"></a>Paddy Nixon, Feng Wang, Sotirios Terzis, and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/ecoose-2003.pdf">Engineering Context-Aware Systems</a></i>. In <i>Proceedings of the International Workshop on Engineering Context-Aware Object-Oriented Systems and Environments</i>. Seattle, <span class="caps">WA</span>.&nbsp;2002.
</p>

<p>
<a id="orgd258e66"></a>Sotirios Terzis, Paddy Nixon, Vinny Wade, Simon Dobson, and John Fuller.  <i>Building the next Generation of Groupware</i>. In <i>Enterprise Information Systems</i>. Joaquim Filipe, editor. Kluwer Academic Press.&nbsp;2001.
</p>

<p>
<a id="orgc3a66fe"></a>Tim Walsh, Paddy Nixon, and Simon Dobson.  <i>An Integrated System for Managing Intelligent Buildings</i>. In <i>Managing Interactions in Smart Environments</i>. Paddy Nixon, Gerard Lacey, and Simon Dobson, editors. Springer Verlag.&nbsp;2000.
</p>

<p>
<a id="org50156ba"></a>Richard Greenane and Simon Dobson.  <i>Integrating LONWorks into an Open Systems Control Environment</i>. 1999. Presented at the LONWorks’99 trade&nbsp;conference.
</p>

<p>
<a id="org1264dfd"></a>Paddy Nixon, Vinny Wade, Simon Dobson, John Fuller, and Sotirios Terzis.  <i><a href="https://simondobson.org/softcopy/virtues-ocve-1998.pdf">Designing Components for a Virtual Organisation: A Case Study</a></i>. In <i>Proceedings of Objects, Components and the Virtual Enterprise</i>. Vancouver, ca.&nbsp;1998.
</p>

<p>
<a id="org5dd635e"></a>Simon Dobson and Paddy Nixon.  <i>(Free) Radical Programming Languages</i>. In <i>Proceedings of the 5th CaberNet Radicals Workshop</i>. Oporto, <span class="caps">PT</span>.&nbsp;1998.
</p>

<p>
<a id="org6a289e2"></a>Simon Dobson and Victoria Burrill.  <i><a href="https://simondobson.org/softcopy/lightweight-databases-bcs-1995.pdf">Towards Improving Automation in the World Wide Web</a></i>. In <i>New Directions in Software Development</i>. British Computer Society.&nbsp;1995.
</p>

<p>
<a id="orgb5288b1"></a>Simon Dobson and Andy Wellings.  <i><a href="https://simondobson.org/softcopy/scalable-parallel-applications-92.pdf">A System for Building Scalable Parallel Applications</a></i>. In <i>Programming Environments for Parallel Computing</i>, pp.218–230. Nigel Topham, Roland Ibbett, and Thomas Bemmerl, editors. North Holland Elsevier.&nbsp;1992.
</p>

<p>
<a id="org89132fa"></a>Simon Dobson and Andy Wellings.  <i>Programming Highly Parallel General-Purpose Applications</i>. In <i>Proceedings of the First <span class="caps">BCS</span> Workshop on Abstract Machine Models for Highly Parallel Computing</i>. University of Leeds.&nbsp;1991.
</p>
</div>
</div>
