pages/research/publications.tex

\subsection{Minor conferences and workshops}
\label{sec:orgd79ad70}

\label{orgd299cac}Simon Dobson and Peter Mann.  \emph{\href{https://simondobson.org/softcopy/uksystems-23.pdf}{Moving a Scientific Computing System to the Cloud}}. In \emph{7th UK System Research Challenges Workshop}. Co Durham, UK. 2023.

\label{org6747201}Peter Mann, V. Anne Smith, John Mitchell, and Simon Dobson.  \emph{A Population Model of Interacting SARS-CoV-2 Variants}. In \emph{Proceedings of the BIFI International Conference on the Science of Covid-19: From Molecular Drug Design to Data-Driven Epidemiological Models}. Zaragoza, ES. 2022.

\label{org4a117dd}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/stochastic-testing-21.pdf}{Unit (and Other) Testing of Stochastic Code}}. In \emph{6th UK Systems Research Challenges Workshop}. Co Durham, UK. 2021.

\label{orgdd83ab0}Lei Fang, Xiaoli Liu, Xiang Su, Juan Ye, Simon Dobson, Pan Hui, and Sasu Tarkoma.  \emph{\href{https://doi.org/10.1007/978-3-030-70569-5\_8}{Bayesian Inference Federated Learning for Heart Rate Prediction}}. In \emph{Mobihealth 2020: Wireless Mobile Communications and Healthcare}, pp.116–130. Volume 362 of Lecture Notes of the Institute for Computer Sciences, Social Informatics and Telecommunications Engineering. Springer. 2021.

\label{org34bb558}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/s4-uk-systems-19.pdf}{Towards a Science of Sensor Systems Software}}. In \emph{5th UK Systems Research Challenges Workshop}. Co Durham, UK. 2019.

\label{org9da4b8c}Lennert Voogt, Lisa Dow, and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/open-badges-best-practice-16.pdf}{Open Badges: A Best-Practice Framework}}. In \emph{Proceedings of the SAI Computing Conference}. London, UK. 2016.

\label{org7ed4e9d}Simon Dobson, Saray Shai, Emanuele Strano, and Marc Barthélemy.  \emph{\href{https://simondobson.org/softcopy/urban-networks-sicsa.pdf}{Multiplex Cities: Interacting Transport Networks in Metropolitan Areas}}. 2015. Presented at the SICSA Workshop on Modelling and Optimisation of Real-World Transportation.

\label{org1a6029d}Juan Ye, Graeme Stevenson, and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/comorea-15.pdf}{Using Temporal Correlation and Time Series to Detect Missing Activity-Driven Sensor Events}}. In \emph{Proceedings of the 11th Workshop on Context and Activity Modelling and Recognition (CoMoRea’15)}. St Louis, MO. 2015.

\label{orgf545693}Chris Schneider, Adam Barker, and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/adapt14.pdf}{Autonomous Fault Detection in Self-Healing Systems: Comparing Hidden Markov Models and Artificial Neural Networks}}. In \emph{Proceedings of the 4th International Workshop on Adaptive Self-Tuning Computing Systems (ADAPT-2014)}. Vienna, at. 2014.

\label{orge16f070}Graeme Stevenson, Gabriella Castelli, Juan Ye, Alberto Rossi, Simon Dobson, and Franco Zambonelli.  \emph{\href{https://simondobson.org/softcopy/sensemine13.pdf}{A Bio-Chemically Inspired Approach to Awareness in Pervasive Systems}}. In \emph{Proceedings of First International Workshop on Sensing and Big Data Mining (SenseMine 2013)}. Rome, IT. 2013.

\label{orgdd9338e}Simon Dobson, Alan Dearle, and Barry Porter.  \emph{\href{https://simondobson.org/softcopy/places-2013-final.pdf}{Minimising Virtual Machine Support for Concurrency}}. In \emph{Proceedings of 5th ETAPS Workshop on Programming Language Approaches to Concurrency and Communication-cEntric Software (PLACES’13)}. Rome, IT. 2013.

\label{org7bb207d}Graeme Stevenson, Jose Luis Fernandez-Marquez, Sara Montagna, Alberto Rosi, Giovanna di Marzo Serugendo Juan Ye, Mirko Viroli, Simon Dobson, and Akla-Esso Tchao.  \emph{\href{https://simondobson.org/softcopy/asensis-12-urban.pdf}{Towards Situated Awareness in Urban Networks: A Bio-Inspired Approach}}. In \emph{Proceedings of the First International Workshop on Adaptive Service Ecosystems: Nature and Socially Inspired Solutions (ASENSIS’12)}, pp.53–58. Lyons, FR. 2012.

\label{orgf1eda33}Graeme Stevenson, Mirko Viroli, Juan Ye, Sara Montagna, and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/asensis-12-discovery.pdf}{Self-Organising Semantic Resource Discovery for Pervasive Systems}}. In \emph{Proceedings of the First International Workshop on Adaptive Service Ecosystems: Nature and Socially Inspired Solutions (ASENSIS’12)}, pp.47–52. Lyons, FR. 2012.

\label{org559e248}Barry Porter, Alan Dearle, and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/midsens12.pdf}{From Missions to Systems: Generating Transparently-Distributable Programs for Sensor-Oriented Systems}}. In \emph{Proceedings of the Seventh International Workshop on Middleware Tools, Services and Run-Time Support for Sensor Networks (MidSens’12)}, pp.1–6. Montreal ca. 2012.

\label{org0a9f72c}Jose Luis Fernandez-Marquez, Graeme Stevenson, Akla-Esso Tchao, Juan Ye, Giovanna di Marzo Serugendo, and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/asensis-12-gradients.pdf}{Analysis of New Gradient Based Aggregation Algorithms for Data-Propagation in Distributed Networks}}. In \emph{Proceedings of the First International Workshop on Adaptive Service Ecosystems: Nature and Socially Inspired Solutions (ASENSIS’12)}. Lyons, FR. 2012.

\label{org965ff4f}Juan Ye, Graeme Stevenson, Simon Dobson, Michael O’Grady, and Gregory O’Hare.  \emph{\href{https://simondobson.org/softcopy/pi-11.pdf}{\(PI\): Perceiver and Interpreter of Smart Home Datasets}}. In \emph{Proceedings of the 5th International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth 2011)}, pp.131–138. Dublin, IE. May 2011. Nominated for best paper award.

\label{orgf4dfb87}Alberto Rosi, Simon Dobson, Marco Mamei, Graeme Stevenson, Juan Ye, and Franco Zambonelli.  \emph{\href{https://simondobson.org/softcopy/social-sensing-11.pdf}{Social Sensors and Pervasive Services: Approaches and Perspectives}}. In \emph{Proceedings of the Second IEEE Workshop on Pervasive Collaboration and Social Networking (PerCol 2011)}, pp.252–530. IEEE Press. Seattle, WA. 2011.

\label{org1de4f5e}Graeme Stevenson and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/sapphire-odise11.pdf}{Sapphire: Generating Java Runtime Artefacts from OWL Ontologies}}. In \emph{Proceedings of the 3rd International Workshop on Ontology-Driven Information Systems Engineering (ODISE 2011)}, pp.425–236. London, UK. 2011.

\label{org929458a}Graeme Stevenson, Juan Ye, and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/temporal-features-pmmps10.pdf}{On the Impact of the Temporal Features of Sensed Data on the Development of Pervasive Systems}}. In \emph{Proceedings of the International Workshop on Programming Methods for Mobile and Pervasive Systems at PERVASIVE 2010}. Helsinki, FI. May 2010.

\label{org72d487c}Juan Ye, Lorcan Coyle, Susan McKeever, and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/diffuse-boundaries-2010.pdf}{Dealing with Activities with Diffuse Boundaries}}. In \emph{Proceedings of the Workshop on How to Do Good Activity Recognition Research: Experimental Methodologies, Evaluation Metrics and Reproducility Issues at PERVASIVE 2010}. Helsinki, FI. May 2010.

\label{orgd8892ac}Stephen Knox, Lorcan Coyle, and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/2010flairs.pdf}{Using Ontologies in Case-Based Activity Recognition}}. In \emph{Proceedings of the 23rd International Conference of the Florida Artificial Intelligence Research Society (FLAIRS-23)}. Daytona Beach, FL. May 2010.

\label{org91a8dd6}Michael O’Grady, Juan Ye, G.M.P. O’Hare, Simon Dobson, Richard Tynan, and Connor Muldoon.  \emph{\href{https://simondobson.org/softcopy/implicit-interaction-10.pdf}{A Middleware for Implicit Interaction}}. In \emph{Proceedings of the International Workshop on Instinctive Computing}. Volume 5897 of Lecture Notes in Artificial Intelligence. Springer Verlag. Pittsburgh, PA. 2010.

\label{orgaa2509c}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/euro-nf-09.pdf}{Integrating Sensor Networks into the Future Internet (Extended Abstract)}}. In \emph{Proceedings of the 2nd Euro-NF Workshop on Future Internet Architectures}. Santander, ES. 2009.

\label{orgfae00f6}Juan Ye, Adrian K. Clear, Lorcan Coyle, and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/aics2009.pdf}{On Using Temporal Semantics to Create More Accurate Human-Activity Classifiers}}. In \emph{Artificial Intelligence and Cognitive Science}. Lorcan Coyle and Jill Freyne, editors. Volume 6206 of LNCS. Springer-Verlag. 2009.

\label{orgab6f5d2}Josu Martinez and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/fresh-icsoft09.pdf}{Functionality Recomposition for Self-Healing}}. In \emph{Proceedings of the 4th International Conference on Software and Data Technologies}. Sofia, BG. 2009.

\label{org92f5cfa}M.A. Razzaque and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/adhoc-09.pdf}{Enhancement of Self-Organisation in Wireless Networking through a Cross-Layer Approach}}. In \emph{Proceedings of the 1st International Conference on Ad Hoc Networks}. Niagara Falls, ca. 2009.

\label{org98b7b9e}Matthew Stabeler, Davide Cellai, Paddy Nixon, and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/edtn-09.pdf}{Delay Tolerant Networks and Spatially Detailed Human Mobility}}. In \emph{Proceedings of the Workshop on the Emergence of Delay- and Disruption-Tolerant Networks}. St Petersburg, RU. 2009.

\label{orgd58cb1a}Lorcan Coyle, Juan Ye, Susan McKeever, Stephen Knox, Matthew Stabeler, Simon Dobson, and Paddy Nixon.  \emph{\href{https://simondobson.org/softcopy/2008datasets-08.pdf}{Gathering Datasets for Activity Identification}}. In \emph{Proceedings of the Workshop on Developing Shared Home Behaviour Datasets to Advance HCI and Ubiquitous Computing Research at CHI 2009}. Boston, MA. 2009.

\label{org47a5f20}Graham Williamson, Davide Cellai, Simon Dobson, and Paddy Nixon.  \emph{\href{https://simondobson.org/softcopy/uksim-09.pdf}{Modelling Periodic Data Dissemination in Wireless Sensor Networks}}. In \emph{Proceedings of the 3rd UKSim European Symposium on Computer Modelling and Simulation}. IEEE Press. 2009.

\label{org219be95}Matthew Stabeler, Graeme Stevenson, Simon Dobson, and Paddy Nixon.  \emph{Basadaeir: Harvesting User Profiles to Bootstrap Pervasive Applications}. In \emph{Late-Breaking Results: Adjunct Proceedings of the 7th International Conference on Pervasive Computing (PERVASIVE 2009)}. 2009.

\label{org731e47f}Eleanor O’Neill, Kris McGlinn, Eoin Bailey, Simon Dobson, and Kevin McCarthy.  \emph{\href{https://simondobson.org/softcopy/iwcams-09.pdf}{Application Development Using Modelling and Dynamical Systems Analysis}}. In \emph{Proceedings of the 1st International Workshop on Context-Aware Middleware and Services}, pp.18–23. Dublin, IE. 2009.

\label{orgaf6090c}Graeme Stevenson, Stephen Knox, Simon Dobson, and Paddy Nixon.  \emph{\href{https://simondobson.org/softcopy/ontonym-ciao2009.pdf}{ONTONYM: A Collection of Upper Ontologies for Pervasive Application Development}}. In \emph{Proceedings of the Workshop on Context, Information and Ontologies Ontology (CIAO’09)}. Heraklion, GR. 2009.

\label{org77a2e35}Susan McKeever, Juan Ye, Lorcan Coyle, and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/multilayered-uncertainty-08.pdf}{A Multilayered Uncertainty Approach for Context-Aware Systems}}. In \emph{Late-Breaking Results: Adjunct Proceedings of the 6th International Conference on Pervasive Computing (PERVASIVE 2008)}, pp.1–4. Sidney, AU. 2008.

\label{orgea6e5c2}Michael Collins, Paddy Nixon, and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/msecurity-ubicom08.pdf}{A Secure Lightweight Architecture for Wireless Sensor Networks}}. In \emph{Proceedings of the Second International Conference on Mobile Ubiquitous Computing, Systems, Services and Technologies (UBICOMM’08)}. Valencia, ES. 2008. Winner of Joint Best Paper Award.

\label{orgad2b550}Olga Murdoch, Lorcan Coyle, and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/Murdoch2008Ontology.pdf}{Ontology-Based Query Recommendation as a Support to Image Retrieval}}. In \emph{Proceedings of the 19th Irish Conference in Artificial Intelligence and Cognitive Science}. Cork, IE. 2008.

\label{org5416e27}Simon Dobson and Paddy Nixon.  \emph{\href{https://simondobson.org/softcopy/hotac-08.pdf}{Stable Autonomic Adaptation: A Grand Challenge}}. In \emph{Proceedings of the Third IEEE Workshop on Hot Topics for Autonomic Computing (HotAC’08)}. Chicago IL. 2008.

\label{org316280b}Adrian K. Clear, Ross Shannon, Thomas Holland, Simon Dobson, Aaron Quigley, and Paddy Nixon.  \emph{\href{https://simondobson.org/softcopy/situvis.pdf}{Situvis: Visualising Multivariate Context Information to Evaluate Situation Specifications}}. In \emph{Proceedings of the 2nd International Workshop on Ubiquitous Systems Evaluation (USE 2008)}. Seoul, KR. 2008.

\label{orgebddc06}Simon Dobson.  \emph{From Adaptive Systems to Adaptive Spaces}. In \emph{Resilient and Survivable Networks, Infrastructure and Services}. Schloß Dagstuhl. 2008.

\label{orga4a2d2b}Michael Collins, Simon Dobson, and Paddy Nixon.  \emph{Identifying and Isolating Aberrant Nodes in Wireless Sensor Networks}. In \emph{Proceedings of the 3rd International Conference for Internet Technologies and Secured Transactions}. Dublin, IE. 2008. Winner of best paper award.

\label{org0e79ff2}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/semantics-wg-ease-08.pdf}{Facilitating a Well-Founded Approach to Autonomic Systems}}. In \emph{Proceedings of the 5th IEEE Workshop on the Engineering of Autonomic and Autonomous Systems (EASe 2008)}. IEEE Press. Belfast, UK. 2008.

\label{orgff6cd24}Steve Neely, Graham Williamson, Hui Zhang, Graeme Stevenson, and Simon Dobson.  \emph{Location Detection with Smart Zigbee Sensors}. 2007. 2nd Workshop on Wireless Sensor Networks Research in Ireland (WiSEN 2007).

\label{org7cdf03d}Stephen Knox, Adrian K. Clear, Ross Shannon, Lorcan Coyle, Simon Dobson, Aaron Quigley, and Paddy Nixon.  \emph{\href{https://simondobson.org/softcopy/mrc-scatterbox-07.pdf}{Towards Scatterbox: A Context-Aware Message Forwarding Platform}}. In \emph{Proceedings of the Fourth International Workshop Modeling and Reasoning in Context (MRC 2007)}. Copenhagen, DK. 2007.

\label{org469c743}Juan Ye, Lorcan Coyle, Simon Dobson, and Paddy Nixon.  \emph{\href{https://simondobson.org/softcopy/mrc-lattices-07.pdf}{Using Situation Lattices to Model and Reason About Context}}. In \emph{Proceedings of the Fourth International Workshop Modeling and Reasoning in Context (MRC 2007)}. Copenhagen, DK. 2007.

\label{org3fee6b9}Lorcan Coyle, Juan Ye, Emerson Loureiro, Stephen Knox, Simon Dobson, and Paddy Nixon.  \emph{\href{https://simondobson.org/softcopy/use07.pdf}{A Proposed Approach to Evaluate the Accuracy of Tag-Based Location Systems}}. In \emph{Proceedings of the First Workshop on Ubiquitous Systems Evaluation at Ubicomp’07}. 2007.

\label{org85d6070}M.A. Razzaque, Simon Dobson, and Paddy Nixon.  \emph{\href{https://simondobson.org/softcopy/wiman-07.pdf}{Context Awareness through Cross-Layer Network Architecture}}. In \emph{Proceedings of the First International Workshop on Wireless Mesh and Ad Hoc Networks}. Honolulu, HI. 2007.

\label{org40b4e7d}Simon Dobson, Paddy Nixon, Lorcan Coyle, Steve Neely, Graeme Stevenson, and Graham Williamson.  \emph{\href{https://simondobson.org/softcopy/ccnc-07.pdf}{Construct: An Open Source Pervasive Systems Platform}}. In \emph{Proceedings of the 4th IEEE Consumer Communciations and Networking Conference}, pp.1203–1204. IEEE Press. Las Vegas, NV. 2007.

\label{org40c8204}Michael Collins, Simon Dobson, and Paddy Nixon.  \emph{\href{https://simondobson.org/softcopy/ptiiai-06.pdf}{Security Issues with Pervasive Computing Frameworks}}. In \emph{Pervasive 2006 Workshop Proceedings}, pp.679–685. Thomas Strang, Vinny Cahill, and Aaron Quigley, editors. Springer Verlag. Dublin, IE. 2006. Workshop on Privacy, Trust and Identity Issues for Ambient Intelligence.

\label{org3742ea1}Adrian K. Clear, Stephen Knox, Juan Ye, Lorcan Coyle, Simon Dobson, and Paddy Nixon.  \emph{\href{https://simondobson.org/softcopy/co-2006.pdf}{Integrating Multiple Contexts and Ontologies in a Pervasive Computing Framework}}. In \emph{Contexts and Ontologies: Theory, Practice and Applications}. Riva Del Garda, IT. 2006.

\label{org81f81f8}Simon Dobson and Juan Ye.  \emph{\href{https://simondobson.org/softcopy/tppc-06.pdf}{Using Fibrations for Situation Identification}}. In \emph{Pervasive 2006 Workshop Proceedings}, pp.645–651. Thomas Strang, Vinny Cahill, and Aaron Quigley, editors. Springer Verlag. Dublin, IE. 2006. Workshop on Combining Theory and System-Building.

\label{org6d02aa5}Graham Williamson, Graeme Stevenson, Steve Neely, Simon Dobson, and Paddy Nixon.  \emph{\href{https://simondobson.org/softcopy/eurossc-evaluation-06.pdf}{An Evaluation Framework for Disseminating Context Information with Gossiping}}. In \emph{Proceedings of the 1st European Conference on Smart Sensing and Context}. Volume 4272 of LNCS. 2006.

\label{org90e60f8}Syarulnaziah Anawar, Lorcan Coyle, Simon Dobson, and Paddy Nixon.  \emph{\href{https://simondobson.org/softcopy/eurossc-delivery-06.pdf}{Context Delivery in Ad Hoc Networks Using Enhanced Gossiping Algorithms}}. In \emph{Proceedings of the 1st European Conference on Smart Sensing and Context}. Volume 4272 of LNCS. 2006.

\label{org32929fd}Lorcan Coyle, Evelyn Baife, Graeme Stevenson, Steve Neely, Simon Dobson, Paddy Nixon, and Barry Smyth.  \emph{\href{https://simondobson.org/softcopy/eccbr-06.pdf}{Supplementing Case-Based Recommenders with Context Data}}. In \emph{Proceedings of the 1st International Workshop on Case-Based Reasoning and Context-Awareness at ECCBR’06}. Ölüdeniz, TK. 2006.

\label{org647bfde}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/ijcai-aiac-05b.pdf}{Hybridising Events and Knowledge in an Infrastructure for Context-Adaptive Systems}}. In \emph{Proceedings of the IJCAI 2005 Workshop on AI and Autonomic Communications}. Roy Sterrit, Simon Dobson, and Mikhail Smirnov, editors. 2005.

\label{orgfbc6041}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/de-bruijn-iafl-05.pdf}{The de Bruijn Principle and the Compositional Design of Programming Languages}}. In \emph{Proceedings of the 17th International Workshop on Implementation and Application of Functional Languages}. 2005.

\label{org9fc91a4}Graeme Stevenson, Lorcan Coyle, Steve Neely, Simon Dobson, and Paddy Nixon.  \emph{Construct – a Decentralised Context Infrastructure for Computing Environments}. 2005. IT\&T Annual Conference.

\label{org442d3ca}M.A. Razzaque, Simon Dobson, and Paddy Nixon.  \emph{\href{https://simondobson.org/softcopy/ijcai-aiac-05a.pdf}{Categorisation and Modelling of Quality in Context Information}}. In \emph{Proceedings of the IJCAI 2005 Workshop on AI and Autonomic Communications}. Roy Sterrit, Simon Dobson, and Mikhail Smirnov, editors. 2005.

\label{orgc9c2ad3}Kieran Delaney, Simon Dobson, Kafil Mahmood Razeeb, and John Barton.  \emph{Creating the Disappearing Computer – Using Augmented Materials to Build Collaborative Augmented Artefacts}. 2005. IT\&T Annual Conference.

\label{orgb18f38f}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/ERLS-04.pdf}{Creating Programming Languages for (and from) the Internet}}. In \emph{Workshop on Evolution and Reuse of Language Specifications for Domain-Specific Languages at ECOOP’04}. Oslo, NO. 2004.

\label{orgd8f18f6}Paddy Nixon, Simon Dobson, Sotirios Terzis, and Feng Wang.  \emph{\href{https://simondobson.org/softcopy/IWNA-2003.pdf}{Architectural Implications for Context-Adaptive Smart Spaces}}. In \emph{Proceedings of the International Workshop on Networked Applicances}, pp.156–161. IEEE Press. 2003.

\label{org9f0fa12}Paddy Nixon, Feng Wang, Sotirios Terzis, and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/ecoose-2003.pdf}{Engineering Context-Aware Systems}}. In \emph{Proceedings of the International Workshop on Engineering Context-Aware Object-Oriented Systems and Environments}. Seattle, WA. 2002.

\label{orge8437a4}Sotirios Terzis, Paddy Nixon, Vinny Wade, Simon Dobson, and John Fuller.  \emph{Building the next Generation of Groupware}. In \emph{Enterprise Information Systems}. Joaquim Filipe, editor. Kluwer Academic Press. 2001.

\label{orga38f57d}Tim Walsh, Paddy Nixon, and Simon Dobson.  \emph{An Integrated System for Managing Intelligent Buildings}. In \emph{Managing Interactions in Smart Environments}. Paddy Nixon, Gerard Lacey, and Simon Dobson, editors. Springer Verlag. 2000.

\label{orgafc6329}Richard Greenane and Simon Dobson.  \emph{Integrating LONWorks into an Open Systems Control Environment}. 1999. Presented at the LONWorks’99 trade conference.

\label{org35d0086}Paddy Nixon, Vinny Wade, Simon Dobson, John Fuller, and Sotirios Terzis.  \emph{\href{https://simondobson.org/softcopy/virtues-ocve-1998.pdf}{Designing Components for a Virtual Organisation: A Case Study}}. In \emph{Proceedings of Objects, Components and the Virtual Enterprise}. Vancouver, ca. 1998.

\label{org5764b51}Simon Dobson and Paddy Nixon.  \emph{(Free) Radical Programming Languages}. In \emph{Proceedings of the 5th CaberNet Radicals Workshop}. Oporto, PT. 1998.

\label{org161da98}Simon Dobson and Victoria Burrill.  \emph{\href{https://simondobson.org/softcopy/lightweight-databases-bcs-1995.pdf}{Towards Improving Automation in the World Wide Web}}. In \emph{New Directions in Software Development}. British Computer Society. 1995.

\label{org93a3162}Simon Dobson and Andy Wellings.  \emph{\href{https://simondobson.org/softcopy/scalable-parallel-applications-92.pdf}{A System for Building Scalable Parallel Applications}}. In \emph{Programming Environments for Parallel Computing}, pp.218–230. Nigel Topham, Roland Ibbett, and Thomas Bemmerl, editors. North Holland Elsevier. 1992.

\label{orgc7cb6ab}Simon Dobson and Andy Wellings.  \emph{Programming Highly Parallel General-Purpose Applications}. In \emph{Proceedings of the First BCS Workshop on Abstract Machine Models for Highly Parallel Computing}. University of Leeds. 1991.
