pages/research/publications.org
** Book chapters

#+begin: sd/bibliography :key category :value chapter
<<citeproc_bib_item_1>>Mirko Viroli, Franco Zambonelli, Graeme Stevenson, and Simon Dobson.  /[[https://simondobson.org/softcopy/sapere-soa-semantic-web-12.pdf][From SOA to Pervasive Service Ecosystems: An Approach Based on Semantic Web Technologies]]/. In /Adaptive Web Services for Modular and Reusable Software Development: Tactics and Solutions/. Javier Cubo and Guadalupe Ortiz, editors. IGI Global. ISBN 1-466-620897. 2012.

<<citeproc_bib_item_2>>Simon Dobson and Aaron Quigley.  /[[http://www.amazon.co.uk/This-Pervasive-Day-Potential-Computing/dp/1848167482][Healthcare in a Pervasive World]]/. In /This Pervasive Day: The Potentials and Perils of Pervasive Computing/, pp.99–111. Jeremy Pitt, editor. Imperial College Press. ISBN 1-848-167482. 2012.

<<citeproc_bib_item_3>>M.A. Razzaque, Simon Dobson, and Paddy Nixon.  /Cross-Layer Optimisations for Autonomic Networks/. In /Advanced Autonomic Networking and Communication/, pp.127–148. Monique Calisti, Sven van der Meer, and John Strassner, editors. Springer Verlag. ISBN 978-3-7643-8568-2. 2008.

<<citeproc_bib_item_4>>Kieran Delaney and Simon Dobson.  /Augmenting Materials to Build Cooperating Objects/. In /Ambient Intelligence with Microsystems: Augmented Materials and Smart Objects/, pp.19–46. Kieran Delaney, editor. Volume 18 of Microsystems. Springer Verlag. ISBN 978-0-387-46293-9. 2008.

<<citeproc_bib_item_5>>Juan Ye, Simon Dobson, and Paddy Nixon.  /An Overview of Pervasive Computing Systems/. In /Ambient Intelligence with Microsystems: Augmented Materials and Smart Objects/, pp.3–17. Kieran Delaney, editor. Volume 18 of Microsystems. Springer Verlag. ISBN 978-0-387-46293-9. 2008.

<<citeproc_bib_item_6>>Simon Dobson.  /Co-Design for Context Awareness in Pervasive Systems/. In /Ambient Intelligence with Microsystems: Augmented Materials and Smart Objects/, pp.297–307. Kieran Delaney, editor. Volume 18 of Microsystems. Springer Verlag. ISBN 978-0-387-46293-9. 2008.

<<citeproc_bib_item_7>>Simon Dobson.  /[[https://simondobson.org/softcopy/coacac-04.pdf][Report from the ECOOP 2004 Workshop on Component-Oriented Approaches to Context-Aware Computing]]/. In /ECOOP’04 Workshop Reader/, pp.84–93. Jacques Malenfant and Bjarte Østvold, editors. Volume 3344 of LNCS. Springer Verlag. 2004.
#+end:

** Posters

#+begin: sd/bibliography :key category :value poster
<<citeproc_bib_item_1>>Michael Pitcher, Ruth Bowness, Simon Dobson, and Stephen Gillespie.  /A Network-Based Metapopulation Model to Simulate a Pulmonary Tuberculosis Infection/. 2017. Poster at the 6th International Conference on Complex Networks and their Applications.

<<citeproc_bib_item_2>>Saray Shai and Simon Dobson.  /[[https://simondobson.org/softcopy/siam-networks-abstract-15.pdf][Epidemic Spreading in Adaptive Multilayer Networks]]/. May 2015. Poster at the SIAM Workshop on Network Science.

<<citeproc_bib_item_3>>Saray Shai, Dror Kenett, Yoed Kenett, Miriam Faust, Simon Dobson, and Shlomo Havlin.  /[[https://simondobson.org/softcopy/modular-network-attacks-netsci-15.pdf][Attacks on Modular Networks]]/. 2015. Poster at the International School and Conference on Network Science (NetSci’15).

<<citeproc_bib_item_4>>Aleksejs Sazonovs, Simon Dobson, and Oscar Gaggiotti.  /[[https://simondobson.org/softcopy/sazonovs-poster-15.pdf][A Metapopulation Model for Predicting the Success of Genetic Control Measures for Malaria]]/. 2015. Poster at the SICSA Workshop on Computational Ecology.

<<citeproc_bib_item_5>>Saray Shai and Simon Dobson.  /[[https://simondobson.org/softcopy/burst-netsci13.pdf][Bursty Activity in Coupled Networks]]/. 2013. Poster at the International School and Conference on Network Science (NetSci’13).

<<citeproc_bib_item_6>>Eoin Bailey, Simon Dobson, and Aaron Quigley.  /[[https://simondobson.org/softcopy/LERO-CASCON07.pdf][Dynamical Systems Theory Applied to Autonomics]]/. 2007. Poster at the IBM Centres for Advanced Study Conference (CASCON).

<<citeproc_bib_item_7>>Eoin Bailey, Simon Dobson, and Paddy Nixon.  /Semantics of Autonomic Systems/. 2006. Poster at the IBM Centres for Advanced Study Conference (CASCON).

<<citeproc_bib_item_8>>Tim Walsh, Paddy Nixon, and Simon Dobson.  /As Strong as Possible Mobility/. In /Proceedings of the 22nd Internatioal Conference on Software Engineering/, pp.779. 2000.

<<citeproc_bib_item_9>>Simon Dobson, Victoria Marshall, and Brian Ritchie.  /[[https://simondobson.org/softcopy/threads-www-94.pdf][STICKS and STONES: Architectures for Modular WWW Software]]/. May 1996. Poster at the 5th International World Wide Web conference.
#+end:

