research/publications/index.html

<div id="outline-container-orgcebee69" class="outline-3">
<h3 id="orgcebee69">Book&nbsp;chapters</h3>
<div class="outline-text-3" id="text-orgcebee69">
<p>
<a id="orgc8beedc"></a>Mirko Viroli, Franco Zambonelli, Graeme Stevenson, and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/sapere-soa-semantic-web-12.pdf">From <span class="caps">SOA</span> to Pervasive Service Ecosystems: An Approach Based on Semantic Web Technologies</a></i>. In <i>Adaptive Web Services for Modular and Reusable Software Development: Tactics and Solutions</i>. Javier Cubo and Guadalupe Ortiz, editors. <span class="caps">IGI</span> Global. <span class="caps">ISBN</span> 1-466-620897.&nbsp;2012.
</p>

<p>
<a id="org36186e3"></a>Simon Dobson and Aaron Quigley.  <i><a href="http://www.amazon.co.uk/This-Pervasive-Day-Potential-Computing/dp/1848167482">Healthcare in a Pervasive World</a></i>. In <i>This Pervasive Day: The Potentials and Perils of Pervasive Computing</i>, pp.99–111. Jeremy Pitt, editor. Imperial College Press. <span class="caps">ISBN</span> 1-848-167482.&nbsp;2012.
</p>

<p>
<a id="org66b123d"></a><span class="caps">M.A.</span> Razzaque, Simon Dobson, and Paddy Nixon.  <i>Cross-Layer Optimisations for Autonomic Networks</i>. In <i>Advanced Autonomic Networking and Communication</i>, pp.127–148. Monique Calisti, Sven van der Meer, and John Strassner, editors. Springer Verlag. <span class="caps">ISBN</span> 978-3-7643-8568-2.&nbsp;2008.
</p>

<p>
<a id="org579716a"></a>Kieran Delaney and Simon Dobson.  <i>Augmenting Materials to Build Cooperating Objects</i>. In <i>Ambient Intelligence with Microsystems: Augmented Materials and Smart Objects</i>, pp.19–46. Kieran Delaney, editor. Volume 18 of Microsystems. Springer Verlag. <span class="caps">ISBN</span> 978-0-387-46293-9.&nbsp;2008.
</p>

<p>
<a id="orgaad2f61"></a>Juan Ye, Simon Dobson, and Paddy Nixon.  <i>An Overview of Pervasive Computing Systems</i>. In <i>Ambient Intelligence with Microsystems: Augmented Materials and Smart Objects</i>, pp.3–17. Kieran Delaney, editor. Volume 18 of Microsystems. Springer Verlag. <span class="caps">ISBN</span> 978-0-387-46293-9.&nbsp;2008.
</p>

<p>
<a id="orge690b26"></a>Simon Dobson.  <i>Co-Design for Context Awareness in Pervasive Systems</i>. In <i>Ambient Intelligence with Microsystems: Augmented Materials and Smart Objects</i>, pp.297–307. Kieran Delaney, editor. Volume 18 of Microsystems. Springer Verlag. <span class="caps">ISBN</span> 978-0-387-46293-9.&nbsp;2008.
</p>

<p>
<a id="org148c9f8"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/coacac-04.pdf">Report from the <span class="caps">ECOOP</span> 2004 Workshop on Component-Oriented Approaches to Context-Aware Computing</a></i>. In <i><span class="caps">ECOOP</span>’04 Workshop Reader</i>, pp.84–93. Jacques Malenfant and Bjarte Østvold, editors. Volume 3344 of <span class="caps">LNCS</span>. Springer Verlag.&nbsp;2004.
</p>
</div>
</div>

<div id="outline-container-orgc730ff0" class="outline-3">
<h3 id="orgc730ff0">Posters</h3>
<div class="outline-text-3" id="text-orgc730ff0">
<p>
<a id="org7447368"></a>Michael Pitcher, Ruth Bowness, Simon Dobson, and Stephen Gillespie.  <i>A Network-Based Metapopulation Model to Simulate a Pulmonary Tuberculosis Infection</i>. 2017. Poster at the 6th International Conference on Complex Networks and their&nbsp;Applications.
</p>

<p>
<a id="org65770ad"></a>Saray Shai and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/siam-networks-abstract-15.pdf">Epidemic Spreading in Adaptive Multilayer Networks</a></i>. May 2015. Poster at the <span class="caps">SIAM</span> Workshop on Network&nbsp;Science.
</p>

<p>
<a id="org8d682e8"></a>Saray Shai, Dror Kenett, Yoed Kenett, Miriam Faust, Simon Dobson, and Shlomo Havlin.  <i><a href="https://simondobson.org/softcopy/modular-network-attacks-netsci-15.pdf">Attacks on Modular Networks</a></i>. 2015. Poster at the International School and Conference on Network Science&nbsp;(NetSci’15).
</p>

<p>
<a id="org1bdf4f4"></a>Aleksejs Sazonovs, Simon Dobson, and Oscar Gaggiotti.  <i><a href="https://simondobson.org/softcopy/sazonovs-poster-15.pdf">A Metapopulation Model for Predicting the Success of Genetic Control Measures for Malaria</a></i>. 2015. Poster at the <span class="caps">SICSA</span> Workshop on Computational&nbsp;Ecology.
</p>

<p>
<a id="orgc33816a"></a>Saray Shai and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/burst-netsci13.pdf">Bursty Activity in Coupled Networks</a></i>. 2013. Poster at the International School and Conference on Network Science&nbsp;(NetSci’13).
</p>

<p>
<a id="org82a0fb9"></a>Eoin Bailey, Simon Dobson, and Aaron Quigley.  <i><a href="https://simondobson.org/softcopy/LERO-CASCON07.pdf">Dynamical Systems Theory Applied to Autonomics</a></i>. 2007. Poster at the <span class="caps">IBM</span> Centres for Advanced Study Conference&nbsp;(<span class="caps">CASCON</span>).
</p>

<p>
<a id="orgba3b09c"></a>Eoin Bailey, Simon Dobson, and Paddy Nixon.  <i>Semantics of Autonomic Systems</i>. 2006. Poster at the <span class="caps">IBM</span> Centres for Advanced Study Conference&nbsp;(<span class="caps">CASCON</span>).
</p>

<p>
<a id="orgdee4e25"></a>Tim Walsh, Paddy Nixon, and Simon Dobson.  <i>As Strong as Possible Mobility</i>. In <i>Proceedings of the 22nd Internatioal Conference on Software Engineering</i>, pp.779.&nbsp;2000.
</p>

<p>
<a id="org48319ed"></a>Simon Dobson, Victoria Marshall, and Brian Ritchie.  <i><a href="https://simondobson.org/softcopy/threads-www-94.pdf"><span class="caps">STICKS</span> and <span class="caps">STONES</span>: Architectures for Modular <span class="caps">WWW</span> Software</a></i>. May 1996. Poster at the 5th International World Wide Web&nbsp;conference.
</p>
</div>
</div>
