pages/research/publications.tex

\subsection{Book chapters}
\label{sec:orge9c5d68}

\label{orge6ad967}Mirko Viroli, Franco Zambonelli, Graeme Stevenson, and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/sapere-soa-semantic-web-12.pdf}{From SOA to Pervasive Service Ecosystems: An Approach Based on Semantic Web Technologies}}. In \emph{Adaptive Web Services for Modular and Reusable Software Development: Tactics and Solutions}. Javier Cubo and Guadalupe Ortiz, editors. IGI Global. ISBN 1-466-620897. 2012.

\label{org0f7ead3}Simon Dobson and Aaron Quigley.  \emph{\href{http://www.amazon.co.uk/This-Pervasive-Day-Potential-Computing/dp/1848167482}{Healthcare in a Pervasive World}}. In \emph{This Pervasive Day: The Potentials and Perils of Pervasive Computing}, pp.99–111. Jeremy Pitt, editor. Imperial College Press. ISBN 1-848-167482. 2012.

\label{orge85d77d}M.A. Razzaque, Simon Dobson, and Paddy Nixon.  \emph{Cross-Layer Optimisations for Autonomic Networks}. In \emph{Advanced Autonomic Networking and Communication}, pp.127–148. Monique Calisti, Sven van der Meer, and John Strassner, editors. Springer Verlag. ISBN 978-3-7643-8568-2. 2008.

\label{org8628b98}Kieran Delaney and Simon Dobson.  \emph{Augmenting Materials to Build Cooperating Objects}. In \emph{Ambient Intelligence with Microsystems: Augmented Materials and Smart Objects}, pp.19–46. Kieran Delaney, editor. Volume 18 of Microsystems. Springer Verlag. ISBN 978-0-387-46293-9. 2008.

\label{org6b456d1}Juan Ye, Simon Dobson, and Paddy Nixon.  \emph{An Overview of Pervasive Computing Systems}. In \emph{Ambient Intelligence with Microsystems: Augmented Materials and Smart Objects}, pp.3–17. Kieran Delaney, editor. Volume 18 of Microsystems. Springer Verlag. ISBN 978-0-387-46293-9. 2008.

\label{orgdc0d592}Simon Dobson.  \emph{Co-Design for Context Awareness in Pervasive Systems}. In \emph{Ambient Intelligence with Microsystems: Augmented Materials and Smart Objects}, pp.297–307. Kieran Delaney, editor. Volume 18 of Microsystems. Springer Verlag. ISBN 978-0-387-46293-9. 2008.

\label{orgb105a54}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/coacac-04.pdf}{Report from the ECOOP 2004 Workshop on Component-Oriented Approaches to Context-Aware Computing}}. In \emph{ECOOP’04 Workshop Reader}, pp.84–93. Jacques Malenfant and Bjarte Østvold, editors. Volume 3344 of LNCS. Springer Verlag. 2004.

\subsection{Posters}
\label{sec:orgae7e9d3}

\label{orgdfb16ca}Michael Pitcher, Ruth Bowness, Simon Dobson, and Stephen Gillespie.  \emph{A Network-Based Metapopulation Model to Simulate a Pulmonary Tuberculosis Infection}. 2017. Poster at the 6th International Conference on Complex Networks and their Applications.

\label{org68d5f45}Saray Shai and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/siam-networks-abstract-15.pdf}{Epidemic Spreading in Adaptive Multilayer Networks}}. May 2015. Poster at the SIAM Workshop on Network Science.

\label{orge7b37e1}Saray Shai, Dror Kenett, Yoed Kenett, Miriam Faust, Simon Dobson, and Shlomo Havlin.  \emph{\href{https://simondobson.org/softcopy/modular-network-attacks-netsci-15.pdf}{Attacks on Modular Networks}}. 2015. Poster at the International School and Conference on Network Science (NetSci’15).

\label{orge6b0de8}Aleksejs Sazonovs, Simon Dobson, and Oscar Gaggiotti.  \emph{\href{https://simondobson.org/softcopy/sazonovs-poster-15.pdf}{A Metapopulation Model for Predicting the Success of Genetic Control Measures for Malaria}}. 2015. Poster at the SICSA Workshop on Computational Ecology.

\label{org06ee859}Saray Shai and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/burst-netsci13.pdf}{Bursty Activity in Coupled Networks}}. 2013. Poster at the International School and Conference on Network Science (NetSci’13).

\label{org84e97be}Eoin Bailey, Simon Dobson, and Aaron Quigley.  \emph{\href{https://simondobson.org/softcopy/LERO-CASCON07.pdf}{Dynamical Systems Theory Applied to Autonomics}}. 2007. Poster at the IBM Centres for Advanced Study Conference (CASCON).

\label{org3d49ef8}Eoin Bailey, Simon Dobson, and Paddy Nixon.  \emph{Semantics of Autonomic Systems}. 2006. Poster at the IBM Centres for Advanced Study Conference (CASCON).

\label{org2b5f5fe}Tim Walsh, Paddy Nixon, and Simon Dobson.  \emph{As Strong as Possible Mobility}. In \emph{Proceedings of the 22nd Internatioal Conference on Software Engineering}, pp.779. 2000.

\label{orgd4d1121}Simon Dobson, Victoria Marshall, and Brian Ritchie.  \emph{\href{https://simondobson.org/softcopy/threads-www-94.pdf}{STICKS and STONES: Architectures for Modular WWW Software}}. May 1996. Poster at the 5th International World Wide Web conference.
