research/publications/index.html

<div id="outline-container-orgda12343" class="outline-3">
<h3 id="orgda12343">Keynotes</h3>
<div class="outline-text-3" id="text-orgda12343">
<p>
<a id="orgd057aad"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/how-good-is-my-dataset.pdf">How Good Is My Dataset?</a></i> 2020. Invited talk to the <span class="caps">MAKI</span> (Multi-mechanism Adaptations for the Future Internet) workshop on Autonomous decision-making in networked systems under&nbsp;uncertainty.
</p>

<p>
<a id="org6d8b1d3"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/formal-perspective.pdf">Understanding Sensing from a More Formal Perspective</a></i>. 2019. Invited talk at the Scottish Symposium on Formal Methods for Verification and&nbsp;Synthesis.
</p>

<p>
<a id="org9ee09b1"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/dasip-keynote.pdf">Making the Transition from Sensors to Sensor Systems</a></i>. 2018. Keynote at the Conference on Design and Architectures for Signal and Image Processing&nbsp;(<span class="caps">DASIP</span>’18).
</p>

<p>
<a id="orga1c9c1c"></a>Lei Fang and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/when-things-get-noisy-14.pdf">When Things Get Noisy: Programming in the Face of Ubiquitous Uncertainty</a></i>. 2014. Invited talk at the International Conference on Cloud and Autonomic Computing&nbsp;(<span class="caps">CAC</span>’14).
</p>

<p>
<a id="org27919af"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/mucs-keynote.pdf">Ubiquitous Autonomic Management</a></i>. 2009. Keynote presentation at the 6th International Workshop on Managing Ubiquitous Communications and&nbsp;Services.
</p>

<p>
<a id="orgc97162b"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/an-talk-06.pdf">Autonomic Networking: Achieving Stability in the Face of Pervasive Uncertainty</a></i>. 2006. Keynote presentation at Autonomic&nbsp;Networking.
</p>
</div>
</div>
