pages/research/publications.tex

\subsection{Keynotes}
\label{sec:org246816b}

\label{org4030b6c}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/how-good-is-my-dataset.pdf}{How Good Is My Dataset?}} 2020. Invited talk to the MAKI (Multi-mechanism Adaptations for the Future Internet) workshop on Autonomous decision-making in networked systems under uncertainty.

\label{orgac64352}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/formal-perspective.pdf}{Understanding Sensing from a More Formal Perspective}}. 2019. Invited talk at the Scottish Symposium on Formal Methods for Verification and Synthesis.

\label{org22d1b1e}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/dasip-keynote.pdf}{Making the Transition from Sensors to Sensor Systems}}. 2018. Keynote at the Conference on Design and Architectures for Signal and Image Processing (DASIP’18).

\label{org0aa08bf}Lei Fang and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/when-things-get-noisy-14.pdf}{When Things Get Noisy: Programming in the Face of Ubiquitous Uncertainty}}. 2014. Invited talk at the International Conference on Cloud and Autonomic Computing (CAC’14).

\label{orgfc9f735}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/mucs-keynote.pdf}{Ubiquitous Autonomic Management}}. 2009. Keynote presentation at the 6th International Workshop on Managing Ubiquitous Communications and Services.

\label{orgfc55c0d}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/an-talk-06.pdf}{Autonomic Networking: Achieving Stability in the Face of Pervasive Uncertainty}}. 2006. Keynote presentation at Autonomic Networking.
