pages/research/publications.org
** Invited presentations

#+begin: sd/bibliography :key category :value "invited talk"
<<citeproc_bib_item_1>>Simon Dobson.  /Sensor Tensors/. 2022. Invited talk for LEISYS’2022.

<<citeproc_bib_item_2>>Simon Dobson.  /[[https://simondobson.org/softcopy/sensor-placement-cork-22.pdf][Sensor Interpretation Data Wrangling]]/. 2022. Invited talk to the School of Computer Science and Information Technology, University College Cork.

<<citeproc_bib_item_3>>Simon Dobson.  /[[https://simondobson.org/softcopy/smeared-phase-transition.pdf][A Possible Smeared Phase Transition in Epidemic Track-and-Trace]]/. 2020. School seminar, School of Computer Science, University of St Andrews.

<<citeproc_bib_item_4>>Simon Dobson.  /[[https://simondobson.org/softcopy/exploring-epidemic-spreading.pdf][Exploring Epidemic Spreading Using Network Models]]/. 2020. Invited talk to the Institute of Mathematics and its Applications (North-West branch).

<<citeproc_bib_item_5>>Simon Dobson.  /[[https://simondobson.org/softcopy/minimal-sensing-idir17.pdf][Minimal Sensing: The Target Counting Problem]]/. 2017. Invited talk in the St Andrews Institute for Data-Intensive Research ’Summer of Data’ series.

<<citeproc_bib_item_6>>Simon Dobson, Juan Ye, and Lei Fang.  /[[https://simondobson.org/softcopy/making-sense-of-sensing.pdf][Making Sense of Sensing]]/. 2017. Invited talk to the Department of Computer Science, University of York.

<<citeproc_bib_item_7>>Simon Dobson.  /[[https://simondobson.org/softcopy/urban-networks-16.pdf][Modelling Urban Networks: Some Results and Their Limitations]]/. 2016. Talk in the Leeds Applied Nonlinear Dynamics seminar series, University of Leeds.

<<citeproc_bib_item_8>>Simon Dobson.  /[[https://simondobson.org/softcopy/complex-cocktail.pdf][A Complex Cocktail of Networks and Reality]]/. 2016. Presentation at the St Andrews Big Data and Discrete Mathematics Symposium.

<<citeproc_bib_item_9>>Simon Dobson and Saray Shai.  /[[https://simondobson.org/softcopy/complex-networks-complex-processes.pdf][Complex Networks and Complex Processes]]/. 2014. Invited talk to the Department of Computer Science, University of York.

<<citeproc_bib_item_10>>Simon Dobson.  /[[https://simondobson.org/softcopy/forth-tay.pdf][From Forth to Tay: A Component-Based Extensible Virtual Machine for Compact Programs]]/. 2012. Invited talk to the School of Computing, University of Kent.

<<citeproc_bib_item_11>>Simon Dobson.  /[[https://simondobson.org/softcopy/mission-maybe-possible.pdf][Mission Maybe Possible: Improving the Programming Model for Wireless Sensor Networks]]/. 2012. Invited talk at the IDEAS Institute, Robert Gordon University.

<<citeproc_bib_item_12>>Simon Dobson.  /[[https://simondobson.org/softcopy/inaugural-lecture-sta-web-20111207.pdf][The Computer Is the New Microscope]]/. 2011. Professorial inaugural lecture, University of St Andrews.

<<citeproc_bib_item_13>>Simon Dobson and Juan Ye.  /[[https://simondobson.org/softcopy/sensor-and-senseability-nontechnical.pdf][Sensor and Sense-Ability: Building Systems in the Face of Uncertainty]]/. 2011. Invited talk for the Edinburgh Branch of the British Computer Society.

<<citeproc_bib_item_14>>Simon Dobson.  /[[https://simondobson.org/softcopy/back-to-the-future-talk-gp10.pdf][Progamming for Adaptive Sensor Networks: Back to the Future]]/. 2010. Invited talk to the IFIP WG2.11 workshop on Generative Programming.

<<citeproc_bib_item_15>>Simon Dobson.  /[[https://simondobson.org/softcopy/well-founded-control-talk.pdf][Controlling Sensors through Physics: Some Ideas for the Well-Founded Control of Mobile Sensor Networks]]/. 2009. Invited talk at the Stevens Institute of Technology.

<<citeproc_bib_item_16>>Simon Dobson.  /[[https://simondobson.org/softcopy/adaptive-spaces-lero-talk-20090123.pdf][What Is the Correct Semantic Basis for Adaptive Systems?]]/ 2009. Invited talk in the Lero Foundations series.

<<citeproc_bib_item_17>>Simon Dobson.  /[[https://simondobson.org/softcopy/adaptive-systems-semantics-liverpool-09.pdf][Semantic Challenges of Adaptive Systems]]/. 2009. Invited talk at the Department of Computer Science, University of Liverpool.

<<citeproc_bib_item_18>>Steve Neely, Graham Williamson, Hui Zhang, Graham Stevenson, and Simon Dobson.  /[[https://simondobson.org/softcopy/nap-zigbee-open-day-20080124.pdf][Device Positioning Using Smart Zigbee Beacons]]/. 2008. Presentation at the Tyndall National Institute’s National Access Programme open day.

<<citeproc_bib_item_19>>Simon Dobson.  /[[https://simondobson.org/softcopy/resilient-networks-dagstuhl-talk-07.pdf][From Adaptive Systems to Adaptive Spaces]]/. 2007. Invited presentation at the Dagstuhl seminar on Resilient and Survivable Networks, Infrastructures and Services.

<<citeproc_bib_item_20>>Simon Dobson.  /[[https://simondobson.org/softcopy/myfile:research/activities/ercim-directorate-06/ercim-etsi-20071129.pdf][Towards an Integrated Internet of Things]]/. 2007. Invited presentation at the joint ERCIM/ETSI Infinity Initiative seminar series.

<<citeproc_bib_item_21>>Simon Dobson and Juan Ye.  /[[https://simondobson.org/softcopy/simple-semantic-model-leicester-talk.pdf][A Simple Semantic Model for Adaptive Pervasive Systems]]/. 2006. Invited talk to the Department of Computer Science, University of Leicester UK.

<<citeproc_bib_item_22>>Simon Dobson.  /Nirvana: Work-in-Progress/. 2005. Invited talk to the Department of Computer Science, Stevens Institute of Technology, Hoboken NJ.

<<citeproc_bib_item_23>>Simon Dobson.  /[[https://simondobson.org/softcopy/rational-reconstruction-talk.pdf][Towards a Semantics of Pervasive Computing]]/. 2004. Invited talk to the Department of Computing and Information Sciences, University of Strathclyde, and the Department of Computer Science, University College Dublin.

<<citeproc_bib_item_24>>Simon Dobson.  /Putting Research to Work/. 2003. Invited talk to the Irish Business Employers’ Confederation.

<<citeproc_bib_item_25>>Simon Dobson.  /Space Is the Computer/. 2000. Invited talk to the Oxford University Computing Laboratory.

<<citeproc_bib_item_26>>Simon Dobson.  /[[https://simondobson.org/softcopy/vanilla-microsoft-2000.ppt][Building Programming Languages from Components]]/. 2000. Invited talk to the Microsoft Research Institute.

<<citeproc_bib_item_27>>Simon Dobson.  /[[https://simondobson.org/softcopy/vanilla-caltech-1998.ppt][Fragmenting Languages]]/. 1998. Invited talk to the Department of Computer Science, California Institute of Technology.

<<citeproc_bib_item_28>>Simon Dobson.  /Correctly Formalising the Wrong Things/. 1997. Invited talk to the Irish Formal Methods Symposium.

<<citeproc_bib_item_29>>Simon Dobson.  /Weak Coherence with Shared Abstract Data Types/. 1996. Invited talk to the Department of Computer Science, University of Manchester.

<<citeproc_bib_item_30>>Simon Dobson and Victoria Burrill.  /Federated World Wide Webs/. 1996. Invited talk to the Department of Computer Science, University of Cardiff.
#+end:

