research/publications/index.html

<div id="outline-container-org3a8ebc5" class="outline-3">
<h3 id="org3a8ebc5">Invited&nbsp;presentations</h3>
<div class="outline-text-3" id="text-org3a8ebc5">
<p>
<a id="orgbdc4c98"></a>Simon Dobson.  <i>Sensor Tensors</i>. 2022. Invited talk for&nbsp;<span class="caps">LEISYS</span>’2022.
</p>

<p>
<a id="org5b57e8f"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/sensor-placement-cork-22.pdf">Sensor Interpretation Data Wrangling</a></i>. 2022. Invited talk to the School of Computer Science and Information Technology, University College&nbsp;Cork.
</p>

<p>
<a id="orgdf6b8b1"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/smeared-phase-transition.pdf">A Possible Smeared Phase Transition in Epidemic Track-and-Trace</a></i>. 2020. School seminar, School of Computer Science, University of St&nbsp;Andrews.
</p>

<p>
<a id="org2452d92"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/exploring-epidemic-spreading.pdf">Exploring Epidemic Spreading Using Network Models</a></i>. 2020. Invited talk to the Institute of Mathematics and its Applications (North-West&nbsp;branch).
</p>

<p>
<a id="org4af6755"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/minimal-sensing-idir17.pdf">Minimal Sensing: The Target Counting Problem</a></i>. 2017. Invited talk in the St Andrews Institute for Data-Intensive Research ’Summer of Data’&nbsp;series.
</p>

<p>
<a id="org24b3c4f"></a>Simon Dobson, Juan Ye, and Lei Fang.  <i><a href="https://simondobson.org/softcopy/making-sense-of-sensing.pdf">Making Sense of Sensing</a></i>. 2017. Invited talk to the Department of Computer Science, University of&nbsp;York.
</p>

<p>
<a id="orgf05a80f"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/urban-networks-16.pdf">Modelling Urban Networks: Some Results and Their Limitations</a></i>. 2016. Talk in the Leeds Applied Nonlinear Dynamics seminar series, University of&nbsp;Leeds.
</p>

<p>
<a id="org38c7c14"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/complex-cocktail.pdf">A Complex Cocktail of Networks and Reality</a></i>. 2016. Presentation at the St Andrews Big Data and Discrete Mathematics&nbsp;Symposium.
</p>

<p>
<a id="org4a85da8"></a>Simon Dobson and Saray Shai.  <i><a href="https://simondobson.org/softcopy/complex-networks-complex-processes.pdf">Complex Networks and Complex Processes</a></i>. 2014. Invited talk to the Department of Computer Science, University of&nbsp;York.
</p>

<p>
<a id="org2cc2e73"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/forth-tay.pdf">From Forth to Tay: A Component-Based Extensible Virtual Machine for Compact Programs</a></i>. 2012. Invited talk to the School of Computing, University of&nbsp;Kent.
</p>

<p>
<a id="orgc204214"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/mission-maybe-possible.pdf">Mission Maybe Possible: Improving the Programming Model for Wireless Sensor Networks</a></i>. 2012. Invited talk at the <span class="caps">IDEAS</span> Institute, Robert Gordon&nbsp;University.
</p>

<p>
<a id="org570ed25"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/inaugural-lecture-sta-web-20111207.pdf">The Computer Is the New Microscope</a></i>. 2011. Professorial inaugural lecture, University of St&nbsp;Andrews.
</p>

<p>
<a id="org52bc81d"></a>Simon Dobson and Juan Ye.  <i><a href="https://simondobson.org/softcopy/sensor-and-senseability-nontechnical.pdf">Sensor and Sense-Ability: Building Systems in the Face of Uncertainty</a></i>. 2011. Invited talk for the Edinburgh Branch of the British Computer&nbsp;Society.
</p>

<p>
<a id="org4f67472"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/back-to-the-future-talk-gp10.pdf">Progamming for Adaptive Sensor Networks: Back to the Future</a></i>. 2010. Invited talk to the <span class="caps">IFIP</span> <span class="caps">WG2</span>.11 workshop on Generative&nbsp;Programming.
</p>

<p>
<a id="orgbc639dd"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/well-founded-control-talk.pdf">Controlling Sensors through Physics: Some Ideas for the Well-Founded Control of Mobile Sensor Networks</a></i>. 2009. Invited talk at the Stevens Institute of&nbsp;Technology.
</p>

<p>
<a id="org8fa9c67"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/adaptive-spaces-lero-talk-20090123.pdf">What Is the Correct Semantic Basis for Adaptive Systems?</a></i> 2009. Invited talk in the Lero Foundations&nbsp;series.
</p>

<p>
<a id="orgeea504f"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/adaptive-systems-semantics-liverpool-09.pdf">Semantic Challenges of Adaptive Systems</a></i>. 2009. Invited talk at the Department of Computer Science, University of&nbsp;Liverpool.
</p>

<p>
<a id="org59a0a86"></a>Steve Neely, Graham Williamson, Hui Zhang, Graham Stevenson, and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/nap-zigbee-open-day-20080124.pdf">Device Positioning Using Smart Zigbee Beacons</a></i>. 2008. Presentation at the Tyndall National Institute’s National Access Programme open&nbsp;day.
</p>

<p>
<a id="org2c5b281"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/resilient-networks-dagstuhl-talk-07.pdf">From Adaptive Systems to Adaptive Spaces</a></i>. 2007. Invited presentation at the Dagstuhl seminar on Resilient and Survivable Networks, Infrastructures and&nbsp;Services.
</p>

<p>
<a id="orgb2d2f74"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/myfile:research/activities/ercim-directorate-06/ercim-etsi-20071129.pdf">Towards an Integrated Internet of Things</a></i>. 2007. Invited presentation at the joint <span class="caps">ERCIM</span>/<span class="caps">ETSI</span> Infinity Initiative seminar&nbsp;series.
</p>

<p>
<a id="orgd93405e"></a>Simon Dobson and Juan Ye.  <i><a href="https://simondobson.org/softcopy/simple-semantic-model-leicester-talk.pdf">A Simple Semantic Model for Adaptive Pervasive Systems</a></i>. 2006. Invited talk to the Department of Computer Science, University of Leicester&nbsp;<span class="caps">UK</span>.
</p>

<p>
<a id="org674aa0e"></a>Simon Dobson.  <i>Nirvana: Work-in-Progress</i>. 2005. Invited talk to the Department of Computer Science, Stevens Institute of Technology, Hoboken&nbsp;<span class="caps">NJ</span>.
</p>

<p>
<a id="orgb1071b4"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/rational-reconstruction-talk.pdf">Towards a Semantics of Pervasive Computing</a></i>. 2004. Invited talk to the Department of Computing and Information Sciences, University of Strathclyde, and the Department of Computer Science, University College&nbsp;Dublin.
</p>

<p>
<a id="org63b3530"></a>Simon Dobson.  <i>Putting Research to Work</i>. 2003. Invited talk to the Irish Business Employers’&nbsp;Confederation.
</p>

<p>
<a id="orgc589c8e"></a>Simon Dobson.  <i>Space Is the Computer</i>. 2000. Invited talk to the Oxford University Computing&nbsp;Laboratory.
</p>

<p>
<a id="orge1bdfb3"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/vanilla-microsoft-2000.ppt">Building Programming Languages from Components</a></i>. 2000. Invited talk to the Microsoft Research&nbsp;Institute.
</p>

<p>
<a id="org61b4864"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/vanilla-caltech-1998.ppt">Fragmenting Languages</a></i>. 1998. Invited talk to the Department of Computer Science, California Institute of&nbsp;Technology.
</p>

<p>
<a id="orgfdbb4a1"></a>Simon Dobson.  <i>Correctly Formalising the Wrong Things</i>. 1997. Invited talk to the Irish Formal Methods&nbsp;Symposium.
</p>

<p>
<a id="org1c2d53e"></a>Simon Dobson.  <i>Weak Coherence with Shared Abstract Data Types</i>. 1996. Invited talk to the Department of Computer Science, University of&nbsp;Manchester.
</p>

<p>
<a id="org0c87da2"></a>Simon Dobson and Victoria Burrill.  <i>Federated World Wide Webs</i>. 1996. Invited talk to the Department of Computer Science, University of&nbsp;Cardiff.
</p>
</div>
</div>
