pages/research/publications.tex

\subsection{Invited presentations}
\label{sec:org46e2125}

\label{org6d4d104}Simon Dobson.  \emph{Sensor Tensors}. 2022. Invited talk for LEISYS’2022.

\label{org2c5acd6}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/sensor-placement-cork-22.pdf}{Sensor Interpretation Data Wrangling}}. 2022. Invited talk to the School of Computer Science and Information Technology, University College Cork.

\label{org73f3690}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/smeared-phase-transition.pdf}{A Possible Smeared Phase Transition in Epidemic Track-and-Trace}}. 2020. School seminar, School of Computer Science, University of St Andrews.

\label{org215bb6d}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/exploring-epidemic-spreading.pdf}{Exploring Epidemic Spreading Using Network Models}}. 2020. Invited talk to the Institute of Mathematics and its Applications (North-West branch).

\label{org27e8302}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/minimal-sensing-idir17.pdf}{Minimal Sensing: The Target Counting Problem}}. 2017. Invited talk in the St Andrews Institute for Data-Intensive Research ’Summer of Data’ series.

\label{org19fb16d}Simon Dobson, Juan Ye, and Lei Fang.  \emph{\href{https://simondobson.org/softcopy/making-sense-of-sensing.pdf}{Making Sense of Sensing}}. 2017. Invited talk to the Department of Computer Science, University of York.

\label{org0555aca}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/urban-networks-16.pdf}{Modelling Urban Networks: Some Results and Their Limitations}}. 2016. Talk in the Leeds Applied Nonlinear Dynamics seminar series, University of Leeds.

\label{org3e2d37a}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/complex-cocktail.pdf}{A Complex Cocktail of Networks and Reality}}. 2016. Presentation at the St Andrews Big Data and Discrete Mathematics Symposium.

\label{org180a059}Simon Dobson and Saray Shai.  \emph{\href{https://simondobson.org/softcopy/complex-networks-complex-processes.pdf}{Complex Networks and Complex Processes}}. 2014. Invited talk to the Department of Computer Science, University of York.

\label{orgc483d21}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/forth-tay.pdf}{From Forth to Tay: A Component-Based Extensible Virtual Machine for Compact Programs}}. 2012. Invited talk to the School of Computing, University of Kent.

\label{org4c790b3}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/mission-maybe-possible.pdf}{Mission Maybe Possible: Improving the Programming Model for Wireless Sensor Networks}}. 2012. Invited talk at the IDEAS Institute, Robert Gordon University.

\label{org04e9b3f}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/inaugural-lecture-sta-web-20111207.pdf}{The Computer Is the New Microscope}}. 2011. Professorial inaugural lecture, University of St Andrews.

\label{org7162950}Simon Dobson and Juan Ye.  \emph{\href{https://simondobson.org/softcopy/sensor-and-senseability-nontechnical.pdf}{Sensor and Sense-Ability: Building Systems in the Face of Uncertainty}}. 2011. Invited talk for the Edinburgh Branch of the British Computer Society.

\label{orgfed5744}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/back-to-the-future-talk-gp10.pdf}{Progamming for Adaptive Sensor Networks: Back to the Future}}. 2010. Invited talk to the IFIP WG2.11 workshop on Generative Programming.

\label{orgbea5558}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/well-founded-control-talk.pdf}{Controlling Sensors through Physics: Some Ideas for the Well-Founded Control of Mobile Sensor Networks}}. 2009. Invited talk at the Stevens Institute of Technology.

\label{org00f558f}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/adaptive-spaces-lero-talk-20090123.pdf}{What Is the Correct Semantic Basis for Adaptive Systems?}} 2009. Invited talk in the Lero Foundations series.

\label{orgb35db91}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/adaptive-systems-semantics-liverpool-09.pdf}{Semantic Challenges of Adaptive Systems}}. 2009. Invited talk at the Department of Computer Science, University of Liverpool.

\label{org5d2e47b}Steve Neely, Graham Williamson, Hui Zhang, Graham Stevenson, and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/nap-zigbee-open-day-20080124.pdf}{Device Positioning Using Smart Zigbee Beacons}}. 2008. Presentation at the Tyndall National Institute’s National Access Programme open day.

\label{org44b9c46}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/resilient-networks-dagstuhl-talk-07.pdf}{From Adaptive Systems to Adaptive Spaces}}. 2007. Invited presentation at the Dagstuhl seminar on Resilient and Survivable Networks, Infrastructures and Services.

\label{orgbda710f}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/myfile:research/activities/ercim-directorate-06/ercim-etsi-20071129.pdf}{Towards an Integrated Internet of Things}}. 2007. Invited presentation at the joint ERCIM/ETSI Infinity Initiative seminar series.

\label{org12b7f89}Simon Dobson and Juan Ye.  \emph{\href{https://simondobson.org/softcopy/simple-semantic-model-leicester-talk.pdf}{A Simple Semantic Model for Adaptive Pervasive Systems}}. 2006. Invited talk to the Department of Computer Science, University of Leicester UK.

\label{org616c0f1}Simon Dobson.  \emph{Nirvana: Work-in-Progress}. 2005. Invited talk to the Department of Computer Science, Stevens Institute of Technology, Hoboken NJ.

\label{org58782f2}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/rational-reconstruction-talk.pdf}{Towards a Semantics of Pervasive Computing}}. 2004. Invited talk to the Department of Computing and Information Sciences, University of Strathclyde, and the Department of Computer Science, University College Dublin.

\label{orgd3f58ab}Simon Dobson.  \emph{Putting Research to Work}. 2003. Invited talk to the Irish Business Employers’ Confederation.

\label{org8b12206}Simon Dobson.  \emph{Space Is the Computer}. 2000. Invited talk to the Oxford University Computing Laboratory.

\label{org05f8513}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/vanilla-microsoft-2000.ppt}{Building Programming Languages from Components}}. 2000. Invited talk to the Microsoft Research Institute.

\label{org3f64bfa}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/vanilla-caltech-1998.ppt}{Fragmenting Languages}}. 1998. Invited talk to the Department of Computer Science, California Institute of Technology.

\label{org1a20efd}Simon Dobson.  \emph{Correctly Formalising the Wrong Things}. 1997. Invited talk to the Irish Formal Methods Symposium.

\label{orgbecc6db}Simon Dobson.  \emph{Weak Coherence with Shared Abstract Data Types}. 1996. Invited talk to the Department of Computer Science, University of Manchester.

\label{org9f3ed4e}Simon Dobson and Victoria Burrill.  \emph{Federated World Wide Webs}. 1996. Invited talk to the Department of Computer Science, University of Cardiff.
