pages/research/publications.org
** Strategic reports

#+begin: sd/bibliography :key category :value "strategic report"
<<citeproc_bib_item_1>>Seán Baker, Simon Dobson, Pat Donnellan, Paul Kavanagh, Dan Maher, Tommy McCabe, Richard McQuillen, Paddy Holohan, Michael O’Connor, and Declan O’Mahony.  /Successful Commercialisation of R&D/. Irish Business Employers’ Confederation/ICT Ireland. 2004.

<<citeproc_bib_item_2>>Seán Baker, Simon Dobson, Dan Flinter, Michael Grufferty, Paul Kavanagh, Dan Maher, Tommy McCabe, and Richard McQuillen.  /Commercialisation of R&D in the ICT Sector/. Irish Business Employers’ Confederation/ICT Ireland. 2004.
#+end:

