research/publications/index.html

<div id="outline-container-org82363a6" class="outline-3">
<h3 id="org82363a6">Strategic&nbsp;reports</h3>
<div class="outline-text-3" id="text-org82363a6">
<p>
<a id="org6190a1d"></a>Seán Baker, Simon Dobson, Pat Donnellan, Paul Kavanagh, Dan Maher, Tommy McCabe, Richard McQuillen, Paddy Holohan, Michael O’Connor, and Declan O’Mahony.  <i>Successful Commercialisation of R&amp;D</i>. Irish Business Employers’ Confederation/<span class="caps">ICT</span> Ireland.&nbsp;2004.
</p>

<p>
<a id="orgea2bd6e"></a>Seán Baker, Simon Dobson, Dan Flinter, Michael Grufferty, Paul Kavanagh, Dan Maher, Tommy McCabe, and Richard McQuillen.  <i>Commercialisation of R&amp;D in the <span class="caps">ICT</span> Sector</i>. Irish Business Employers’ Confederation/<span class="caps">ICT</span> Ireland.&nbsp;2004.
</p>
</div>
</div>
