pages/research/publications.tex

\subsection{Strategic reports}
\label{sec:orgb436057}

\label{org2ef955b}Seán Baker, Simon Dobson, Pat Donnellan, Paul Kavanagh, Dan Maher, Tommy McCabe, Richard McQuillen, Paddy Holohan, Michael O’Connor, and Declan O’Mahony.  \emph{Successful Commercialisation of R\&D}. Irish Business Employers’ Confederation/ICT Ireland. 2004.

\label{org88a6816}Seán Baker, Simon Dobson, Dan Flinter, Michael Grufferty, Paul Kavanagh, Dan Maher, Tommy McCabe, and Richard McQuillen.  \emph{Commercialisation of R\&D in the ICT Sector}. Irish Business Employers’ Confederation/ICT Ireland. 2004.
