research/publications/index.html

<div id="outline-container-org8ae159d" class="outline-3">
<h3 id="org8ae159d">Technical&nbsp;reports</h3>
<div class="outline-text-3" id="text-org8ae159d">
<p>
<a id="orgdc02c9c"></a>Peter Mann, Lei Fang, and Simon Dobson.  <i><a href="https://arxiv.org/abs/2210.02528v1">Mixing Patterns in Graphs with Higher-Order Structure</a></i>. Technical report arXiv:2210.02528. arXiv.&nbsp;2022.
</p>

<p>
<a id="orgfbf7312"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/TCD-CS-2004-05.pdf">Where’s Waldo? or, a Taxonomy for Thinking About Location in Pervasive Computing</a></i>. Technical report <span class="caps">TCD</span>-<span class="caps">CS</span>-2004-05. Department of Computer Science, Trinity College Dublin.&nbsp;2004.
</p>

<p>
<a id="orgdd0d107"></a>Howard Kim and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/TCD-CS-2001-49.pdf">An Improved Approach to Geographically Locating Web Clients</a></i>. Technical report <span class="caps">TCD</span>-<span class="caps">CS</span>-2001-49. Department of Computer Science, Trinity College Dublin.&nbsp;2004.
</p>

<p>
<a id="org1685f29"></a>Tim Walsh, Paddy Nixon, and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/TCD-CS-2000-11.pdf">As Strong as Possible Mobility: An Architecture for Stateful Object Migration on the Internet</a></i>. Technical report <span class="caps">TCD</span>-<span class="caps">CS</span>-2000-11. Department of Computer Science, Trinity College Dublin.&nbsp;2000.
</p>

<p>
<a id="orga39b5e1"></a>Tim Walsh, Paddy Nixon, and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/TCD-CS-2000-13.pdf">A Review of Mobility Systems</a></i>. Technical report <span class="caps">TCD</span>-<span class="caps">CS</span>-2000-13. Department of Computer Science, Trinity College Dublin.&nbsp;2000.
</p>

<p>
<a id="org2180332"></a>Linda Farragher and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/TCD-CS-2000-22.pdf">Java Decaffeinated: Experiences Building a Programming Language from Components</a></i>. Technical report <span class="caps">TCD</span>-<span class="caps">CS</span>-2000-22. Department of Computer Science, Trinity College Dublin.&nbsp;2000.
</p>

<p>
<a id="orgfc619ba"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/ions-tr-1999.pdf">What’s in an Ion?</a></i> Department of Computer Science, Trinity College Dublin.&nbsp;2000.
</p>

<p>
<a id="org5a8cc10"></a>Tim Walsh, Paddy Nixon, and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/TCD-CS-1999-03.pdf">A Managed Architecture for Mobile Distributed Systems</a></i>. Technical report <span class="caps">TCD</span>-<span class="caps">CS</span>-1999-03. Department of Computer Science, Trinity College Dublin.&nbsp;1999.
</p>

<p>
<a id="orgee9d914"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/TCD-CS-1998-20.ps">A First Taste of Vanilla</a></i>. Technical report <span class="caps">TCD</span>-<span class="caps">CS</span>-1998-20. Department of Computer Science, Trinity College Dublin.&nbsp;1998.
</p>

<p>
<a id="orgd0ef26e"></a>Simon Dobson.  <i>The O2 Programming Language</i>. Department of Computer Science, Trinity College Dublin. 1998. Reference manual for the Vanilla implementation of Abadí and Cardelli’s O2&nbsp;language.
</p>

<p>
<a id="orgd76992f"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/TCD-CS-1998-19.ps">Modular Parsers</a></i>. Technical report <span class="caps">TCD</span>-<span class="caps">CS</span>-1998-19. Department of Computer Science, Trinity College Dublin.&nbsp;1998.
</p>

<p>
<a id="orgcaae866"></a>Chris Tofts, Don Goodeve, and Simon Dobson.  <i><a href="https://simondobson.org/softcopy/YCS-98-307.pdf">Abstraction and Implementation of a Lightweight Distributed Termination Protocol</a></i>. Technical report <span class="caps">YCS</span>-98-307. Department of Computer Science, University of York.&nbsp;1998.
</p>

<p>
<a id="orgc4f5540"></a>Simon Dobson.  <i>A Common Object Model for Large Experimental Systems: A Proposal</i>. Rutherford Appleton Laboratory.&nbsp;1997.
</p>

<p>
<a id="org3e018a2"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/bulk-data-types.pdf">An Introduction to the Theories of Bulk Data Types</a></i>. Rutherford Appleton Laboratory.&nbsp;1994.
</p>

<p>
<a id="org53a6edb"></a>Simon Dobson, Victoria Burrill, and Julian Gallop.  <i><a href="https://simondobson.org/softcopy/semantic-markup-94.pdf">Semantic Mark-up of Generalised Documents</a></i>. Technical report <span class="caps">WWW</span>/01/94. Rutherford Appleton Laboratory.&nbsp;1994.
</p>

<p>
<a id="orge7af28d"></a>Simon Dobson and Victoria Burrill.  <i><a href="https://simondobson.org/softcopy/preliminary-markup-94.pdf">Preliminary Results from the Database Markup of Hyperdocuments</a></i>. Technical report <span class="caps">WWW</span>/03/94. Rutherford Appleton Laboratory.&nbsp;1994.
</p>

<p>
<a id="org943aac7"></a>Simon Dobson and Victoria Burrill.  <i>Lightweight Data Mark-up</i>. Technical report <span class="caps">WWW</span>/04/94. Rutherford Appleton laboratory.&nbsp;1994.
</p>

<p>
<a id="orgf295fbd"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/hyper-94.pdf">Data and Hypermodels Are Isomorphic: Manipulating Hyperdocuments at a Logical Level</a></i>. Technical report <span class="caps">WWW</span>/02/94. Rutherford Appleton Laboratory.&nbsp;1994.
</p>

<p>
<a id="org54c11a0"></a>Simon Dobson.  <i>Writing Compilers Using <span class="caps">ML</span></i>. Technical report <span class="caps">PPG</span>/99/93. Rutherford Appleton Laboratory.&nbsp;1993.
</p>

<p>
<a id="orgd7215ae"></a>Simon Dobson.  <i><a href="https://simondobson.org/softcopy/thesis-final.pdf">An Approach to Scalable Parallel Programming</a></i>. Technical report <span class="caps">YCST</span>/93/03. Department of Computer Science, University of York.&nbsp;1993.
</p>
</div>
</div>
</div>
	    </div>
	</article>
</div>

	<!-- Social sharing section -->

	<!-- Tag Section -->

	<!-- Post Navigation links -->

    <!-- Page Footer -->
    <section class="footer-sidebar clear" role="complementary"><div class="widget-block">
	    <aside class="widget"><h2 class="widget-title">Simon&nbsp;Dobson</h2>
		<div class="widget-text">Aut tace aut loquere meliora silentio</div>
	    </aside>
</div>
    </section><!-- Extra JavaScript --><!-- Site Attributions --><footer class="site-footer" role="contentinfo"><div class="site-info">
	    <p></p>
	    <p>
	      Built with free and open-source software.
	      Powered by <a href="https://getnikola.com/">Nikola</a> using a theme based on
	      <a href="https://themes.getnikola.com/v7/libretto/">Libretto</a>.
	    </p>
	    <p>
	      All content Copyright © 2010–2024 Simon Dobson and licensed under
	      <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/"><span class="caps">CC</span>-<span class="caps">BY</span>-<span class="caps">NC</span>-<span class="caps">SA</span>-4.0</a>
	      unless otherwise&nbsp;noted.
	    </p>
	</div>
	<div class="social">
	    <ul class="menu"></ul>
</div>
    </footer>
</body>
</html>