pages/research/publications.tex

\subsection{Technical reports}
\label{sec:org5f15012}

\label{org20b60de}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/TCD-CS-2004-05.pdf}{Where’s Waldo? or, a Taxonomy for Thinking About Location in Pervasive Computing}}. Technical report TCD-CS-2004-05. Department of Computer Science, Trinity College Dublin. 2004.

\label{org7d9808f}Howard Kim and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/TCD-CS-2001-49.pdf}{An Improved Approach to Geographically Locating Web Clients}}. Technical report TCD-CS-2001-49. Department of Computer Science, Trinity College Dublin. 2004.

\label{org8d63353}Tim Walsh, Paddy Nixon, and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/TCD-CS-2000-11.pdf}{As Strong as Possible Mobility: An Architecture for Stateful Object Migration on the Internet}}. Technical report TCD-CS-2000-11. Department of Computer Science, Trinity College Dublin. 2000.

\label{org419e48d}Tim Walsh, Paddy Nixon, and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/TCD-CS-2000-13.pdf}{A Review of Mobility Systems}}. Technical report TCD-CS-2000-13. Department of Computer Science, Trinity College Dublin. 2000.

\label{org523d12e}Linda Farragher and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/TCD-CS-2000-22.pdf}{Java Decaffeinated: Experiences Building a Programming Language from Components}}. Technical report TCD-CS-2000-22. Department of Computer Science, Trinity College Dublin. 2000.

\label{org1554e23}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/ions-tr-1999.pdf}{What’s in an Ion?}} Department of Computer Science, Trinity College Dublin. 2000.

\label{orge127b52}Tim Walsh, Paddy Nixon, and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/TCD-CS-1999-03.pdf}{A Managed Architecture for Mobile Distributed Systems}}. Technical report TCD-CS-1999-03. Department of Computer Science, Trinity College Dublin. 1999.

\label{org647efc7}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/TCD-CS-1998-20.ps}{A First Taste of Vanilla}}. Technical report TCD-CS-1998-20. Department of Computer Science, Trinity College Dublin. 1998.

\label{org0e4f73d}Simon Dobson.  \emph{The O2 Programming Language}. Department of Computer Science, Trinity College Dublin. 1998. Reference manual for the Vanilla implementation of Abadí and Cardelli’s O2 language.

\label{org943a09a}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/TCD-CS-1998-19.ps}{Modular Parsers}}. Technical report TCD-CS-1998-19. Department of Computer Science, Trinity College Dublin. 1998.

\label{org4ee8693}Chris Tofts, Don Goodeve, and Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/YCS-98-307.pdf}{Abstraction and Implementation of a Lightweight Distributed Termination Protocol}}. Technical report YCS-98-307. Department of Computer Science, University of York. 1998.

\label{orgef2e381}Simon Dobson.  \emph{A Common Object Model for Large Experimental Systems: A Proposal}. Rutherford Appleton Laboratory. 1997.

\label{orgd5a438b}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/bulk-data-types.pdf}{An Introduction to the Theories of Bulk Data Types}}. Rutherford Appleton Laboratory. 1994.

\label{org73989e9}Simon Dobson, Victoria Burrill, and Julian Gallop.  \emph{\href{https://simondobson.org/softcopy/semantic-markup-94.pdf}{Semantic Mark-up of Generalised Documents}}. Technical report WWW/01/94. Rutherford Appleton Laboratory. 1994.

\label{orge96e074}Simon Dobson and Victoria Burrill.  \emph{\href{https://simondobson.org/softcopy/preliminary-markup-94.pdf}{Preliminary Results from the Database Markup of Hyperdocuments}}. Technical report WWW/03/94. Rutherford Appleton Laboratory. 1994.

\label{orgab78230}Simon Dobson and Victoria Burrill.  \emph{Lightweight Data Mark-up}. Technical report WWW/04/94. Rutherford Appleton laboratory. 1994.

\label{org1dd3938}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/hyper-94.pdf}{Data and Hypermodels Are Isomorphic: Manipulating Hyperdocuments at a Logical Level}}. Technical report WWW/02/94. Rutherford Appleton Laboratory. 1994.

\label{orgbab3251}Simon Dobson.  \emph{Writing Compilers Using ML}. Technical report PPG/99/93. Rutherford Appleton Laboratory. 1993.

\label{org85440dd}Simon Dobson.  \emph{\href{https://simondobson.org/softcopy/thesis-final.pdf}{An Approach to Scalable Parallel Programming}}. Technical report YCST/93/03. Department of Computer Science, University of York. 1993.
\end{document}
